/*
#############################################################################################
# Bullet Run (Unknown) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: OnlineSubsystemGameSpy_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function OnlineSubsystemGameSpy.OnlineGameInterfaceGameSpy.QueryNonAdvertisedData
// [0x00020400] ( FUNC_Native )
struct UOnlineGameInterfaceGameSpy_execQueryNonAdvertisedData_Parms
{
	int                                                StartAt;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                NumberToQuery;                                    		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineGameInterfaceGameSpy.ClearUnregisterPlayerCompleteDelegate
// [0x00020002] 
struct UOnlineGameInterfaceGameSpy_execClearUnregisterPlayerCompleteDelegate_Parms
{
	struct FScriptDelegate                             UnregisterPlayerCompleteDelegate;                 		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineGameInterfaceGameSpy.AddUnregisterPlayerCompleteDelegate
// [0x00020002] 
struct UOnlineGameInterfaceGameSpy_execAddUnregisterPlayerCompleteDelegate_Parms
{
	struct FScriptDelegate                             UnregisterPlayerCompleteDelegate;                 		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineGameInterfaceGameSpy.OnUnregisterPlayerComplete
// [0x00120000] 
struct UOnlineGameInterfaceGameSpy_execOnUnregisterPlayerComplete_Parms
{
	struct FName                                       SessionName;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FUniqueNetId                                PlayerID;                                         		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0010 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function OnlineSubsystemGameSpy.OnlineGameInterfaceGameSpy.UnregisterPlayer
// [0x00020400] ( FUNC_Native )
struct UOnlineGameInterfaceGameSpy_execUnregisterPlayer_Parms
{
	struct FName                                       SessionName;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FUniqueNetId                                PlayerID;                                         		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineGameInterfaceGameSpy.ClearRegisterPlayerCompleteDelegate
// [0x00020002] 
struct UOnlineGameInterfaceGameSpy_execClearRegisterPlayerCompleteDelegate_Parms
{
	struct FScriptDelegate                             RegisterPlayerCompleteDelegate;                   		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineGameInterfaceGameSpy.AddRegisterPlayerCompleteDelegate
// [0x00020002] 
struct UOnlineGameInterfaceGameSpy_execAddRegisterPlayerCompleteDelegate_Parms
{
	struct FScriptDelegate                             RegisterPlayerCompleteDelegate;                   		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineGameInterfaceGameSpy.OnRegisterPlayerComplete
// [0x00120000] 
struct UOnlineGameInterfaceGameSpy_execOnRegisterPlayerComplete_Parms
{
	struct FName                                       SessionName;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FUniqueNetId                                PlayerID;                                         		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0010 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function OnlineSubsystemGameSpy.OnlineGameInterfaceGameSpy.RegisterPlayer
// [0x00020400] ( FUNC_Native )
struct UOnlineGameInterfaceGameSpy_execRegisterPlayer_Parms
{
	struct FName                                       SessionName;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FUniqueNetId                                PlayerID;                                         		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bWasInvited : 1;                                  		// 0x0010 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineGameInterfaceGameSpy.AcceptGameInvite
// [0x00020400] ( FUNC_Native )
struct UOnlineGameInterfaceGameSpy_execAcceptGameInvite_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       SessionName;                                      		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineGameInterfaceGameSpy.OnGameInviteAccepted
// [0x00520000] 
struct UOnlineGameInterfaceGameSpy_execOnGameInviteAccepted_Parms
{
	struct FOnlineGameSearchResult                     InviteResult;                                     		// 0x0000 (0x000C) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
};

// Function OnlineSubsystemGameSpy.OnlineGameInterfaceGameSpy.ClearGameInviteAcceptedDelegate
// [0x00020002] 
struct UOnlineGameInterfaceGameSpy_execClearGameInviteAcceptedDelegate_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	struct FScriptDelegate                             GameInviteAcceptedDelegate;                       		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineGameInterfaceGameSpy.AddGameInviteAcceptedDelegate
// [0x00020002] 
struct UOnlineGameInterfaceGameSpy_execAddGameInviteAcceptedDelegate_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	struct FScriptDelegate                             GameInviteAcceptedDelegate;                       		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineGameInterfaceGameSpy.UpdateOnlineGame
// [0x00024400] ( FUNC_Native )
struct UOnlineGameInterfaceGameSpy_execUpdateOnlineGame_Parms
{
	struct FName                                       SessionName;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UOnlineGameSettings*                         UpdatedGameSettings;                              		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bShouldRefreshOnlineData : 1;                     		// 0x000C (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.clearReconnection
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execclearReconnection_Parms
{
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.JoinGameByURL
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execJoinGameByURL_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     LocationString;                                   		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.SetOnlineStatusPwd
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execSetOnlineStatusPwd_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                StatusId;                                         		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bPasswordServer : 1;                              		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.DisableVoice
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execDisableVoice_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.EnableVoice
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execEnableVoice_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.IsVoiceEnabled
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execIsVoiceEnabled_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.GetFriendshipList
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execGetFriendshipList_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.UpdateBuddyFriendship
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execUpdateBuddyFriendship_Parms
{
	int                                                RecordId;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     nick;                                             		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                Status;                                           		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearGetFriendshipListDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearGetFriendshipListDelegate_Parms
{
	struct FScriptDelegate                             GetFriendshipListDelegate;                        		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddGetFriendshipListDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddGetFriendshipListDelegate_Parms
{
	struct FScriptDelegate                             GetFriendshipListDelegate;                        		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearUpdateBuddyFriendshipCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearUpdateBuddyFriendshipCompleteDelegate_Parms
{
	struct FScriptDelegate                             UpdateBuddyFriendshipCompleteDelegate;            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddUpdateBuddyFriendshipCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddUpdateBuddyFriendshipCompleteDelegate_Parms
{
	struct FScriptDelegate                             UpdateBuddyFriendshipCompleteDelegate;            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnGetFriendshipListComplete
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnGetFriendshipListComplete_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnUpdateBuddyFriendshipComplete
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnUpdateBuddyFriendshipComplete_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	int                                                RecordId;                                         		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     nick;                                             		// 0x0008 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                friendStatus;                                     		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.GetLastBuddyImageIndexArray
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execGetLastBuddyImageIndexArray_Parms
{
	TArray< struct FBuddyImageIndexContainer >         ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearGetBuddyListImageIndexCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearGetBuddyListImageIndexCompleteDelegate_Parms
{
	struct FScriptDelegate                             GetBuddyListImageIndexCompleteDelegate;           		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddGetBuddyListImageIndexCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddGetBuddyListImageIndexCompleteDelegate_Parms
{
	struct FScriptDelegate                             GetBuddyListImageIndexCompleteDelegate;           		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnGetBuddyListImageIndexComplete
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnGetBuddyListImageIndexComplete_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.GetBuddyListImageIndex
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execGetBuddyListImageIndex_Parms
{
	TArray< struct FString >                           NickNames;                                        		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.GetCurrentByteData
// [0x00420002] 
struct UOnlineSubsystemGameSpy_execGetCurrentByteData_Parms
{
	TArray< unsigned char >                            Data;                                             		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearWriteByteDataCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearWriteByteDataCompleteDelegate_Parms
{
	struct FScriptDelegate                             WriteByteDataCompleteDelegate;                    		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             nIndex;                                           		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddWriteByteDataCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddWriteByteDataCompleteDelegate_Parms
{
	struct FScriptDelegate                             WriteByteDataCompleteDelegate;                    		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnWriteByteDataComplete
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnWriteByteDataComplete_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.WriteByteData
// [0x00420400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execWriteByteData_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	TArray< unsigned char >                            Data;                                             		// 0x0004 (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	struct FString                                     table_name;                                       		// 0x0010 (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	struct FString                                     field_name;                                       		// 0x001C (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      bCreateNew : 1;                                   		// 0x0028 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x002C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearReadByteDataCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearReadByteDataCompleteDelegate_Parms
{
	struct FScriptDelegate                             ReadByteDataCompleteDelegate;                     		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             nIndex;                                           		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddReadByteDataCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddReadByteDataCompleteDelegate_Parms
{
	struct FScriptDelegate                             ReadByteDataCompleteDelegate;                     		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnReadByteDataComplete
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnReadByteDataComplete_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ReadByteData
// [0x00420400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execReadByteData_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     table_name;                                       		// 0x0004 (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	struct FString                                     field_name;                                       		// 0x0010 (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x001C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ValidateAndSaveKey
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execValidateAndSaveKey_Parms
{
	struct FString                                     CDKey;                                            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearOnValidateAndSaveKeyDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearOnValidateAndSaveKeyDelegate_Parms
{
	struct FScriptDelegate                             OnValidateAndSaveKeyDelegate;                     		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddOnValidateAndSaveKeyDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddOnValidateAndSaveKeyDelegate_Parms
{
	struct FScriptDelegate                             OnValidateAndSaveKeyDelegate;                     		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnValidateAndSaveKey
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnValidateAndSaveKey_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.GetPublicAddress
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execGetPublicAddress_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ChatSendMessage
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execChatSendMessage_Parms
{
	struct FString                                     Channel;                                          		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     Message;                                          		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearOnChatUserPartedDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearOnChatUserPartedDelegate_Parms
{
	struct FScriptDelegate                             ChatUserPartedDelegate;                           		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddOnChatUserPartedDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddOnChatUserPartedDelegate_Parms
{
	struct FScriptDelegate                             ChatUserPartedDelegate;                           		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnChatUserParted
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnChatUserParted_Parms
{
	struct FString                                     Channel;                                          		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     NickName;                                         		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearOnChatUserJoinedDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearOnChatUserJoinedDelegate_Parms
{
	struct FScriptDelegate                             ChatUserJoinedDelegate;                           		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddOnChatUserJoinedDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddOnChatUserJoinedDelegate_Parms
{
	struct FScriptDelegate                             ChatUserJoinedDelegate;                           		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnChatUserJoined
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnChatUserJoined_Parms
{
	struct FString                                     Channel;                                          		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     NickName;                                         		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearOnChatMessageReceivedDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearOnChatMessageReceivedDelegate_Parms
{
	struct FScriptDelegate                             ChatMessageReceivedDelegate;                      		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddOnChatMessageReceivedDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddOnChatMessageReceivedDelegate_Parms
{
	struct FScriptDelegate                             ChatMessageReceivedDelegate;                      		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnChatMessageReceived
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnChatMessageReceived_Parms
{
	struct FString                                     Channel;                                          		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     NickName;                                         		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     Message;                                          		// 0x0018 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ChatLeaveChannel
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execChatLeaveChannel_Parms
{
	struct FString                                     Channel;                                          		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ChatGetNumUsers
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execChatGetNumUsers_Parms
{
	struct FString                                     Channel;                                          		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearChatEnterChannelCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearChatEnterChannelCompleteDelegate_Parms
{
	struct FScriptDelegate                             ChatEnterChannelCompleteDelegate;                 		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddChatEnterChannelCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddChatEnterChannelCompleteDelegate_Parms
{
	struct FScriptDelegate                             ChatEnterChannelCompleteDelegate;                 		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnChatEnterChannelComplete
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnChatEnterChannelComplete_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ChatEnterChannel
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execChatEnterChannel_Parms
{
	struct FString                                     Channel;                                          		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ChatDisconnect
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execChatDisconnect_Parms
{
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearChatDisconnectedDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearChatDisconnectedDelegate_Parms
{
	struct FScriptDelegate                             ChatDisconnectedDelegate;                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddChatDisconnectedDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddChatDisconnectedDelegate_Parms
{
	struct FScriptDelegate                             ChatDisconnectedDelegate;                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnChatDisconnected
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnChatDisconnected_Parms
{
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearChatConnectedDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearChatConnectedDelegate_Parms
{
	struct FScriptDelegate                             ChatConnectedDelegate;                            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddChatConnectedDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddChatConnectedDelegate_Parms
{
	struct FScriptDelegate                             ChatConnectedDelegate;                            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ChatConnect
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execChatConnect_Parms
{
	struct FString                                     Server;                                           		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     NickName;                                         		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.IsChannelConnected
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execIsChannelConnected_Parms
{
	struct FString                                     sChannel;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.IsChatConnected
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execIsChatConnected_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnChatConnected
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnChatConnected_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ReturnBuddyImageIndex
// [0x00420400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execReturnBuddyImageIndex_Parms
{
	struct FBuddyImageIndexContainer                   BuddyImageIndex;                                  		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned char                                      ReturnValue;                                      		// 0x0010 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearGetBuddyImageIndexCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearGetBuddyImageIndexCompleteDelegate_Parms
{
	struct FScriptDelegate                             GetBuddyImageIndexCompleteDelegate;               		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddGetBuddyImageIndexCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddGetBuddyImageIndexCompleteDelegate_Parms
{
	struct FScriptDelegate                             GetBuddyImageIndexCompleteDelegate;               		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnGetBuddyImageIndexComplete
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnGetBuddyImageIndexComplete_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.GetBuddyImageIndex
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execGetBuddyImageIndex_Parms
{
	struct FString                                     NickName;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearCreateBuddyImageIndexCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearCreateBuddyImageIndexCompleteDelegate_Parms
{
	struct FScriptDelegate                             CreateBuddyImageIndexCompleteDelegate;            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddCreateBuddyImageIndexCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddCreateBuddyImageIndexCompleteDelegate_Parms
{
	struct FScriptDelegate                             CreateBuddyImageIndexCompleteDelegate;            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnCreateBuddyImageIndexComplete
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnCreateBuddyImageIndexComplete_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.CreateBuddyImageIndex
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execCreateBuddyImageIndex_Parms
{
	struct FString                                     NickName;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ImageIndex;                                       		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearRemoveBuddyRequestCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearRemoveBuddyRequestCompleteDelegate_Parms
{
	struct FScriptDelegate                             RemoveBuddyRequestCompleteDelegate;               		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddRemoveBuddyRequestCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddRemoveBuddyRequestCompleteDelegate_Parms
{
	struct FScriptDelegate                             RemoveBuddyRequestCompleteDelegate;               		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnRemoveBuddyRequestComplete
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnRemoveBuddyRequestComplete_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.RemoveBuddyRequest
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execRemoveBuddyRequest_Parms
{
	struct FString                                     NickName;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.GetBuddyRequestList
// [0x00420400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execGetBuddyRequestList_Parms
{
	TArray< struct FRequestEntry >                     RequestList;                                      		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned char                                      ReturnValue;                                      		// 0x000C (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearReadBuddyRequestListCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearReadBuddyRequestListCompleteDelegate_Parms
{
	struct FScriptDelegate                             ReadBuddyRequestListCompleteDelegate;             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddReadBuddyRequestListCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddReadBuddyRequestListCompleteDelegate_Parms
{
	struct FScriptDelegate                             ReadBuddyRequestListCompleteDelegate;             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnReadBuddyRequestListComplete
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnReadBuddyRequestListComplete_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ReadBuddyRequestList
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execReadBuddyRequestList_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearCreateBuddyRequestCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearCreateBuddyRequestCompleteDelegate_Parms
{
	struct FScriptDelegate                             CreateBuddyRequestCompleteDelegate;               		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddCreateBuddyRequestCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddCreateBuddyRequestCompleteDelegate_Parms
{
	struct FScriptDelegate                             CreateBuddyRequestCompleteDelegate;               		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnCreateBuddyRequestComplete
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnCreateBuddyRequestComplete_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	int                                                RecordId;                                         		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     NickName;                                         		// 0x0008 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FUniqueNetId                                Id;                                               		// 0x0014 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.CreateBuddyRequest
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execCreateBuddyRequest_Parms
{
	struct FString                                     NickName;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FUniqueNetId                                Id;                                               		// 0x000C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearRemoveBuddyAuthorizationCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearRemoveBuddyAuthorizationCompleteDelegate_Parms
{
	struct FScriptDelegate                             RemoveBuddyAuthorizationCompleteDelegate;         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddRemoveBuddyAuthorizationCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddRemoveBuddyAuthorizationCompleteDelegate_Parms
{
	struct FScriptDelegate                             RemoveBuddyAuthorizationCompleteDelegate;         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnRemoveBuddyAuthorizationComplete
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnRemoveBuddyAuthorizationComplete_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.RemoveBuddyAuthorization
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execRemoveBuddyAuthorization_Parms
{
	struct FString                                     NickName;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.GetBuddyAuthorizationList
// [0x00420400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execGetBuddyAuthorizationList_Parms
{
	TArray< struct FString >                           AuthorizationList;                                		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned char                                      ReturnValue;                                      		// 0x000C (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearReadBuddyAuthorizationListCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearReadBuddyAuthorizationListCompleteDelegate_Parms
{
	struct FScriptDelegate                             ReadBuddyAuthorizationListCompleteDelegate;       		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddReadBuddyAuthorizationListCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddReadBuddyAuthorizationListCompleteDelegate_Parms
{
	struct FScriptDelegate                             ReadBuddyAuthorizationListCompleteDelegate;       		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnReadBuddyAuthorizationListComplete
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnReadBuddyAuthorizationListComplete_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ReadBuddyAuthorizationList
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execReadBuddyAuthorizationList_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearCreateBuddyAuthorizationCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearCreateBuddyAuthorizationCompleteDelegate_Parms
{
	struct FScriptDelegate                             CreateBuddyAuthorizationCompleteDelegate;         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddCreateBuddyAuthorizationCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddCreateBuddyAuthorizationCompleteDelegate_Parms
{
	struct FScriptDelegate                             CreateBuddyAuthorizationCompleteDelegate;         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnCreateBuddyAuthorizationComplete
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnCreateBuddyAuthorizationComplete_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	int                                                RecordId;                                         		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     NickName;                                         		// 0x0008 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.CreateBuddyAuthorization
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execCreateBuddyAuthorization_Parms
{
	struct FString                                     NickName;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.GetSearchFriendsList
// [0x00420400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execGetSearchFriendsList_Parms
{
	TArray< struct FString >                           SearchResult;                                     		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned char                                      ReturnValue;                                      		// 0x000C (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearSearchFriendsCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearSearchFriendsCompleteDelegate_Parms
{
	struct FScriptDelegate                             SearchFriendsCompleteDelegate;                    		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.AddSearchFriendsCompleteDelegate
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execAddSearchFriendsCompleteDelegate_Parms
{
	struct FScriptDelegate                             SearchFriendsCompleteDelegate;                    		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.OnSearchFriendsComplete
// [0x00120000] 
struct UOnlineSubsystemGameSpy_execOnSearchFriendsComplete_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.SearchFriends
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execSearchFriends_Parms
{
	struct FString                                     SearchNickName;                                   		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.GetVersion
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemGameSpy_execGetVersion_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function OnlineSubsystemGameSpy.OnlineSubsystemGameSpy.ClearQueryAvailableUpdatesDownloadCancel
// [0x00020002] 
struct UOnlineSubsystemGameSpy_execClearQueryAvailableUpdatesDownloadCancel_Parms
{
