/*
#############################################################################################
# Bullet Run (Unknown) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: PlanBGame_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function PlanBGame.AGBakeMapsCommandlet.Main
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UAGBakeMapsCommandlet_eventMain_Parms
{
	struct FString                                     Params;                                           		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAccountLevelCommand.SetPermission
// [0x00022400] ( FUNC_Native )
struct UPBAccountLevelCommand_execSetPermission_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     Command;                                          		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      allowed : 1;                                      		// 0x0010 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PlanBGame.PBAccountLevelCommand.GetInstance
// [0x00022400] ( FUNC_Native )
struct UPBAccountLevelCommand_execGetInstance_Parms
{
	class UPBAccountLevelCommand*                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAccountLevelCommand.hasPermission
// [0x00020002] 
struct UPBAccountLevelCommand_exechasPermission_Parms
{
	struct FString                                     Command;                                          		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                pAccountLevel;                                    		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FName                                    commandWord;                                      		// 0x0014 (0x0008) [0x0000000000000000]              
	// int                                             Index;                                            		// 0x001C (0x0004) [0x0000000000000000]              
	// unsigned long                                   Result : 1;                                       		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function PlanBGame.PBAccountLevelCommand.RefreshAccountLevel
// [0x00820002] 
struct UPBAccountLevelCommand_execRefreshAccountLevel_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FAccountCanCommand                       CC;                                               		// 0x0004 (0x0014) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function PlanBGame.PBAccountLevelCommand.SetAccountLevel
// [0x00820002] 
struct UPBAccountLevelCommand_execSetAccountLevel_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                Level;                                            		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FAccountCanCommand                       CC;                                               		// 0x0008 (0x0014) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function PlanBGame.PBAccountTypeList.GetInstance
// [0x00022002] 
struct UPBAccountTypeList_execGetInstance_Parms
{
	class UPBAccountTypeList*                          ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAccountTypeList.GetStringByAccountTypeCode
// [0x00020902] ( FUNC_Event )
struct UPBAccountTypeList_eventGetStringByAccountTypeCode_Parms
{
	int                                                AccountTypeCode;                                  		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function PlanBGame.PBAchievement.GetClosedID
// [0x00020002] 
struct UPBAchievement_execGetClosedID_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement.RecoverValues
// [0x00020102] 
struct UPBAchievement_execRecoverValues_Parms
{
};

// Function PlanBGame.PBAchievement.StoreValues
// [0x00080102] 
struct UPBAchievement_execStoreValues_Parms
{
};

// Function PlanBGame.PBAchievement.LogAchievement
// [0x00820102] 
struct UPBAchievement_execLogAchievement_Parms
{
	// struct FUIRangeData                             Data;                                             		// 0x0000 (0x0014) [0x0000000000000000]              
};

// Function PlanBGame.PBAchievement.ExportData
// [0x00420103] ( FUNC_Final )
struct UPBAchievement_execExportData_Parms
{
	TArray< unsigned char >                            Data;                                             		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function PlanBGame.PBAchievement._ExportData
// [0x00480100] 
struct UPBAchievement_exec_ExportData_Parms
{
	TArray< unsigned char >                            Data;                                             		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	class UPBAchievement*                              export_from;                                      		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBGame.PBAchievement._ExportBaseData
// [0x00440103] ( FUNC_Final )
struct UPBAchievement_exec_ExportBaseData_Parms
{
	TArray< unsigned char >                            Data;                                             		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	class UPBAchievement*                              export_from;                                      		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// unsigned char                                   nExportedData;                                    		// 0x0010 (0x0001) [0x0000000000000000]              
};

// Function PlanBGame.PBAchievement._ImportBaseData
// [0x00440103] ( FUNC_Final )
struct UPBAchievement_exec_ImportBaseData_Parms
{
	TArray< unsigned char >                            Data;                                             		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// unsigned char                                   nData;                                            		// 0x0010 (0x0001) [0x0000000000000000]              
};

// Function PlanBGame.PBAchievement.IsInitialAchievementChanged
// [0x00020003] ( FUNC_Final )
struct UPBAchievement_execIsInitialAchievementChanged_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement._IsEqual
// [0x00020002] 
struct UPBAchievement_exec_IsEqual_Parms
{
	class UPBAchievement*                              pSource;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UPBAchievement*                              pTarget;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement.GetArchetype
// [0x00020002] 
struct UPBAchievement_execGetArchetype_Parms
{
	class UPBAchievement*                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement._ImportData
// [0x00480102] 
struct UPBAchievement_exec_ImportData_Parms
{
	TArray< unsigned char >                            Data;                                             		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement.ImportData
// [0x00420103] ( FUNC_Final )
struct UPBAchievement_execImportData_Parms
{
	TArray< unsigned char >                            Data;                                             		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function PlanBGame.PBAchievement.OnMatchEnds
// [0x00420002] 
struct UPBAchievement_execOnMatchEnds_Parms
{
	struct FTAchievementEventParams                    Params;                                           		// 0x0000 (0x0020) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement._InternalInitialize
// [0x00080102] 
struct UPBAchievement_exec_InternalInitialize_Parms
{
};

// Function PlanBGame.PBAchievement._InternalOnAchievementComplete
// [0x00080100] 
struct UPBAchievement_exec_InternalOnAchievementComplete_Parms
{
};

// Function PlanBGame.PBAchievement.IsAchievementBeingCompleted
// [0x00020100] 
struct UPBAchievement_execIsAchievementBeingCompleted_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement.AnnouceAchievement
// [0x00020002] 
struct UPBAchievement_execAnnouceAchievement_Parms
{
};

// Function PlanBGame.PBAchievement.IsValuesStored
// [0x00020102] 
struct UPBAchievement_execIsValuesStored_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement.IsHasLockEvents
// [0x00020102] 
struct UPBAchievement_execIsHasLockEvents_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement.IsAnnounced
// [0x00020102] 
struct UPBAchievement_execIsAnnounced_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement.IsBeingUnlocked
// [0x00020102] 
struct UPBAchievement_execIsBeingUnlocked_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement.IsClosed
// [0x00020102] 
struct UPBAchievement_execIsClosed_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement.IsCompleted
// [0x00020102] 
struct UPBAchievement_execIsCompleted_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement.IsLocked
// [0x00020102] 
struct UPBAchievement_execIsLocked_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement.IsHidden
// [0x00020102] 
struct UPBAchievement_execIsHidden_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement.ExportString
// [0x00422003] ( FUNC_Final )
struct UPBAchievement_execExportString_Parms
{
	struct FString                                     sString;                                          		// 0x0000 (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	TArray< unsigned char >                            Data;                                             		// 0x000C (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	// int                                             I;                                                		// 0x0018 (0x0004) [0x0000000000000000]              
	// struct FString                                  sChar;                                            		// 0x001C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function PlanBGame.PBAchievement.ExportByte
// [0x00422003] ( FUNC_Final )
struct UPBAchievement_execExportByte_Parms
{
	unsigned char                                      nByte;                                            		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	TArray< unsigned char >                            Data;                                             		// 0x0004 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function PlanBGame.PBAchievement.ImportByte
// [0x00422003] ( FUNC_Final )
struct UPBAchievement_execImportByte_Parms
{
	TArray< unsigned char >                            Data;                                             		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned char                                      nByte;                                            		// 0x000C (0x0001) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement.ImportInt
// [0x00422003] ( FUNC_Final )
struct UPBAchievement_execImportInt_Parms
{
	TArray< unsigned char >                            Data;                                             		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                nInt;                                             		// 0x000C (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement.ExportInt
// [0x00422003] ( FUNC_Final )
struct UPBAchievement_execExportInt_Parms
{
	int                                                nInt;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	TArray< unsigned char >                            Data;                                             		// 0x0004 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function PlanBGame.PBAchievement.ByteArrayToInt
// [0x00422003] ( FUNC_Final )
struct UPBAchievement_execByteArrayToInt_Parms
{
	TArray< unsigned char >                            byteArray;                                        		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                nInt;                                             		// 0x000C (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             I;                                                		// 0x0014 (0x0004) [0x0000000000000000]              
	// int                                             nTempInt;                                         		// 0x0018 (0x0004) [0x0000000000000000]              
	// struct FString                                  sMessage;                                         		// 0x001C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function PlanBGame.PBAchievement.IntToByteArray
// [0x00422003] ( FUNC_Final )
struct UPBAchievement_execIntToByteArray_Parms
{
	int                                                nInt;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	TArray< unsigned char >                            byteArray;                                        		// 0x0004 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             nCopyInt;                                         		// 0x0014 (0x0004) [0x0000000000000000]              
	// struct FString                                  sMessage;                                         		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             nStartIndex;                                      		// 0x0024 (0x0004) [0x0000000000000000]              
};

// Function PlanBGame.PBAchievement.GetProgressData
// [0x00820002] 
struct UPBAchievement_execGetProgressData_Parms
{
	struct FUIRangeData                                ReturnValue;                                      		// 0x0000 (0x0014) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FUIRangeData                             Data;                                             		// 0x0014 (0x0014) [0x0000000000000000]              
};

// Function PlanBGame.PBAchievement.ShowAchievement
// [0x00020102] 
struct UPBAchievement_execShowAchievement_Parms
{
	unsigned long                                      bShow : 1;                                        		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PlanBGame.PBAchievement.CloseAchievement
// [0x00020102] 
struct UPBAchievement_execCloseAchievement_Parms
{
	int                                                nClosedID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBGame.PBAchievement.LockAchievement
// [0x00020102] 
struct UPBAchievement_execLockAchievement_Parms
{
	unsigned long                                      bLock : 1;                                        		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PlanBGame.PBAchievement.AddPostUnlockRequest
// [0x00080102] 
struct UPBAchievement_execAddPostUnlockRequest_Parms
{
};

// Function PlanBGame.PBAchievement.OnAchievementComplete
// [0x00020102] 
struct UPBAchievement_execOnAchievementComplete_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function PlanBGame.PBAchievement.CompleteAchievement
// [0x00080102] 
struct UPBAchievement_execCompleteAchievement_Parms
{
};

// Function PlanBGame.PBAchievement.ProcessEvent
// [0x010201C2] 
struct UPBAchievement_execProcessEvent_Parms
{
	unsigned char                                      event_type;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	struct FTAchievementEventParams                    Params;                                           		// 0x0004 (0x0020) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             nIndex;                                           		// 0x0028 (0x0004) [0x0000000000000000]              
	// struct FScriptDelegate                          OnEvent;                                          		// 0x002C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function PlanBGame.PBAchievement._FindEvent
// [0x00080102] 
struct UPBAchievement_exec_FindEvent_Parms
{
	unsigned char                                      event_type;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             I;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function PlanBGame.PBAchievement.IsSupportEvent
// [0x00020102] 
struct UPBAchievement_execIsSupportEvent_Parms
{
	unsigned char                                      event_type;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement.AddAchievementToUnlock
// [0x00020102] 
struct UPBAchievement_execAddAchievementToUnlock_Parms
{
	class UPBAchievement*                              unlock_achievement;                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBGame.PBAchievement.GetOwner
// [0x00020102] 
struct UPBAchievement_execGetOwner_Parms
{
	class AController*                                 ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement.Initialize
// [0x00020102] 
struct UPBAchievement_execInitialize_Parms
{
	class APlayerController*                           Owner;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBGame.PBAchievement.GetDescription
// [0x00420002] 
struct UPBAchievement_execGetDescription_Parms
{
	struct FString                                     sDescription;                                     		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	// TArray< struct FString >                        StringTokens;                                     		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function PlanBGame.PBAchievement._IntFillDescription
// [0x00080002] 
struct UPBAchievement_exec_IntFillDescription_Parms
{
	struct FString                                     sDesc;                                            		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     ReturnValue;                                      		// 0x000C (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function PlanBGame.PBAchievement.GetCaption
// [0x00420002] 
struct UPBAchievement_execGetCaption_Parms
{
	struct FString                                     sCaption;                                         		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function PlanBGame.PBAchievement.GetID
// [0x00020002] 
struct UPBAchievement_execGetID_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement.GetAchievementSetID
// [0x00020002] 
struct UPBAchievement_execGetAchievementSetID_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement.GetAchievementSet
// [0x00020002] 
struct UPBAchievement_execGetAchievementSet_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievement.GetCategoryName
// [0x00022002] 
struct UPBAchievement_execGetCategoryName_Parms
{
	int                                                nCategory;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       ReturnValue;                                      		// 0x0004 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FName                                    InvalidName;                                      		// 0x000C (0x0008) [0x0000000000000000]              
	// unsigned char                                   eCategory;                                        		// 0x0014 (0x0001) [0x0000000000000000]              
};

// Function PlanBGame.PBAchievement.IsInCategory
// [0x00020002] 
struct UPBAchievement_execIsInCategory_Parms
{
	int                                                eCategory;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBAchievementList._GetTextureCoordinates
// [0x00480002] 
struct APBAchievementList_exec_GetTextureCoordinates_Parms
{
	class UTexture2D*                                  tIcon;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nCol;                                             		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nRow;                                             		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nWidth;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nHeight;                                          		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FTextureCoordinates                         iconCoords;                                       		// 0x0014 (0x0010) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function PlanBGame.PBAchievementList.GetAchievementIndex
// [0x00020002] 
struct APBAchievementList_execGetAchievementIndex_Parms
{
	int                                                nAchievementID;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             I;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
	// class UPBAchievement*                           pAchievement;                                     		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function PlanBGame.PBAchievementList.GetAchievement
// [0x00020002] 
struct APBAchievementList_execGetAchievement_Parms
{
	int                                                nAchievementID;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UPBAchievement*                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             nIndex;                                           		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function PlanBGame.PBAchievementList.GetUnlockedSound
// [0x00420002] 
struct APBAchievementList_execGetUnlockedSound_Parms
{
	class USoundCue*                                   pSound;                                           		// 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function PlanBGame.PBAchievementList.GetAccomplishedSound
// [0x00420002] 
struct APBAchievementList_execGetAccomplishedSound_Parms
{
	class USoundCue*                                   pSound;                                           		// 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function PlanBGame.PBAchievementList.GetCompletedSound
// [0x00420002] 
struct APBAchievementList_execGetCompletedSound_Parms
{
	class USoundCue*                                   pSound;                                           		// 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function PlanBGame.PBAchievementList.GetAchievementIcon
// [0x00420002] 
struct APBAchievementList_execGetAchievementIcon_Parms
{
	class UPBAchievement*                              pAchievement;                                     		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
	class UTexture2D*                                  tIcon;                                            		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FTextureCoordinates                         iconCoords;                                       		// 0x0008 (0x0010) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function PlanBGame.PBAchievementList.GetCompleteIcon
// [0x00420002] 
struct APBAchievementList_execGetCompleteIcon_Parms
{
	class UTexture2D*                                  tIcon;                                            		// 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FTextureCoordinates                         iconCoords;                                       		// 0x0004 (0x0010) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function PlanBGame.PBAchievementList.GetLockedIcon
// [0x00420002] 
struct APBAchievementList_execGetLockedIcon_Parms
{
	class UTexture2D*                                  tIcon;                                            		// 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FTextureCoordinates                         iconCoords;                                       		// 0x0004 (0x0010) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function PlanBGame.PBAchievementList.GetOngoingIcon
// [0x00420002] 
struct APBAchievementList_execGetOngoingIcon_Parms
{
	class UTexture2D*                                  tIcon;                                            		// 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FTextureCoordinates                         iconCoords;                                       		// 0x0004 (0x0010) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function PlanBGame.PBAchievementList.GetHiddenIcon
// [0x00420002] 
struct APBAchievementList_execGetHiddenIcon_Parms
{
	class UTexture2D*                                  tIcon;                                            		// 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FTextureCoordinates                         iconCoords;                                       		// 0x0004 (0x0010) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function PlanBGame.PBAchievementList.IsValidID
// [0x00020002] 
struct APBAchievementList_execIsValidID_Parms
{
	int                                                nID;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBActorController.GetHUDHealth
// [0x00020102] 
struct APBActorController_execGetHUDHealth_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBActorController.ReplicatedEvent
// [0x00020902] ( FUNC_Event )
struct APBActorController_eventReplicatedEvent_Parms
{
	struct FName                                       VarName;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBGame.PBActorController.TakeDamage
// [0x00024802] ( FUNC_Event )
struct APBActorController_eventTakeDamage_Parms
{
	int                                                Damage;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AController*                                 InstigatedBy;                                     		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Momentum;                                         		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FTraceHitInfo                               HitInfo;                                          		// 0x0024 (0x001C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class AActor*                                      DamageCauser;                                     		// 0x0040 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function PlanBGame.PBActorController.ReceivedPreviousCharacter
// [0x00020102] 
struct APBActorController_execReceivedPreviousCharacter_Parms
{
};

// Function PlanBGame.PBActorController.ReleaseControl
// [0x00020000] 
struct APBActorController_execReleaseControl_Parms
{
};

// Function PlanBGame.PBActorController.KillImmediately
// [0x00020000] 
struct APBActorController_execKillImmediately_Parms
{
};

// Function PlanBGame.PBActorController.IsAlive
// [0x00020102] 
struct APBActorController_execIsAlive_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBActorController.GetSkillIcon
// [0x00020102] 
struct APBActorController_execGetSkillIcon_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function PlanBGame.PBActorController.SetEnergyStatus
// [0x00020102] 
struct APBActorController_execSetEnergyStatus_Parms
{
	unsigned char                                      NewStatus;                                        		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBGame.PBActorController.GetEnergyStatus
// [0x00020102] 
struct APBActorController_execGetEnergyStatus_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBActorController.SetEnergyLeft
// [0x00020102] 
struct APBActorController_execSetEnergyLeft_Parms
{
	float                                              fEnergy;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBGame.PBActorController.GetEnergyLeft
// [0x00020102] 
struct APBActorController_execGetEnergyLeft_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBActorController.BaseChange
// [0x00020822] ( FUNC_Event )
struct APBActorController_eventBaseChange_Parms
{
	// class APawn*                                    basePawn;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	// class APBPawn*                                  PBPawn;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function PlanBGame.PBActorController.CanMove
// [0x00020102] 
struct APBActorController_execCanMove_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBActorController.NotifyJumpPressed
// [0x00020100] 
struct APBActorController_execNotifyJumpPressed_Parms
{
};

// Function PlanBGame.PBActorController.WantsSpecialControl
// [0x00020102] 
struct APBActorController_execWantsSpecialControl_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBActorController.GetAccelFromInput
// [0x00020102] 
struct APBActorController_execGetAccelFromInput_Parms
{
	float                                              aForward;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              aStrafe;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x0008 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBActorController.PostProcessViewRotation
// [0x00420100] 
struct APBActorController_execPostProcessViewRotation_Parms
{
	struct FRotator                                    ViewRotation;                                     		// 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function PlanBGame.PBActorController.Tick
// [0x00020902] ( FUNC_Event )
struct APBActorController_eventTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBGame.PBActorController.ServerStartFire
// [0x002240C0] 
struct APBActorController_execServerStartFire_Parms
{
	unsigned char                                      FireModeNum;                                      		// 0x0000 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function PlanBGame.PBActorController.GetCameraView
// [0x00420102] 
struct APBActorController_execGetCameraView_Parms
{
	float                                              fDeltaTime;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     _location;                                        		// 0x0004 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FRotator                                    _rotation;                                        		// 0x0010 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function PlanBGame.PBPaperPlanePawn.ReplicatedEvent
// [0x00020902] ( FUNC_Event )
struct APBPaperPlanePawn_eventReplicatedEvent_Parms
{
	struct FName                                       VarName;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBGame.PBPaperPlanePawn.UpdateHUDStateChanged
// [0x00020102] 
struct APBPaperPlanePawn_execUpdateHUDStateChanged_Parms
{
	// class APBRoundHUD*                              HUD;                                              		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function PlanBGame.PBPaperPlanePawn.OnEnergyDepletedDuringUse
// [0x00020002] 
struct APBPaperPlanePawn_execOnEnergyDepletedDuringUse_Parms
{
};

// Function PlanBGame.PBPaperPlanePawn.UpdateStateAndReport
// [0x00020102] 
struct APBPaperPlanePawn_execUpdateStateAndReport_Parms
{
	struct FName                                       StateName;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBGame.PBPaperPlanePawn.IsAlive
// [0x00020102] 
struct APBPaperPlanePawn_execIsAlive_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBPaperPlanePawn.KillImmediately
// [0x00020002] 
struct APBPaperPlanePawn_execKillImmediately_Parms
{
};

// Function PlanBGame.PBPaperPlanePawn.AutoMovePlane
// [0x00020102] 
struct APBPaperPlanePawn_execAutoMovePlane_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBGame.PBPaperPlanePawn.DisableAutoAccend
// [0x00020102] 
struct APBPaperPlanePawn_execDisableAutoAccend_Parms
{
};

// Function PlanBGame.PBPaperPlanePawn.ReleaseControl
// [0x00020002] 
struct APBPaperPlanePawn_execReleaseControl_Parms
{
	// class AController*                              OldController;                                    		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function PlanBGame.PBPaperPlanePawn.ReceivedPreviousCharacter
// [0x00020102] 
struct APBPaperPlanePawn_execReceivedPreviousCharacter_Parms
{
};

// Function PlanBGame.PBPaperPlanePawn.GetAccelFromInput
// [0x00820102] 
struct APBPaperPlanePawn_execGetAccelFromInput_Parms
{
	float                                              aForward;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              aStrafe;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x0008 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  VDir;                                             		// 0x0014 (0x000C) [0x0000000000000000]              
};

// Function PlanBGame.PBPaperPlanePawn.GetDecendSpeed
// [0x00020102] 
struct APBPaperPlanePawn_execGetDecendSpeed_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBPaperPlanePawn.ServerStartSpeedBoost
// [0x002200C2] 
struct APBPaperPlanePawn_execServerStartSpeedBoost_Parms
{
};

// Function PlanBGame.PBPaperPlanePawn.StopSpeedBoost
// [0x00020102] 
struct APBPaperPlanePawn_execStopSpeedBoost_Parms
{
};

// Function PlanBGame.PBPaperPlanePawn.StartBoostLoopingSound
// [0x00020102] 
struct APBPaperPlanePawn_execStartBoostLoopingSound_Parms
{
};

// Function PlanBGame.PBPaperPlanePawn.StartSpeedBoost
// [0x00020102] 
struct APBPaperPlanePawn_execStartSpeedBoost_Parms
{
};

// Function PlanBGame.PBPaperPlanePawn.ModifyRadiusDamage
// [0x00020102] 
struct APBPaperPlanePawn_execModifyRadiusDamage_Parms
{
	class AActor*                                      Victim;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HurtOrigin;                                       		// 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              fEffectiveRadius;                                 		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fRadius;                                          		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fBaseDamage;                                      		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x001C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           fAlpha;                                           		// 0x0020 (0x0004) [0x0000000000000000]              
	// float                                           fDistance;                                        		// 0x0024 (0x0004) [0x0000000000000000]              
};

// Function PlanBGame.PBPaperPlanePawn.DoExplodingDamage
// [0x00024002] 
struct APBPaperPlanePawn_execDoExplodingDamage_Parms
{
	float                                              BaseDamage;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              DamageRadiusMax;                                  		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              DamageRadiusEffective;                            		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Momentum;                                         		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HurtOrigin;                                       		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      IgnoredActor;                                     		// 0x0020 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class AController*                                 InstigatedByController;                           		// 0x0024 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bDoFullDamage : 1;                                		// 0x0028 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x002C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           fFinalDamage;                                     		// 0x0030 (0x0004) [0x0000000000000000]              
	// class AActor*                                   Victim;                                           		// 0x0034 (0x0004) [0x0000000000000000]              
	// unsigned long                                   bCausedDamage : 1;                                		// 0x0038 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function PlanBGame.PBPaperPlanePawn.SetPlayerController
// [0x00020002] 
struct APBPaperPlanePawn_execSetPlayerController_Parms
{
	class APBPlayerController*                         PC;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBGame.PBPaperPlanePawn.GetHumanReadableName
// [0x00020102] 
struct APBPaperPlanePawn_execGetHumanReadableName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function PlanBGame.PBPaperPlanePawn.GetTeamNum
// [0x00020102] 
struct APBPaperPlanePawn_execGetTeamNum_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBPaperPlanePawn.Landed
// [0x00020800] ( FUNC_Event )
struct APBPaperPlanePawn_eventLanded_Parms
{
	struct FVector                                     HitNormal;                                        		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      FloorActor;                                       		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBGame.PBPaperPlanePawn.IsEnemyInExplosionRange
// [0x00820002] 
struct APBPaperPlanePawn_execIsEnemyInExplosionRange_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// TArray< class AActor* >                         rAllAttackableActors;                             		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// class AActor*                                   pCurActor;                                        		// 0x0010 (0x0004) [0x0000000000000000]              
	// class APBCharacter*                             pChar;                                            		// 0x0014 (0x0004) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x0018 (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitNormal;                                        		// 0x0024 (0x000C) [0x0000000000000000]              
	// class AActor*                                   HitActor;                                         		// 0x0030 (0x0004) [0x0000000000000000]              
	// struct FVector                                  vActorLocation;                                   		// 0x0034 (0x000C) [0x0000000000000000]              
};

// Function PlanBGame.PBPaperPlanePawn.Tick
// [0x00820902] ( FUNC_Event )
struct APBPaperPlanePawn_eventTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FRotator                                 rRot;                                             		// 0x0004 (0x000C) [0x0000000000000000]              
	// struct FVector                                  TraceEnd;                                         		// 0x0010 (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x001C (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitNormal;                                        		// 0x0028 (0x000C) [0x0000000000000000]              
	// class AActor*                                   HitActor;                                         		// 0x0034 (0x0004) [0x0000000000000000]              
};

// Function PlanBGame.PBPaperPlanePawn.CanMove
// [0x00020102] 
struct APBPaperPlanePawn_execCanMove_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBGame.PBPaperPlanePawn.TakeDamage
// [0x00024802] ( FUNC_Event )
struct APBPaperPlanePawn_eventTakeDamage_Parms
{
	int                                                DamageAmount;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AController*                                 EventInstigator;                                  		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Momentum;                                         		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FTraceHitInfo                               HitInfo;                                          		// 0x0024 (0x001C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class AActor*                                      DamageCauser;                                     		// 0x0040 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function PlanBGame.PBPaperPlanePawn.GetCameraView
// [0x00C20102] 
struct APBPaperPlanePawn_execGetCameraView_Parms
{
	float                                              fDeltaTime;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     OutLocation;                                      		// 0x0004 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FRotator                                    OutRotation;                                      		// 0x0010 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	// class AActor*                                   ActorHit;                                         		// 0x001C (0x0004) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x0020 (0x000C) [0x0000000000000000]              
	// struct FVector                                  EndTrace;                                         		// 0x002C (0x000C) [0x0000000000000000]              
