/*
#############################################################################################
# Bullet Run (Unknown) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: PlanBGame_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_ACHIEVEMENT_SEPARATOR                              2880154539
#define CONST_MAX_MOD_TYPE_COUNT                                 7
#define CONST_MAX_PARTS                                          13
#define CONST_MAX_TEX_SCHEMES                                    5
#define CONST_MAX_ATTACHMENTS                                    4
#define CONST_MAX_COLOR_SCHEMES                                  2
#define CONST_MAX_MODS                                           7
#define CONST_INVALID_BASE_WEAPON                                255

	NETWORKTYPE_Cable                                  = 3,
	NETWORKTYPE_LAN                                    = 4,
	NETWORKTYPE_MAX                                    = 5
};*/

// Enum PlanBGame.PBProfileSettings.PBPlayStyle
/*enum PBPlayStyle
{
	PBPS_Fun                                           = 0,
	PBPS_Competitive                                   = 1,
	PBPS_Chaos                                         = 2,
	PBPS_MAX                                           = 3
};*/

// Enum PlanBGame.PBSkill_HeadCrabActor.CrabAnim
/*enum CrabAnim
{
	CA_Idle                                            = 0,
	CA_Walk                                            = 1,
	CA_Jump                                            = 2,
	CA_Grab                                            = 3,
	CA_MAX                                             = 4
};*/

// Enum PlanBGame.PBSwearFilter.ESwearMaskMode
/*enum ESwearMaskMode
{
	ESMM_Astrix                                        = 0,
	ESMM_Hash                                          = 1,
	ESMM_Random                                        = 2,
	ESMM_Erase                                         = 3,
	ESMM_User                                          = 4,
	ESMM_MAX                                           = 5
};*/

// Enum PlanBGame.PlanBTypes.ESpecialZoneEnum
/*enum ESpecialZoneEnum
{
	ESZONE_NOT_SPECIAL                                 = 0,
	ESZONE_VIP                                         = 1,
	ESZONE_HELICOPTER_SUPPORT                          = 2,
	ESZONE_SUBWAY                                      = 3,
	ESZONE_EXTRALIFE                                   = 4,
	ESZONE_MAX                                         = 5
};*/

// Enum PlanBGame.PlanBTypes.EDirection
/*enum EDirection
{
	E_IGNORE                                           = 0,
	E_NORTH                                            = 1,
	E_SOUTH                                            = 2,
	E_WEST                                             = 3,
	E_EAST                                             = 4,
	E_MAX                                              = 5
};*/

// Enum PlanBGame.PBVoiceOverList.PBVoiceOverType
/*enum PBVoiceOverType
{
	PBVoiceOver_Ignore                                 = 0,
	PBVoiceOver_EnemyDown                              = 1,
	PBVoiceOver_Reloading                              = 2,
	PBVoiceOver_OutOfAmmo                              = 3,
	PBVoiceOver_ThrowingFrag                           = 4,
	PBVoiceOver_ThrowingSmoke                          = 5,
	PBVoiceOver_ThrowingFlash                          = 6,
	PBVoiceOver_CallingMortar                          = 7,
	PBVoiceOver_MAX                                    = 8
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class PlanBGame.AGBakeMapsCommandlet
// 0x0000 (0x007C - 0x007C)
class UAGBakeMapsCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1359 ];

		return pClassPointer;
	};

	int eventMain ( struct FString Params );
};

UClass* UAGBakeMapsCommandlet::pClassPointer = NULL;

// Class PlanBGame.PBAccountLevelCommand
// 0x0014 (0x0050 - 0x003C)
class UPBAccountLevelCommand : public UObject
{
public:
	class UPBAccountLevelCommand*                      pPB_ALC_Instance;                                 		// 0x003C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FAccountCanCommand >                permissionList;                                   		// 0x0040 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	int                                                accountLevel;                                     		// 0x004C (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1360 ];

		return pClassPointer;
	};

	void SetPermission ( class APlayerController* PC, struct FString Command, unsigned long allowed );
	class UPBAccountLevelCommand* GetInstance ( );
	bool hasPermission ( struct FString Command, int pAccountLevel );
	void RefreshAccountLevel ( class APlayerController* PC );
	void SetAccountLevel ( class APlayerController* PC, int Level );
};

UClass* UPBAccountLevelCommand::pClassPointer = NULL;

// Class PlanBGame.PBAccountTypeList
// 0x0010 (0x004C - 0x003C)
class UPBAccountTypeList : public UObject
{
public:
	class UPBAccountTypeList*                          pAccountTypeListArchetype;                        		// 0x003C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FPBAccountTypeContainer >           AccountTypeList;                                  		// 0x0040 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1361 ];

		return pClassPointer;
	};

	class UPBAccountTypeList* GetInstance ( );
	struct FString eventGetStringByAccountTypeCode ( int AccountTypeCode );
};

UClass* UPBAccountTypeList::pClassPointer = NULL;

// Class PlanBGame.PBAchievement
// 0x0070 (0x00AC - 0x003C)
class UPBAchievement : public UObject
{
public:
	class APlayerController*                           m_Owner;                                          		// 0x003C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                m_nID;                                            		// 0x0040 (0x0004) [0x0000000000020001]              ( CPF_Edit | CPF_EditConst )
	TArray< struct FTAchievementSupportedEvent >       m_Events;                                         		// 0x0044 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	unsigned long                                      m_bHidden : 1;                                    		// 0x0050 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_bLocked : 1;                                    		// 0x0050 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      m_bCompleted : 1;                                 		// 0x0050 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      m_bValuesStored : 1;                              		// 0x0050 (0x0004) [0x0000000000002000] [0x00000008] ( CPF_Transient )
	unsigned long                                      m_bAnnounced : 1;                                 		// 0x0050 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      m_bClosed : 1;                                    		// 0x0050 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      m_bHasLockEvents : 1;                             		// 0x0050 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      m_bBeingUnlocked : 1;                             		// 0x0050 (0x0004) [0x0000000000002000] [0x00000080] ( CPF_Transient )
	int                                                m_nClosedID;                                      		// 0x0054 (0x0004) [0x0000000000000000]              
	TArray< struct FName >                             m_sUnlockAchievementNames;                        		// 0x0058 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< class UPBAchievement* >                    m_UnlockAchievementsArray;                        		// 0x0064 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	class UPBAchievement*                              m_InitialAchievement;                             		// 0x0070 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FString                                     m_sAchievementCaption;                            		// 0x0074 (0x000C) [0x0000000000408003]              ( CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_sAchievementDescription;                        		// 0x0080 (0x000C) [0x0000000000408003]              ( CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	int                                                m_nIconColumn;                                    		// 0x008C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nIconRow;                                       		// 0x0090 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       m_AchievementSet;                                 		// 0x0094 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nSetID;                                         		// 0x009C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< unsigned char >                            m_Categories;                                     		// 0x00A0 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1362 ];

		return pClassPointer;
	};

	int GetClosedID ( );
	void RecoverValues ( );
	void StoreValues ( );
	void LogAchievement ( );
	void ExportData ( TArray< unsigned char >* Data );
	void _ExportData ( class UPBAchievement* export_from, TArray< unsigned char >* Data );
	void _ExportBaseData ( class UPBAchievement* export_from, TArray< unsigned char >* Data );
	bool _ImportBaseData ( TArray< unsigned char >* Data );
	bool IsInitialAchievementChanged ( );
	bool _IsEqual ( class UPBAchievement* pSource, class UPBAchievement* pTarget );
	class UPBAchievement* GetArchetype ( );
	bool _ImportData ( TArray< unsigned char >* Data );
	bool ImportData ( TArray< unsigned char >* Data );
	bool OnMatchEnds ( struct FTAchievementEventParams* Params );
	void _InternalInitialize ( );
	void _InternalOnAchievementComplete ( );
	bool IsAchievementBeingCompleted ( );
	void AnnouceAchievement ( );
	bool IsValuesStored ( );
	bool IsHasLockEvents ( );
	bool IsAnnounced ( );
	bool IsBeingUnlocked ( );
	bool IsClosed ( );
	bool IsCompleted ( );
	bool IsLocked ( );
	bool IsHidden ( );
	void ExportString ( struct FString* sString, TArray< unsigned char >* Data );
	void ExportByte ( unsigned char nByte, TArray< unsigned char >* Data );
	bool ImportByte ( TArray< unsigned char >* Data, unsigned char* nByte );
	bool ImportInt ( TArray< unsigned char >* Data, int* nInt );
	void ExportInt ( int nInt, TArray< unsigned char >* Data );
	bool ByteArrayToInt ( TArray< unsigned char >* byteArray, int* nInt );
	void IntToByteArray ( int nInt, TArray< unsigned char >* byteArray );
	struct FUIRangeData GetProgressData ( );
	void ShowAchievement ( unsigned long bShow );
	void CloseAchievement ( int nClosedID );
	void LockAchievement ( unsigned long bLock );
	void AddPostUnlockRequest ( );
	void OnAchievementComplete ( );
	void CompleteAchievement ( );
	bool Processvent ( unsigned char event_type, struct FTAchievementEventParams Params );
	int _FindEvent ( unsigned char event_type );
	bool IsSupportEvent ( unsigned char event_type );
	void AddAchievementToUnlock ( class UPBAchievement* unlock_achievement );
	class AController* GetOwner ( );
	void Initialize ( class APlayerController* Owner );
	void GetDescription ( struct FString* sDescription );
	struct FString _IntFillDescription ( struct FString sDesc );
	void GetCaption ( struct FString* sCaption );
	int GetID ( );
	int GetAchievementSetID ( );
	struct FName GetAchievementSet ( );
	struct FName GetCategoryName ( int nCategory );
	bool IsInCategory ( int eCategory );
};

UClass* UPBAchievement::pClassPointer = NULL;

// Class PlanBGame.PBAchievementList
// 0x0070 (0x0248 - 0x01D8)
class APBAchievementList : public AActor
{
public:
	TArray< class UPBAchievement* >                    m_Achievements;                                   		// 0x01D8 (0x000C) [0x0000000014402001]              ( CPF_Edit | CPF_Transient | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineUse )
	int                                                m_nMaxID;                                         		// 0x01E4 (0x0004) [0x0000000000020001]              ( CPF_Edit | CPF_EditConst )
	TArray< unsigned char >                            m_DisplayedCategories;                            		// 0x01E8 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UTexture2D*                                  m_AchievementsIcons;                              		// 0x01F4 (0x0004) [0x0000000000002001]              ( CPF_Edit | CPF_Transient )
	float                                              m_nIconWidth;                                     		// 0x01F8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_nIconHeight;                                    		// 0x01FC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nOngoingCol;                                    		// 0x0200 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nOngoingRow;                                    		// 0x0204 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nLockedCol;                                     		// 0x0208 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nLockedRow;                                     		// 0x020C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nHiddenCol;                                     		// 0x0210 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nHiddenRow;                                     		// 0x0214 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nCompleteCol;                                   		// 0x0218 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nCompleteRow;                                   		// 0x021C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     m_SecretAchievementCaption;                       		// 0x0220 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     m_SecretAchievementDescription;                   		// 0x022C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class USoundCue*                                   m_CompleteSoundCue;                               		// 0x0238 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   m_AccomplishedSoundCue;                           		// 0x023C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   m_UnlockedSoundCue;                               		// 0x0240 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class APBAchievementList*                          Archetype;                                        		// 0x0244 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1363 ];

		return pClassPointer;
	};

	void _GetTextureCoordinates ( class UTexture2D* tIcon, int nCol, int nRow, int nWidth, int nHeight, struct FTextureCoordinates* iconCoords );
	int GetAchievementIndex ( int nAchievementID );
	class UPBAchievement* GetAchievement ( int nAchievementID );
	void GetUnlockedSound ( class USoundCue** pSound );
	void GetAccomplishedSound ( class USoundCue** pSound );
	void GetCompletedSound ( class USoundCue** pSound );
	void GetAchievementIcon ( class UPBAchievement* pAchievement, class UTexture2D** tIcon, struct FTextureCoordinates* iconCoords );
	void GetCompleteIcon ( class UTexture2D** tIcon, struct FTextureCoordinates* iconCoords );
	void GetLockedIcon ( class UTexture2D** tIcon, struct FTextureCoordinates* iconCoords );
	void GetOngoingIcon ( class UTexture2D** tIcon, struct FTextureCoordinates* iconCoords );
	void GetHiddenIcon ( class UTexture2D** tIcon, struct FTextureCoordinates* iconCoords );
	bool IsValidID ( int nID );
};

UClass* APBAchievementList::pClassPointer = NULL;

// Class PlanBGame.PBActorController
// 0x003C (0x04E0 - 0x04A4)
class APBActorController : public APawn
{
public:
	int                                                MovingTicks;                                      		// 0x04A4 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              MovingTicksMinMove;                               		// 0x04A8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                MovingTicksToMoveAnim;                            		// 0x04AC (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned char                                      MovementMode;                                     		// 0x04B0 (0x0001) [0x0000000000002020]              ( CPF_Net | CPF_Transient )
	unsigned char                                      sEnergyStatus;                                    		// 0x04B1 (0x0001) [0x0000000000002000]              ( CPF_Transient )
	class APBCharacter*                                PreviousCharacter;                                		// 0x04B4 (0x0004) [0x0000000000002020]              ( CPF_Net | CPF_Transient )
	struct FVector                                     PawnAcceleration;                                 		// 0x04B8 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FString                                     SkillIconName;                                    		// 0x04C4 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	float                                              fEnergyRemaining;                                 		// 0x04D0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FString                                     CustomActionName;                                 		// 0x04D4 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1364 ];

		return pClassPointer;
	};

	float GetHUDHealth ( );
	void eventReplicatedEvent ( struct FName VarName );
	void eventTakeDamage ( int Damage, class AController* InstigatedBy, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
	void ReceivedPreviousCharacter ( );
	void ReleaseControl ( );
	void KillImmediately ( );
	bool IsAlive ( );
	struct FString GetSkillIcon ( );
	void SetEnergyStatus ( unsigned char NewStatus );
	unsigned char GetEnergyStatus ( );
	void SetEnergyLeft ( float fEnergy );
	float GetEnergyLeft ( );
	void eventBaseChange ( );
	bool CanMove ( );
	void NotifyJumpPressed ( );
	bool WantsSpecialControl ( );
	struct FVector GetAccelFromInput ( float aForward, float aStrafe );
	void PostProcessViewRotation ( struct FRotator* ViewRotation );
	void eventTick ( float DeltaTime );
	void ServerStartFire ( unsigned char FireModeNum );
	void GetCameraView ( float fDeltaTime, struct FVector* _location, struct FRotator* _rotation );
};

UClass* APBActorController::pClassPointer = NULL;

// Class PlanBGame.PBPaperPlanePawn
// 0x0138 (0x0618 - 0x04E0)
class APBPaperPlanePawn : public APBActorController
{
public:
	float                                              fHeatUpPercent;                                   		// 0x04E0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bAutoAccending : 1;                               		// 0x04E4 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      bCanSpeedBoost : 1;                               		// 0x04E4 (0x0004) [0x0000000000002020] [0x00000002] ( CPF_Net | CPF_Transient )
	unsigned long                                      bSpeedBoostUsed : 1;                              		// 0x04E4 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	unsigned long                                      bSpeedBoostActive : 1;                            		// 0x04E4 (0x0004) [0x0000000000002020] [0x00000008] ( CPF_Net | CPF_Transient )
	unsigned long                                      bShieldsUp : 1;                                   		// 0x04E4 (0x0004) [0x0000000000002020] [0x00000010] ( CPF_Net | CPF_Transient )
	unsigned long                                      bShouldDecend : 1;                                		// 0x04E4 (0x0004) [0x0000000000002000] [0x00000020] ( CPF_Transient )
	unsigned long                                      bShouldAccend : 1;                                		// 0x04E4 (0x0004) [0x0000000000002000] [0x00000040] ( CPF_Transient )
	unsigned long                                      bAligningToCamera : 1;                            		// 0x04E4 (0x0004) [0x0000000000002000] [0x00000080] ( CPF_Transient )
	unsigned long                                      bAligningToCameraLocation : 1;                    		// 0x04E4 (0x0004) [0x0000000000002000] [0x00000100] ( CPF_Transient )
	unsigned long                                      bFirstCameraView : 1;                             		// 0x04E4 (0x0004) [0x0000000000002000] [0x00000200] ( CPF_Transient )
	unsigned long                                      bDontAutoExplode : 1;                             		// 0x04E4 (0x0004) [0x0000000000002020] [0x00000400] ( CPF_Net | CPF_Transient )
	unsigned long                                      bSwitchToPDAPending : 1;                          		// 0x04E4 (0x0004) [0x0000000000002000] [0x00000800] ( CPF_Transient )
	unsigned long                                      PlayingSmoke : 1;                                 		// 0x04E4 (0x0004) [0x0000000000002020] [0x00001000] ( CPF_Net | CPF_Transient )
	unsigned long                                      PlayingFire : 1;                                  		// 0x04E4 (0x0004) [0x0000000000002020] [0x00002000] ( CPF_Net | CPF_Transient )
	unsigned long                                      PlayingSparks : 1;                                		// 0x04E4 (0x0004) [0x0000000000002020] [0x00004000] ( CPF_Net | CPF_Transient )
	struct FName                                       CurrentState;                                     		// 0x04E8 (0x0008) [0x0000000000002020]              ( CPF_Net | CPF_Transient )
	int                                                TargetTeam;                                       		// 0x04F0 (0x0004) [0x0000000000002020]              ( CPF_Net | CPF_Transient )
	float                                              fAccumulatedHeat;                                 		// 0x04F4 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                OldYaw;                                           		// 0x04F8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                CurrentYaw;                                       		// 0x04FC (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                MovingUp;                                         		// 0x0500 (0x0004) [0x0000000000002020]              ( CPF_Net | CPF_Transient )
	struct FVector                                     CameraStartLocation;                              		// 0x0504 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FRotator                                    CameraStartRotation;                              		// 0x0510 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	float                                              AlignTimeLeft;                                    		// 0x051C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              AlignTimeMax;                                     		// 0x0520 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	unsigned char                                      ownerTeam;                                        		// 0x0524 (0x0001) [0x0000000000002000]              ( CPF_Transient )
	float                                              EnvironmentalDamageTaken;                         		// 0x0528 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                EnvironmentalDamagePerSecond;                     		// 0x052C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                MinimumDamageForSmoke;                            		// 0x0530 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                MinimumDamageForFire;                             		// 0x0534 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                MinimumEnvironmentalDamageForExplode;             		// 0x0538 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                FloorDistanceFromPlaneForDamage;                  		// 0x053C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     BaseTrailEffectVelocity;                          		// 0x0540 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     BoostTrailEffectVelocity;                         		// 0x054C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	class USkeletalMeshComponent*                      pShieldMeshComp;                                  		// 0x0558 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class USkeletalMeshComponent*                      pSkelMesh;                                        		// 0x055C (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UAudioComponent*                             pFlyingLoopAC;                                    		// 0x0560 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UParticleSystemComponent*                    pSparksComponent;                                 		// 0x0564 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UParticleSystemComponent*                    pSmokeComponent;                                  		// 0x0568 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UParticleSystemComponent*                    pFireComponent;                                   		// 0x056C (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UParticleSystemComponent*                    TrailEffectComponentLeft;                         		// 0x0570 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UParticleSystemComponent*                    TrailEffectComponentRight;                        		// 0x0574 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UAudioComponent*                             BoostStartSoundComponent;                         		// 0x0578 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UAudioComponent*                             BoostSoundComponent;                              		// 0x057C (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UAudioComponent*                             OverheatSoundComponent;                           		// 0x0580 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UAudioComponent*                             GrindingSoundComponent;                           		// 0x0584 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UAudioComponent*                             FireSoundComponent;                               		// 0x0588 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	float                                              BoostStartFadeinDuration;                         		// 0x058C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BoostEndFadeoutDuration;                          		// 0x0590 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              OverheatFadeInDuration;                           		// 0x0594 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              OverheatFadeOutDuration;                          		// 0x0598 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BostLoopingSoundDelay;                            		// 0x059C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UParticleSystem*                             BreakingPS;                                       		// 0x05A0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UDynamicLightEnvironmentComponent*           pLightEnv;                                        		// 0x05A4 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UMaterialInterface*                          pFriendlyMaterialInstance;                        		// 0x05A8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UMaterialInterface*                          pEnemyMaterialInstance;                           		// 0x05AC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UMaterialInterface*                          pFriendlyShieldMaterialInstance;                  		// 0x05B0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UMaterialInterface*                          pEnemyShieldMaterialInstance;                     		// 0x05B4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fCameraHeightFromLocation;                        		// 0x05B8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fCameraDistanceFromLocation;                      		// 0x05BC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              HitLife;                                          		// 0x05C0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fHeatPerSecondWhileBoosting;                      		// 0x05C4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fMaxBoostingHeat;                                 		// 0x05C8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fBoostingHeatDecay;                               		// 0x05CC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                AirSpeedBoost;                                    		// 0x05D0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTimeUntilDestroyAfterDeath;                      		// 0x05D4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTimeUntilReleaseControlAfterDeath;               		// 0x05D8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTimeUntilAutoAccendEnd;                          		// 0x05DC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTimeBoostLasts;                                  		// 0x05E0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              AttackDistance;                                   		// 0x05E4 (0x0004) [0x0000000000000021]              ( CPF_Edit | CPF_Net )
	float                                              ExplodingDamage;                                  		// 0x05E8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              ExplodingRadiusMax;                               		// 0x05EC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              ExplodingRadiusEffective;                         		// 0x05F0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fAccendZ;                                         		// 0x05F4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fDecayZ;                                          		// 0x05F8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fDecayZInAutoMode;                                		// 0x05FC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fManualAccend;                                    		// 0x0600 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fManualDecend;                                    		// 0x0604 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fMinPitchAngle;                                   		// 0x0608 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fMaxPitchAngle;                                   		// 0x060C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   NormalFlyingLoopingSound;                         		// 0x0610 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   BlowupOneShotSound;                               		// 0x0614 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1365 ];

		return pClassPointer;
	};

	void eventReplicatedEvent ( struct FName VarName );
	void UpdateHUDStateChanged ( );
	void OnEnergyDepletedDuringUse ( );
	void UpdateStateAndReport ( struct FName StateName );
	bool IsAlive ( );
	void KillImmediately ( );
	void AutoMovePlane ( float DeltaTime );
	void DisableAutoAccend ( );
	void ReleaseControl ( );
	void ReceivedPreviousCharacter ( );
	struct FVector GetAccelFromInput ( float aForward, float aStrafe );
	float GetDecendSpeed ( );
	void ServerStartSpeedBoost ( );
	void StopSpeedBoost ( );
	void StartBoostLoopingSound ( );
	void StartSpeedBoost ( );
	float ModifyRadiusDamage ( class AActor* Victim, struct FVector HurtOrigin, float fEffectiveRadius, float fRadius, float fBaseDamage );
	bool DoExplodingDamage ( float BaseDamage, float DamageRadiusMax, float DamageRadiusEffective, class UClass* DamageType, float Momentum, struct FVector HurtOrigin, class AActor* IgnoredActor, class AController* InstigatedByController, unsigned long bDoFullDamage );
	void SetPlayerController ( class APBPlayerController* PC );
	struct FString GetHumanReadableName ( );
	unsigned char GetTeamNum ( );
	void eventLanded ( struct FVector HitNormal, class AActor* FloorActor );
	bool IsEnemyInExplosionRange ( );
	void eventTick ( float DeltaTime );
	bool CanMove ( );
	void eventTakeDamage ( int DamageAmount, class AController* EventInstigator, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
	void GetCameraView ( float fDeltaTime, struct FVector* OutLocation, struct FRotator* OutRotation );
	void SetOriginalCameraOrientation ( struct FVector origLocation, struct FRotator origRotation );
	void SetEnemyMaterialColor ( );
	void SetFriendlyMaterialColor ( );
	void SetupTeamMarker ( );
	void NotifyLocalPlayerTeamReceived ( );
	void ServerStartFire ( unsigned char FireModeNum );
	class APBPlayerController* GetOwnerController ( );
	void GotoControlMode ( );
	void GotoAutoMode ( );
	void SetControlMode ( unsigned long bControlMode, class APBPlayerController* PC );
	void SetupPlane ( class APBSkill_PPlane* pResponsibleSkill, class APBPlayerController* PC, unsigned long bControlMode );
	void SetShields ( unsigned long bShields );
	void eventDestroyed ( );
	void eventPostBeginPlay ( );
};

UClass* APBPaperPlanePawn::pClassPointer = NULL;

// Class PlanBGame.PBActorFactoryAI
// 0x0008 (0x008C - 0x0084)
class UPBActorFactoryAI : public UActorFactoryAI
{
public:
	class APBCharacter*                                PawnArchetype;                                    		// 0x0084 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                Health;                                           		// 0x0088 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1366 ];

		return pClassPointer;
	};

};

UClass* UPBActorFactoryAI::pClassPointer = NULL;

// Class PlanBGame.PBAnalyzeCookedContentCommandlet
// 0x0018 (0x0094 - 0x007C)
class UPBAnalyzeCookedContentCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x18 ];                            		// 0x007C (0x0018) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1367 ];

		return pClassPointer;
	};

};

UClass* UPBAnalyzeCookedContentCommandlet::pClassPointer = NULL;

// Class PlanBGame.PBAnalyzeCookedPackagesCommandlet
// 0x0000 (0x007C - 0x007C)
class UPBAnalyzeCookedPackagesCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1368 ];

		return pClassPointer;
	};

};

UClass* UPBAnalyzeCookedPackagesCommandlet::pClassPointer = NULL;

// Class PlanBGame.PBAnim_AimOffset
// 0x001C (0x0158 - 0x013C)
class UPBAnim_AimOffset : public UAnimNodeAimOffset
{
public:
	class APBPawn*                                     WarPawnOwner;                                     		// 0x013C (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	float                                              TurnInPlaceOffset;                                		// 0x0140 (0x0004) [0x0000000000002003]              ( CPF_Edit | CPF_Const | CPF_Transient )
	float                                              LastAimX;                                         		// 0x0144 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	unsigned long                                      bInterpolating : 1;                               		// 0x0148 (0x0004) [0x0000000000002002] [0x00000001] ( CPF_Const | CPF_Transient )
	float                                              InterpSpeed;                                      		// 0x014C (0x0004) [0x0000000000000000]              
	struct FName                                       CurProfileName;                                   		// 0x0150 (0x0008) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1369 ];

		return pClassPointer;
	};

};

UClass* UPBAnim_AimOffset::pClassPointer = NULL;

// Class PlanBGame.PBAnim_BlendAnimsByAim
// 0x0004 (0x01C0 - 0x01BC)
class UPBAnim_BlendAnimsByAim : public UAnimNodeSequenceBlendByAim
{
public:
	class APBPawn*                                     WarPawnOwner;                                     		// 0x01BC (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1370 ];

		return pClassPointer;
	};

};

UClass* UPBAnim_BlendAnimsByAim::pClassPointer = NULL;

// Class PlanBGame.PBAnim_BlendByDirection
// 0x0010 (0x015C - 0x014C)
class UPBAnim_BlendByDirection : public UAnimNodeSequenceBlendBase
{
public:
	float                                              BlendSpeed;                                       		// 0x014C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              DirAngle;                                         		// 0x0150 (0x0004) [0x0000000000000000]              
	float                                              LastRelevantTime;                                 		// 0x0154 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bInterpolateWeights : 1;                          		// 0x0158 (0x0004) [0x0000000000002002] [0x00000001] ( CPF_Const | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1371 ];

		return pClassPointer;
	};

};

UClass* UPBAnim_BlendByDirection::pClassPointer = NULL;

// Class PlanBGame.PBAnim_DirectionalMove2Idle
// 0x000C (0x0168 - 0x015C)
class UPBAnim_DirectionalMove2Idle : public UPBAnim_BlendByDirection
{
public:
	TArray< struct FDTransInfo >                       DTransList;                                       		// 0x015C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1372 ];

		return pClassPointer;
	};

};

UClass* UPBAnim_DirectionalMove2Idle::pClassPointer = NULL;

// Class PlanBGame.PBAnim_BlendList
// 0x000C (0x0120 - 0x0114)
class UPBAnim_BlendList : public UAnimNodeBlendList
{
public:
	TArray< float >                                    ChildBlendInTime;                                 		// 0x0114 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1373 ];

		return pClassPointer;
	};

};

UClass* UPBAnim_BlendList::pClassPointer = NULL;

// Class PlanBGame.PBAnim_BlendByFire
// 0x0004 (0x0124 - 0x0120)
class UPBAnim_BlendByFire : public UPBAnim_BlendList
{
public:
	class APBPawn*                                     PBPawnOwner;                                      		// 0x0120 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1374 ];

		return pClassPointer;
	};

};

UClass* UPBAnim_BlendByFire::pClassPointer = NULL;

// Class PlanBGame.PBAnim_BlendByTargeting
// 0x000C (0x012C - 0x0120)
class UPBAnim_BlendByTargeting : public UPBAnim_BlendList
{
public:
	class APBPawn*                                     PBPawnOwner;                                      		// 0x0120 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	unsigned long                                      bMergeAimFiringIntoIdle : 1;                      		// 0x0124 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bMergeAimIdleIntoIdleReady : 1;                   		// 0x0124 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bMergeDownSightsIntoAim : 1;                      		// 0x0124 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bMergeDownSightsFireIntoIdle : 1;                 		// 0x0124 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	float                                              Aim2IdleBlendOutTime;                             		// 0x0128 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1375 ];

		return pClassPointer;
	};

};

UClass* UPBAnim_BlendByTargeting::pClassPointer = NULL;

// Class PlanBGame.PBAnim_BlendListByConsoleCommand
// 0x0000 (0x0120 - 0x0120)
class UPBAnim_BlendListByConsoleCommand : public UPBAnim_BlendList
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1376 ];

		return pClassPointer;
	};

};

UClass* UPBAnim_BlendListByConsoleCommand::pClassPointer = NULL;

// Class PlanBGame.PBAnimBlendByHolster
// 0x0000 (0x0120 - 0x0120)
class UPBAnimBlendByHolster : public UPBAnim_BlendList
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1377 ];

		return pClassPointer;
	};

};

UClass* UPBAnimBlendByHolster::pClassPointer = NULL;

// Class PlanBGame.PBAnimBlendByLadderPosition
// 0x0004 (0x0124 - 0x0120)
class UPBAnimBlendByLadderPosition : public UPBAnim_BlendList
{
public:
	class APBPawn*                                     PBPawnOwner;                                      		// 0x0120 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1378 ];

		return pClassPointer;
	};

};

UClass* UPBAnimBlendByLadderPosition::pClassPointer = NULL;

// Class PlanBGame.PBAnimBlendByVelocityZ
// 0x000C (0x012C - 0x0120)
class UPBAnimBlendByVelocityZ : public UPBAnim_BlendList
{
public:
	class APBPawn*                                     PBPawnOwner;                                      		// 0x0120 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	float                                              VelocityIdleThreshold;                            		// 0x0124 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Move2IdleBlendOutTime;                            		// 0x0128 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1379 ];

		return pClassPointer;
	};

};

UClass* UPBAnimBlendByVelocityZ::pClassPointer = NULL;

// Class PlanBGame.PBAnimNodeSlot
// 0x0010 (0x0130 - 0x0120)
class UPBAnimNodeSlot : public UPBAnim_BlendList
{
public:
	float                                              BlendTime;                                        		// 0x0120 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       DefaultChannel;                                   		// 0x0124 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bFilterAnimEndEvents : 1;                         		// 0x012C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bPlaySourceIfSlotNotFound : 1;                    		// 0x012C (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bDoNotRestartSequences : 1;                       		// 0x012C (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bActiveChannelLooping : 1;                        		// 0x012C (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bActivePauseAtEnd : 1;                            		// 0x012C (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bIsPlayingChannel : 1;                            		// 0x012C (0x0004) [0x0000000000002002] [0x00000020] ( CPF_Const | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1380 ];

		return pClassPointer;
	};

	void StopChannel ( );
	float PlayChannel ( struct FName Sequence, float AnimRate, unsigned long bLooping, unsigned long bPauseAtEnd );
};

UClass* UPBAnimNodeSlot::pClassPointer = NULL;

// Class PlanBGame.PBAnim_BlendPerBone
// 0x003B (0x012C - 0x00F1)
class UPBAnim_BlendPerBone : public UAnimNodeBlendBase
{
public:
	class APBPawn*                                     WarPawnOwner;                                     		// 0x00F4 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	TArray< struct FPBPerBoneMaskInfo >                MaskList;                                         		// 0x00F8 (0x000C) [0x0000000004400041]              ( CPF_Edit | CPF_EditConstArray | CPF_NeedCtorLink | CPF_EditInline )
	unsigned char                                      RotationBlendType;                                		// 0x0104 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FBoneAtom >                         SourceAtoms;                                      		// 0x0108 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< struct FMatrix >                           SourceMeshSpaceTM;                                		// 0x0114 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< struct FMatrix >                           ResultMeshSpaceTM;                                		// 0x0120 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1381 ];

		return pClassPointer;
	};

	void SetMaskWeight ( int MaskIndex, float DesiredWeight, float BlendTime );
};

UClass* UPBAnim_BlendPerBone::pClassPointer = NULL;

// Class PlanBGame.PBAnim_MovementNode
// 0x0064 (0x0178 - 0x0114)
class UPBAnim_MovementNode : public UAnimNodeBlendList
{
public:
	unsigned char                                      SpeedType;                                        		// 0x0114 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bScaleAnimationsPlayRateBySpeed : 1;              		// 0x0118 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bScaleConstraintsByBaseSpeed : 1;                 		// 0x0118 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bShouldHandleTransitions : 1;                     		// 0x0118 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bPlayingTransitionToIdle : 1;                     		// 0x0118 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bTransitionFinished : 1;                          		// 0x0118 (0x0004) [0x0000000000002000] [0x00000010] ( CPF_Transient )
	class APBPawn*                                     WarPawnOwner;                                     		// 0x011C (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	float                                              Speed;                                            		// 0x0120 (0x0004) [0x0000000000000000]              
	float                                              IdleBlendOutTime;                                 		// 0x0124 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BlendUpTime;                                      		// 0x0128 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BlendDownTime;                                    		// 0x012C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BlendDownPerc;                                    		// 0x0130 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              MoveCycleFirstStepStartPosition;                  		// 0x0134 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAnimNodeSynch*                              SynchNode;                                        		// 0x0138 (0x0004) [0x0000000000000000]              
	struct FName                                       Name_SynchNode;                                   		// 0x013C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Name_SynchGroupName;                              		// 0x0144 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              TransitionBlendOutTime;                           		// 0x014C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< class UAnimNode* >                         TransitionNodes;                                  		// 0x0150 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              PrevGroupRelPos;                                  		// 0x015C (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	float                                              GroupRelPos;                                      		// 0x0160 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	TArray< struct FMovementDef >                      Movements;                                        		// 0x0164 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FPointer                                    LastTransInfo;                                    		// 0x0170 (0x0004) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )
	float                                              TransWeightResumeTheshold;                        		// 0x0174 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1382 ];

		return pClassPointer;
	};

};

UClass* UPBAnim_MovementNode::pClassPointer = NULL;

// Class PlanBGame.PBAnim_Offset
// 0x002B (0x011C - 0x00F1)
class UPBAnim_Offset : public UAnimNodeBlendBase
{
public:
	TArray< struct FOffsetComponent >                  Offsets;                                          		// 0x00F4 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	int                                                PassThroughAtOrAboveLOD;                          		// 0x0100 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< unsigned char >                            RequiredBones;                                    		// 0x0104 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< int >                                      BoneToOfstCpnt;                                   		// 0x0110 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1383 ];

		return pClassPointer;
	};

};

UClass* UPBAnim_Offset::pClassPointer = NULL;

