/*
#############################################################################################
# ORION Dino Beatdown (Unknown) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: SGshooter_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_LOW_ALERTNESS                                      0.2
#define CONST_HIGH_ALERTNESS                                     0.8
#define CONST_GS_USERNAME_MAXLENGTH                              15
#define CONST_GS_PASSWORD_MAXLENGTH                              30
#define CONST_GS_MESSAGE_MAXLENGTH                               255
#define CONST_GS_EMAIL_MAXLENGTH                                 50
#define CONST_GS_CDKEY_PART_MAXLENGTH                            4

#define CONST_QUERY_TDM                                          1
#define CONST_QUERY_CTF                                          2
#define CONST_QUERY_VCTF                                         3
#define CONST_QUERY_WAR                                          4
#define CONST_QUERY_DUEL                                         5
#define CONST_QUERY_CAMPAIGN                                     6
#define CONST_STATS_VIEW_DM_PLAYER_ALLTIME                       1
#define CONST_STATS_VIEW_DM_RANKED_ALLTIME                       2
#define CONST_STATS_VIEW_DM_WEAPONS_ALLTIME                      3
#define CONST_STATS_VIEW_DM_VEHICLES_ALLTIME                     4
#define CONST_STATS_VIEW_DM_VEHICLEWEAPONS_ALLTIME               5
#define CONST_STATS_VIEW_DM_VEHICLES_RANKED_ALLTIME              6
#define CONST_STATS_VIEW_DM_VEHICLEWEAPONS_RANKED_ALLTIME        7
#define CONST_STATS_VIEW_DM_WEAPONS_RANKED_ALLTIME               8
#define CONST_SERVERBROWSER_SERVERTYPE_LAN                       0
#define CONST_SERVERBROWSER_SERVERTYPE_UNRANKED                  1
#define CONST_SERVERBROWSER_SERVERTYPE_RANKED                    2
#define CONST_FakePlayerIndex                                    0

/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/

// Enum SGshooter.SGGoal.GoalStatus
/*enum GoalStatus
{
	GOAL_ACTIVE                                        = 0,
	GOAL_INACTIVE                                      = 1,
	GOAL_FAILED                                        = 2,
	GOAL_COMPLETED                                     = 3,
	GOAL_MAX                                           = 4
};*/

// Enum SGshooter.SGPawn.RollDirection
/*enum RollDirection
{
	ROLL_FORWARD                                       = 0,
	ROLL_FORWARDRIGHT                                  = 1,
	ROLL_RIGHT                                         = 2,
	ROLL_BACKRIGHT                                     = 3,
	ROLL_BACK                                          = 4,
	ROLL_BACKLEFT                                      = 5,
	ROLL_LEFT                                          = 6,
	ROLL_FORWARDLEFT                                   = 7,
	ROLL_NONE                                          = 8,
	ROLL_MAX                                           = 9
};*/

// Enum SGshooter.SGSpawnFactory_Bot.eBotStartupStage
/*enum eBotStartupStage
{
	STATE_Default                                      = 0,
	STATE_NonAlertedCustom                             = 1,
	Custom                                             = 2,
	eBotStartupStage_MAX                               = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class SGshooter.SG_KeyPad
// 0x0048 (0x021C - 0x01D4)
class ASG_KeyPad : public ATrigger
{
public:
	int                                                TeamIndex;                                        		// 0x01D4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< class ASGLockDevice* >                     aSGLockDevices;                                   		// 0x01D8 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned long                                      bLoocked : 1;                                     		// 0x01E4 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bOpen : 1;                                        		// 0x01E4 (0x0004) [0x0000000000000000] [0x00000002] 
	struct FKismetDrawTextInfo                         LockedDrawTextInfo;                               		// 0x01E8 (0x0034) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 41954 ];

		return pClassPointer;
	};

	void UnLock ( class AActor* Other );
	void eventUnTouch ( class AActor* Other );
	void eventTouch ( class AActor* Other, class UPrimitiveComponent* OtherComp, struct FVector HitLocation, struct FVector HitNormal );
	void eventPostBeginPlay ( );
};

UClass* ASG_KeyPad::pClassPointer = NULL;

// Class SGshooter.SGLockDevice
// 0x0070 (0x0238 - 0x01C8)
class ASGLockDevice : public AActor
{
public:
	float                                              ActionDistance;                                   		// 0x01C8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FKismetDrawTextInfo                         LockedDrawTextInfo;                               		// 0x01CC (0x0034) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FKismetDrawTextInfo                         UnLockedDrawTextInfo;                             		// 0x0200 (0x0034) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class ASG_KeyPad*                                  OwnerKeyPad;                                      		// 0x0234 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 41957 ];

		return pClassPointer;
	};

	void DoAction ( class APawn* Player );
	bool IsInRange ( class APawn* Player );
	int GetActType ( class APawn* Player );
};

UClass* ASGLockDevice::pClassPointer = NULL;

// Class SGshooter.SGSeqEvent_KeyPad
// 0x0000 (0x0114 - 0x0114)
class USGSeqEvent_KeyPad : public USequenceEvent
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 41973 ];

		return pClassPointer;
	};

	int eventGetObjClassVersion ( );
};

UClass* USGSeqEvent_KeyPad::pClassPointer = NULL;

// Class SGshooter.SGActorFactoryDestructible
// 0x0003 (0x0074 - 0x0071)
class USGActorFactoryDestructible : public UActorFactoryDynamicSM
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 41982 ];

		return pClassPointer;
	};

};

UClass* USGActorFactoryDestructible::pClassPointer = NULL;

// Class SGshooter.SGDestructible
// 0x00E0 (0x0398 - 0x02B8)
class ASGDestructible : public AKActor
{
public:
	TArray< class AKActor* >                           aKProjectiles;                                    		// 0x02B8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class USoundCue*                                   InitSound;                                        		// 0x02C4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAudioComponent*                             InitSoundComponent;                               		// 0x02C8 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	float                                              Init_Momentum;                                    		// 0x02CC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                Init_Damage;                                      		// 0x02D0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UStaticMesh*                                 MeshOnDamaged;                                    		// 0x02D4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   SoundOnDamaged;                                   		// 0x02D8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bOnDamageStopInitSound : 1;                       		// 0x02DC (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bDelaySetMesh : 1;                                		// 0x02DC (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	class UParticleSystem*                             ParticlesOnDamaged;                               		// 0x02E0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     LinearVelOnDamaged;                               		// 0x02E4 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     AngularVelOnDamaged;                              		// 0x02F0 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	class UAudioComponent*                             DamageSoundComponent;                             		// 0x02FC (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UParticleSystemComponent*                    DamageParticleComponent;                          		// 0x0300 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	float                                              Destroy_Momentum;                                 		// 0x0304 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                Destroy_Damage;                                   		// 0x0308 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UStaticMesh*                                 MeshOnDestroy;                                    		// 0x030C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   SoundOnDestroy;                                   		// 0x0310 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UParticleSystem*                             ParticlesOnDestroy;                               		// 0x0314 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UDistributionVector*                         LinearVelOnDestroy;                               		// 0x0318 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UDistributionVector*                         AngularVelOnDestroy;                              		// 0x031C (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	TArray< struct FEffectLight >                      aKeysEffectLight;                                 		// 0x0320 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FMakeHurt                                   DoHurt;                                           		// 0x032C (0x0020) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FMyProjectile >                     aProjectile;                                      		// 0x034C (0x000C) [0x0000000000480001]              ( CPF_Edit | CPF_Component | CPF_NeedCtorLink )
	float                                              ProjDeleteOnTimeHidden;                           		// 0x0358 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              PorjectileDelay;                                  		// 0x035C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FDecalInfo >                        aDestroyDecals;                                   		// 0x0360 (0x000C) [0x0000000000480001]              ( CPF_Edit | CPF_Component | CPF_NeedCtorLink )
	TArray< class AActor* >                            aDestroyActors;                                   		// 0x036C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UAudioComponent*                             DestroyedSoundComponent;                          		// 0x0378 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UParticleSystemComponent*                    DestroyedParticleComponent;                       		// 0x037C (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UUDKExplosionLight*                          ExploLight;                                       		// 0x0380 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class URB_RadialImpulseComponent*                  RadialImpulseComponent;                           		// 0x0384 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	int                                                CurrentDamage;                                    		// 0x0388 (0x0004) [0x0000000000000000]              
	struct FRotator                                    InitRotation;                                     		// 0x038C (0x000C) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 41984 ];

		return pClassPointer;
	};

	void eventDestroyed ( );
	void OnExplosionLightFinished ( class UUDKExplosionLight* Light );
	void TakeRadiusDamage ( class AController* InstigatedBy, float BaseDamage, float DamageRadius, class UClass* DamageType, float Momentum, struct FVector HurtOrigin, unsigned long bFullDamage, class AActor* DamageCauser, float DamageFalloffExponent );
	void Projectiles_Update ( );
	void DoExplosionDamage ( );
	void DestroyActors ( );
	void TimedProjectiles ( );
	void OnDestructed_SpawnDecals ( );
	void OnDestructed_ChangeMesh ( );
};

UClass* ASGDestructible::pClassPointer = NULL;

// Class SGshooter.SGAnimNodeCover
// 0x0000 (0x014C - 0x014C)
class USGAnimNodeCover : public UAnimNodeBlendByProperty
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 41985 ];

		return pClassPointer;
	};

};

UClass* USGAnimNodeCover::pClassPointer = NULL;

// Class SGshooter.SGAnimNodeCoverType
// 0x0000 (0x014C - 0x014C)
class USGAnimNodeCoverType : public UAnimNodeBlendByProperty
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 41987 ];

		return pClassPointer;
	};

};

UClass* USGAnimNodeCoverType::pClassPointer = NULL;

// Class SGshooter.SGAnimNodeTurnInPlace
// 0x000C (0x0134 - 0x0128)
class USGAnimNodeTurnInPlace : public UUDKAnimBlendBase
{
public:
	float                                              PlayIfAngleWhenMoving;                            		// 0x0128 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              PlayIfAngleWhenNotMoving;                         		// 0x012C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              MinMovingSpeed;                                   		// 0x0130 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 41989 ];

		return pClassPointer;
	};

	void eventTickAnim ( float DeltaSeconds );
};

UClass* USGAnimNodeTurnInPlace::pClassPointer = NULL;

// Class SGshooter.SGAnimNotify_Damage
// 0x0024 (0x0064 - 0x0040)
class USGAnimNotify_Damage : public UAnimNotify_Scripted
{
public:
	float                                              Damage;                                           		// 0x0040 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      FadeDamageWithDistance : 1;                       		// 0x0044 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      IgnoreInstigator : 1;                             		// 0x0044 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      OnlyApplyDamageOnServer : 1;                      		// 0x0044 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      ApplyOnlyToPawnsInGround : 1;                     		// 0x0044 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      ApplyOnlyToEnemy : 1;                             		// 0x0044 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	float                                              PushAwayForce;                                    		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UClass*                                      DamageType;                                       		// 0x004C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Radius;                                           		// 0x0050 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       SocketName;                                       		// 0x0054 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UCameraAnim*                                 DamageCameraAnim;                                 		// 0x005C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              DamageCameraAnimScale;                            		// 0x0060 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 41999 ];

		return pClassPointer;
	};

	void eventNotify ( class AActor* Owner, class UAnimNodeSequence* AnimSeqInstigator );
};

UClass* USGAnimNotify_Damage::pClassPointer = NULL;

// Class SGshooter.SGAutoTurret
// 0x0148 (0x0598 - 0x0450)
class ASGAutoTurret : public APawn
{
public:
	class APawn*                                       EnemyTarget;                                      		// 0x0450 (0x0004) [0x0000000000000000]              
	class APawn*                                       LastEnemyTarget;                                  		// 0x0454 (0x0004) [0x0000000000000000]              
	struct FVector                                     enemyDir;                                         		// 0x0458 (0x000C) [0x0000000000000000]              
	struct FVector                                     LastEnemyDir;                                     		// 0x0464 (0x000C) [0x0000000000000000]              
	float                                              TotalInterpTime;                                  		// 0x0470 (0x0004) [0x0000000000000000]              
	float                                              ElapsedTime;                                      		// 0x0474 (0x0004) [0x0000000000000000]              
	float                                              RotationAlpha;                                    		// 0x0478 (0x0004) [0x0000000000000000]              
	struct FRotator                                    StartRotation;                                    		// 0x047C (0x000C) [0x0000000000000000]              
	struct FRotator                                    TargetRotation;                                   		// 0x0488 (0x000C) [0x0000000000000000]              
	struct FVector                                     FireLocation;                                     		// 0x0494 (0x000C) [0x0000000000000000]              
	struct FRotator                                    FireRotation;                                     		// 0x04A0 (0x000C) [0x0000000000000000]              
	class USkelControlSingleBone*                      PivotController;                                  		// 0x04AC (0x0004) [0x0000000000000000]              
	unsigned long                                      bCanFire : 1;                                     		// 0x04B0 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bDestroyed : 1;                                   		// 0x04B0 (0x0004) [0x0000000000000000] [0x00000002] 
	class UParticleSystemComponent*                    DamageEffect;                                     		// 0x04B4 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UParticleSystemComponent*                    MuzzleFlashEffect;                                		// 0x04B8 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UParticleSystemComponent*                    DestroyEffect;                                    		// 0x04BC (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	int                                                MaxTurretHealth;                                  		// 0x04C0 (0x0004) [0x0000000000000000]              
	float                                              FullRevTime;                                      		// 0x04C4 (0x0004) [0x0000000000000000]              
	float                                              GElapsedTime;                                     		// 0x04C8 (0x0004) [0x0000000000000000]              
	int                                                OrigMinRotRate;                                   		// 0x04CC (0x0004) [0x0000000000000000]              
	class USkeletalMeshComponent*                      TurretMesh;                                       		// 0x04D0 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                 		// 0x04D4 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class USkeletalMesh*                               DestroyedMesh;                                    		// 0x04D8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FTurretBoneGroup                            TurretBones;                                      		// 0x04DC (0x0020) [0x0000000000000001]              ( CPF_Edit )
	struct FTurretRotationGroup                        TurretRotations;                                  		// 0x04FC (0x0028) [0x0000000000000001]              ( CPF_Edit )
	struct FRotationRange                              RotLimit;                                         		// 0x0524 (0x001C) [0x0000000000000001]              ( CPF_Edit )
	int                                                MinTurretRotRate;                                 		// 0x0540 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                MaxTurretRotRate;                                 		// 0x0544 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UClass*                                      ProjClass;                                        		// 0x0548 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                RoundsPerSec;                                     		// 0x054C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                AimRotError;                                      		// 0x0550 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              SeeRadius;                                        		// 0x0554 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct ASGAutoTurret_FTurretEmitterGroup           TurretEmitters;                                   		// 0x0558 (0x001C) [0x0000000000000001]              ( CPF_Edit )
	struct ASGAutoTurret_FTurretSoundGroup             TurretSounds;                                     		// 0x0574 (0x0018) [0x0000000000000001]              ( CPF_Edit )
	int                                                TurretHealth;                                     		// 0x058C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       CurState;                                         		// 0x0590 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 42023 ];

		return pClassPointer;
	};

	void RotateTimer ( );
	void DoRotation ( struct FRotator NewRotation, float InterpTime );
	void eventTakeDamage ( int Damage, class AController* InstigatedBy, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
	void Tick ( float Delta );
	void eventPostBeginPlay ( );
};

UClass* ASGAutoTurret::pClassPointer = NULL;

// Class SGshooter.SGPawn
// 0x01AC (0x0A1C - 0x0870)
class ASGPawn : public AUTPawn
{
public:
	unsigned long                                      bWeaponSpeedUpgrade : 1;                          		// 0x0870 (0x0004) [0x0000000000000020] [0x00000001] ( CPF_Net )
	unsigned long                                      bWeaponReloadSpeedUpgrade : 1;                    		// 0x0870 (0x0004) [0x0000000000000020] [0x00000002] ( CPF_Net )
	unsigned long                                      bWeaponDamageUpgrade : 1;                         		// 0x0870 (0x0004) [0x0000000000000020] [0x00000004] ( CPF_Net )
	unsigned long                                      bWeaponClipSizeUpgrade : 1;                       		// 0x0870 (0x0004) [0x0000000000000020] [0x00000008] ( CPF_Net )
	unsigned long                                      bIsMech : 1;                                      		// 0x0870 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bReadyToTexture : 1;                              		// 0x0870 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bCanChangeWeapon : 1;                             		// 0x0870 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      bSeen : 1;                                        		// 0x0870 (0x0004) [0x0000000000000020] [0x00000080] ( CPF_Net )
	unsigned long                                      bGrabbed : 1;                                     		// 0x0870 (0x0004) [0x0000000000000020] [0x00000100] ( CPF_Net )
	unsigned long                                      bIsBotDino : 1;                                   		// 0x0870 (0x0004) [0x0000000000000020] [0x00000200] ( CPF_Net )
	unsigned long                                      bTriggerHeal : 1;                                 		// 0x0870 (0x0004) [0x0000000000000020] [0x00000400] ( CPF_Net )
	unsigned char                                      nMeleeUpgrade;                                    		// 0x0874 (0x0001) [0x0000000000000020]              ( CPF_Net )
	unsigned char                                      nJumpUpgrade;                                     		// 0x0875 (0x0001) [0x0000000000000020]              ( CPF_Net )
	unsigned char                                      nRollUpgrade;                                     		// 0x0876 (0x0001) [0x0000000000000020]              ( CPF_Net )
	unsigned char                                      nAbilityUpgrade;                                  		// 0x0877 (0x0001) [0x0000000000000020]              ( CPF_Net )
	unsigned char                                      bLetGo;                                           		// 0x0878 (0x0001) [0x0000000000000020]              ( CPF_Net )
	float                                              CurrentSkillAmmo;                                 		// 0x087C (0x0004) [0x0000000000000020]              ( CPF_Net )
	class ASGDroppedPickup*                            TargetPickup;                                     		// 0x0880 (0x0004) [0x0000000000000020]              ( CPF_Net )
	TArray< class UMaterialInstanceConstant* >         CloakMaterialInstances;                           		// 0x0884 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UMaterialInstanceConstant* >         WeaponMaterialInstances;                          		// 0x0890 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UMaterialInstanceConstant* >         WeaponCloakMaterialInstances;                     		// 0x089C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UMaterialInstanceConstant* >         WeaponSilMaterialInstances;                       		// 0x08A8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UMaterialInstanceConstant* >         WeaponCloakSilMaterialInstances;                  		// 0x08B4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class USkeletalMeshComponent*                      LegsMesh;                                         		// 0x08C0 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	float                                              VisibleAmount;                                    		// 0x08C4 (0x0004) [0x0000000000000000]              
	float                                              MakeNoiseLoudness_FootStep;                       		// 0x08C8 (0x0004) [0x0000000000000000]              
	TArray< class UAnimNodeAimOffset* >                aAimNodes;                                        		// 0x08CC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UAnimNodeMirror*                             AnimNode_Mirror;                                  		// 0x08D8 (0x0004) [0x0000000000000000]              
	class USkelControlSingleBone*                      SklCtr_WeaponMirror;                              		// 0x08DC (0x0004) [0x0000000000000000]              
	class USkelControlSingleBone*                      SklCtr_RootRot;                                   		// 0x08E0 (0x0004) [0x0000000000000000]              
	struct FRotator                                    AimOffset;                                        		// 0x08E4 (0x000C) [0x0000000000000020]              ( CPF_Net )
	struct FRotator                                    MaxAimOffset;                                     		// 0x08F0 (0x000C) [0x0000000000000000]              
	struct FRotator                                    MinAimOffset;                                     		// 0x08FC (0x000C) [0x0000000000000000]              
	struct FRotator                                    SmoothedAimOffset;                                		// 0x0908 (0x000C) [0x0000000000000000]              
	float                                              LastAimKickTime;                                  		// 0x0914 (0x0004) [0x0000000000000000]              
	float                                              RunningFOV;                                       		// 0x0918 (0x0004) [0x0000000000000000]              
	float                                              BobScaleWhenRunning;                              		// 0x091C (0x0004) [0x0000000000000000]              
	class ASGWeaponAttachment*                         OldWeapon;                                        		// 0x0920 (0x0004) [0x0000000000000000]              
	struct FRotator                                    TrueAimDir;                                       		// 0x0924 (0x000C) [0x0000000000000000]              
	float                                              SmoothRootYaw;                                    		// 0x0930 (0x0004) [0x0000000000000000]              
	float                                              AimPitch;                                         		// 0x0934 (0x0004) [0x0000000000000020]              ( CPF_Net )
	float                                              AimYaw;                                           		// 0x0938 (0x0004) [0x0000000000000020]              ( CPF_Net )
	float                                              SmoothAimPitch;                                   		// 0x093C (0x0004) [0x0000000000000000]              
	float                                              SmoothAimYaw;                                     		// 0x0940 (0x0004) [0x0000000000000000]              
	class UAnimNodeAimOffset*                          SGSAimNode;                                       		// 0x0944 (0x0004) [0x0000000000000000]              
	int                                                SeatIndex;                                        		// 0x0948 (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                CreditScore;                                      		// 0x094C (0x0004) [0x0000000000000000]              
	class ASGPawn*                                     Finisher;                                         		// 0x0950 (0x0004) [0x0000000000000020]              ( CPF_Net )
	class APawn*                                       MyKiller;                                         		// 0x0954 (0x0004) [0x0000000000000020]              ( CPF_Net )
	class APawn*                                       SGSEnemy;                                         		// 0x0958 (0x0004) [0x0000000000000000]              
	class APawn*                                       RightFootPawn;                                    		// 0x095C (0x0004) [0x0000000000000000]              
	class APawn*                                       LeftFootPawn;                                     		// 0x0960 (0x0004) [0x0000000000000000]              
	TArray< struct FName >                             UnfixedBodyNames;                                 		// 0x0964 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FName >                             EnabledSpringBodyNames;                           		// 0x0970 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              LinearBoneSpringStrength;                         		// 0x097C (0x0004) [0x0000000000000000]              
	float                                              AngularBoneSpringStrength;                        		// 0x0980 (0x0004) [0x0000000000000000]              
	float                                              ForceRadius;                                      		// 0x0984 (0x0004) [0x0000000000000000]              
	float                                              ForceAmplification;                               		// 0x0988 (0x0004) [0x0000000000000000]              
	float                                              MaximumForceThatCanBeApplied;                     		// 0x098C (0x0004) [0x0000000000000000]              
	float                                              PhysicsBlendInTime;                               		// 0x0990 (0x0004) [0x0000000000000000]              
	float                                              PhysicsTime;                                      		// 0x0994 (0x0004) [0x0000000000000000]              
	float                                              PhysicsBlendOutTime;                              		// 0x0998 (0x0004) [0x0000000000000000]              
	float                                              LastHealingTime;                                  		// 0x099C (0x0004) [0x0000000000000000]              
	float                                              HealEffectRatio;                                  		// 0x09A0 (0x0004) [0x0000000000000000]              
	TArray< class UMaterialInstanceConstant* >         HealEffectMats;                                   		// 0x09A4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UMaterialInstanceConstant* >         HealEffectWeapon3Mats;                            		// 0x09B0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UMaterialInstanceConstant* >         HealEffectWeaponSilMats;                          		// 0x09BC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UMaterialInstanceConstant* >         HealEffectLegMats;                                		// 0x09C8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UMaterialInstanceConstant* >         CloakEffectMats;                                  		// 0x09D4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UMaterialInstanceConstant* >         CloakEffectWeapon3Mats;                           		// 0x09E0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UMaterialInstanceConstant* >         CloakEffectWeaponSilMats;                         		// 0x09EC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UMaterialInstanceConstant* >         CloakEffectLegMats;                               		// 0x09F8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FVector                                     JumpTarget;                                       		// 0x0A04 (0x000C) [0x0000000000000000]              
	struct FVector                                     JumpVelocity;                                     		// 0x0A10 (0x000C) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 42104 ];

		return pClassPointer;
	};

	void ServerPlayCustomAnim ( struct FName AnimName );
	void SetHandIKEnabled ( unsigned long bEnabled );
	void ServerStopRunning ( );
	void ServerRun ( );
	bool IsRunning ( );
	void ProcessViewRotation ( float DeltaTime, struct FRotator* out_ViewRotation, struct FRotator* out_DeltaRot );
	struct FRotator eventGetViewRotation ( );
	void AddAimKick ( struct FRotator AimKick );
	struct FVector GetPawnViewLocation ( );
	bool IsShotOnHead ( struct FVector HitLocation, struct FVector RayDir );
	void eventTakeDamage ( int Damage, class AController* InstigatedBy, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
	bool IsAnimMirrorEnabled ( );
	void SetAnimationMirror ( unsigned long bEnableMirror );
	void SetWeapAnimType ( unsigned char AnimType );
	void eventTick ( float ElapsedTime );
	float GetCloakValue ( );
	void HealMeh ( );
	bool IsDino ( );
	void eventPostInitAnimTree ( class USkeletalMeshComponent* SkelComp );
	void SetCharacterMeshInfo ( class USkeletalMesh* SkelMesh, class UMaterialInterface* HeadMaterial, class UMaterialInterface* BodyMaterial );
	bool VerifyBodyMaterialInstance ( );
	void SetTeamColor ( );
	void SetCharacterClassFromInfo ( class UClass* Info );
	void AddDefaultInventory ( );
	void HandleMomentum ( struct FVector Momentum, struct FVector HitLocation, class UClass* DamageType, struct FTraceHitInfo HitInfo );
	void eventPlayFootStepSound ( int FootDown );
	void OnHearSound ( class ASGPawn* NoiseMaker, float Loudness, struct FName SoundType );
	void Make_Noise ( float SoundRadius, struct FName SoundType );
	void ThrowWeaponOnDeath ( );
	void LostEnemies ( );
	bool EnemySeesMe ( );
	void PlayTakeHitEffects ( );
	void LeaveABloodSplatterDecal ( struct FVector HitLoc, struct FVector HitNorm );
	bool DoDinoAttackJump ( );
	void TriggerHealingEffect ( );
	bool IsJetPacking ( );
	bool IsCloaked ( );
	void ShouldCloak ( );
	void TimeToDie ( );
	bool IsRolling ( );
	void ReleaseMe ( );
	void TurnIntoRagdoll ( );
	void FinishMe ( );
	void TossMe ( );
	class UClass* GetPlayerReplicationInfoClass ( );
	void GrabMe ( );
	float PlayCustomAnim ( struct FName AnimName, float Rate, float BlendInTime, float BlendOutTime, unsigned long bLooping, unsigned long bOverride, float StartTime, unsigned long bHalfSlot, unsigned long bRoar, unsigned long bOverrideAnim, unsigned long bLegs );
	void eventReplicatedEvent ( struct FName VarName );
};

UClass* ASGPawn::pClassPointer = NULL;

// Class SGshooter.SGCheckPoint
// 0x0014 (0x02C4 - 0x02B0)
class ASGCheckPoint : public APlayerStart
{
public:
	float                                              LastUseTime;                                      		// 0x02B0 (0x0004) [0x0000000000000000]              
	struct FString                                     Description;                                      		// 0x02B4 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UCylinderComponent*                          Trigger;                                          		// 0x02C0 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 42187 ];

		return pClassPointer;
	};

	void eventTouch ( class AActor* Other, class UPrimitiveComponent* OtherComp, struct FVector HitLocation, struct FVector HitNormal );
};

UClass* ASGCheckPoint::pClassPointer = NULL;

// Class SGshooter.SGgame
// 0x0030 (0x056C - 0x053C)
class ASGgame : public AUTTeamGame
{
public:
	class UClass*                                      FlashMovieClass;                                  		// 0x053C (0x0004) [0x0000000000000000]              
	class USGSaveSystem*                               SaveSystem;                                       		// 0x0540 (0x0004) [0x0000000000000000]              
	unsigned long                                      bNoDinos : 1;                                     		// 0x0544 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bNoVehicles : 1;                                  		// 0x0544 (0x0004) [0x0000000000000000] [0x00000002] 
	int                                                StartingBase;                                     		// 0x0548 (0x0004) [0x0000000000000000]              
	int                                                StartingCredits;                                  		// 0x054C (0x0004) [0x0000000000000000]              
	int                                                StartingGrenades;                                 		// 0x0550 (0x0004) [0x0000000000000000]              
	int                                                NumAITrex;                                        		// 0x0554 (0x0004) [0x0000000000000000]              
	int                                                NumAIRham;                                        		// 0x0558 (0x0004) [0x0000000000000000]              
	int                                                NumAIRaptor;                                      		// 0x055C (0x0004) [0x0000000000000000]              
	struct FString                                     Difficulty;                                       		// 0x0560 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 42196 ];

		return pClassPointer;
	};

	int Sig ( float A );
	struct FVector Vec3 ( float X, float Y, float Z );
	float Step ( float V, float A, float B );
	float SmoothStep ( float V, float A, float B, float C, float D );
	void eventPostLogin ( class APlayerController* NewPlayer );
	bool ForceRespawn ( );
	void NotifySpree ( class AUTPlayerReplicationInfo* Other, int Num );
	void RestartPlayer ( class AController* NewPlayer );
	bool CanSpawnTrex ( );
	void PreBeginPlay ( );
	void SquadLeaderDied ( class ASGController_Bot* dino );
	void CreateSquad ( class ASGController_Bot* dino, int Id );
	bool AddToSquad ( class ASGController_Bot* dino, int Id );
	void InitPawn ( class APawn* Pawn );
	bool CanDinoSpawn ( );
};

UClass* ASGgame::pClassPointer = NULL;

// Class SGshooter.SGController_Bot
// 0x0074 (0x03C0 - 0x034C)
class ASGController_Bot : public AController
{
public:
	class AActor*                                      FocusActor;                                       		// 0x034C (0x0004) [0x0000000000000000]              
	struct FVector                                     FocusPoint;                                       		// 0x0350 (0x000C) [0x0000000000000000]              
	unsigned long                                      bLookAtFocusPoint : 1;                            		// 0x035C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      OnlyLookIfTargetVisible : 1;                      		// 0x035C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      OnlyLookIfInAimingRange : 1;                      		// 0x035C (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bIsSeeingTarget : 1;                              		// 0x035C (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      UseMoveToPoint : 1;                               		// 0x035C (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      LastMovementSucceeded : 1;                        		// 0x035C (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bControllerIsResolvingObstruction : 1;            		// 0x035C (0x0004) [0x0000000000000000] [0x00000040] 
	float                                              LookAtTargetInRange;                              		// 0x0360 (0x0004) [0x0000000000000000]              
	float                                              LastTimeCheckSeeingTarget;                        		// 0x0364 (0x0004) [0x0000000000000000]              
	float                                              MaxYawAim;                                        		// 0x0368 (0x0004) [0x0000000000000000]              
	float                                              StopMovementAngle;                                		// 0x036C (0x0004) [0x0000000000000000]              
	struct FVector                                     MoveTo_TargetPos;                                 		// 0x0370 (0x000C) [0x0000000000000000]              
	struct FVector                                     PathNextTarget;                                   		// 0x037C (0x000C) [0x0000000000000000]              
	struct FVector                                     PathFinalPoint;                                   		// 0x0388 (0x000C) [0x0000000000000000]              
	class AActor*                                      MoveTo_Actor;                                     		// 0x0394 (0x0004) [0x0000000000000000]              
	float                                              MoveTo_DestOffset;                                		// 0x0398 (0x0004) [0x0000000000000000]              
	float                                              LastReevaluateTime;                               		// 0x039C (0x0004) [0x0000000000000000]              
	class AActor*                                      aMoveTarget;                                      		// 0x03A0 (0x0004) [0x0000000000000000]              
	float                                              StuckedTime;                                      		// 0x03A4 (0x0004) [0x0000000000000000]              
	float                                              TimeBeforeStuck;                                  		// 0x03A8 (0x0004) [0x0000000000000000]              
	int                                                NumStuckRetries;                                  		// 0x03AC (0x0004) [0x0000000000000000]              
	TArray< class ANavigationPoint* >                  BlockedPoints;                                    		// 0x03B0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class ASGController_Bot*                           SquadLeader;                                      		// 0x03BC (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 42206 ];

		return pClassPointer;
	};

	bool ReEvaluatePath ( );
	bool HandlePathObstruction ( class AActor* BlockedBy );
	void PutInSquad ( int Id );
	struct FVector GetViewTarget ( );
	bool CheckTarget ( struct FVector Target );
	struct FVector GetEyesLoc ( );
	void Tick ( float ElapsedTime );
	float AngleBetween ( float Yaw1, float Yaw2, unsigned long Absolute );
	void MoveToActor ( class AActor* Dest, class AActor* FocusTarget, float DestOffset );
	void MoveToPoint ( struct FVector Point, class AActor* FocusTarget, float DestOffset );
	void DisableLookAt ( );
	void LookAtPoint ( struct FVector Point );
	void LookAtActor ( class AActor* PFocus );
};

UClass* ASGController_Bot::pClassPointer = NULL;

// Class SGshooter.SGController_BotBase
// 0x0098 (0x04C4 - 0x042C)
class ASGController_BotBase : public AUDKBot
{
public:
	float                                              HowNearToStartChasing;                            		// 0x042C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              VisionThreshold;                                  		// 0x0430 (0x0004) [0x0000000000000000]              
	float                                              FleeProbability;                                  		// 0x0434 (0x0004) [0x0000000000000000]              
	unsigned long                                      bIsFirstRoundShots : 1;                           		// 0x0438 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              WeaponSpreadPct;                                  		// 0x043C (0x0004) [0x0000000000000000]              
	struct FName                                       StartupState;                                     		// 0x0440 (0x0008) [0x0000000000000000]              
	TArray< struct FName >                             AlernessAnimations;                               		// 0x0448 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FName >                             NonAlertedCustomAnimations;                       		// 0x0454 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FName                                       NonAlertedToAlertedCustomAnimation;               		// 0x0460 (0x0008) [0x0000000000000000]              
	struct FSGAlernessDef                              Def_SightRadius;                                  		// 0x0468 (0x0008) [0x0000000000000000]              
	struct FSGAlernessDef                              Def_VisionThreshold;                              		// 0x0470 (0x0008) [0x0000000000000000]              
	struct FSGAlernessDef                              Def_VisionAngleDEG;                               		// 0x0478 (0x0008) [0x0000000000000000]              
	struct FSGAlernessDef                              Def_HearingThreshold;                             		// 0x0480 (0x0008) [0x0000000000000000]              
	struct FSGAlernessDef                              Def_ProbabilityOfFleeWhenHit;                     		// 0x0488 (0x0008) [0x0000000000000000]              
	float                                              ScriptedFollowPathDestOffset;                     		// 0x0490 (0x0004) [0x0000000000000000]              
	struct FVector                                     ScriptedTargetPos;                                		// 0x0494 (0x000C) [0x0000000000000000]              
	int                                                nShotsToFire;                                     		// 0x04A0 (0x0004) [0x0000000000000000]              
	int                                                NumPathFindingRetries;                            		// 0x04A4 (0x0004) [0x0000000000000000]              
	int                                                EstimatedFollowPathTime;                          		// 0x04A8 (0x0004) [0x0000000000000000]              
	struct FSGRange                                    AttackDistRange;                                  		// 0x04AC (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              ChaseExpansionRate;                               		// 0x04B4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FSGDangerZone >                     aDangerZones;                                     		// 0x04B8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 42288 ];

		return pClassPointer;
	};

	bool CanDoubleJump ( class APawn* Other );
	void Initialize ( );
	void AddDangerZone ( struct FVector Loc, float InnerRadius, float Danger, float ValidTime, float FadeOutLength );
	float GetDangerFromDangerZones ( struct FVector Point );
	void OnAIMoveToActor ( class USeqAct_AIMoveToActor* Action );
	void ScriptedMove_RethinkPath ( );
	void ScriptedMove_TooMuchTime ( );
	void MoveToPoint ( struct FVector Point, class AActor* FocusTarget, float DestOffset );
	void MoveToActor ( class AActor* Actor, class AActor* FocusTarget, float DestOffset );
	bool FindAValidPosition ( float MaxOffset, unsigned long bReachableFromStart, struct FVector* vTarget );
	bool eventNotifyHitWall ( struct FVector HitNormal, class AActor* Wall );
	bool eventNotifyBump ( class AActor* Other, struct FVector HitNormal );
	void ReceiveProjectileWarning ( class AProjectile* Proj );
	void ReceiveWarning ( class APawn* shooter, float projSpeed, struct FVector FireDir );
	void InstantWarnTarget ( class AActor* InTarget, class AWeapon* FiredWeapon, struct FVector FireDir );
	void eventEnemyNotVisible ( );
	void eventSeePlayer ( class APawn* SeenPlayer );
	struct FVector GetPossibleEnemyLocation ( );
	bool IsInAttackRange ( );
	void FireAt ( class APawn* Target, int nShots, float AccuracySpreadPct );
	bool IsChangingPawnViewLocation ( struct FVector* ViewLoc );
	bool LostContact ( float MaxTime );
	void SetAlertness ( float NewAlertness );
	void eventNotifyTakeHit ( class AController* InstigatedBy, struct FVector HitLocation, int Damage, class UClass* DamageType, struct FVector Momentum );
	void OnUnderFire ( struct FVector FireDir );
	void OnHearSound ( class ASGPawn* NoiseMaker, float Loudness, struct FName SoundType );
	void OnStopSeeingEnemy ( );
	void OnStartSeeingEnemy ( );
	float Rand_Range ( struct FSGRange Range );
	class ASGPawn* GetMainPlayer ( );
	void UpdatePawnRotation ( );
	void eventPossess ( class APawn* inPawn, unsigned long bVehicleTransition );
};

UClass* ASGController_BotBase::pClassPointer = NULL;

// Class SGshooter.SGController_Player
// 0x0034 (0x099C - 0x0968)
class ASGController_Player : public AUTPlayerController
{
public:
	class ASplineActor*                                CustomAction_Spline;                              		// 0x0968 (0x0004) [0x0000000000000000]              
	struct FName                                       CustomAction_EndAnim;                             		// 0x096C (0x0008) [0x0000000000000000]              
	float                                              CustomAction_SplineDistance;                      		// 0x0974 (0x0004) [0x0000000000000000]              
	float                                              CustomAction_MaxDamage;                           		// 0x0978 (0x0004) [0x0000000000000000]              
	TArray< struct FName >                             CustomAction_aRandomAnims;                        		// 0x097C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FName                                       CustomAction_Socket;                              		// 0x0988 (0x0008) [0x0000000000000000]              
	float                                              MoveToActor;                                      		// 0x0990 (0x0004) [0x0000000000000000]              
	unsigned long                                      bInitialized : 1;                                 		// 0x0994 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bDoubleTap : 1;                                   		// 0x0994 (0x0004) [0x0000000000000000] [0x00000002] 
	int                                                Credits;                                          		// 0x0998 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 42340 ];

		return pClassPointer;
	};

	void ServerUseKismetEvent ( struct FName CurrentToolTipName );
	void PrevWeapon ( );
	void NextWeapon ( );
	void CustomAction_PlayRandomAnim ( );
	void StopCustomAction ( );
	void StartCustomAction ( class ASplineActor* Spline, struct FName StartAnim, TArray< struct FName > aRandomAnims, struct FName EndAnim, float Damage, struct FName SocketName );
	void NotifyTakeHit ( class AController* InstigatedBy, struct FVector HitLocation, int Damage, class UClass* DamageType, struct FVector Momentum );
	void TryUpdateHud ( );
	void ClientUpdateHud ( );
	void ClientSetFlashMovie ( class UClass* FlashMovieClass );
	void GiveDefaultInventory ( TArray< class UClass* > InitialItems );
	void eventPossess ( class APawn* inPawn, unsigned long bVehicleTransition );
};

UClass* ASGController_Player::pClassPointer = NULL;

// Class SGshooter.SGFamilyInfo
// 0x0064 (0x0200 - 0x019C)
class USGFamilyInfo : public UUTFamilyInfo_Liandri_Male
{
public:
	class UClass*                                      PawnClass;                                        		// 0x019C (0x0004) [0x0000000000000000]              
