/*
#############################################################################################
# ORION Dino Beatdown (Unknown) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: SGshooter_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function SGshooter.SG_KeyPad.UnLock
// [0x00020002] 
struct ASG_KeyPad_execUnLock_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGshooter.SG_KeyPad.UnTouch
// [0x00020802] ( FUNC_Event )
struct ASG_KeyPad_eventUnTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             PlayerTeamIndex;                                  		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SG_KeyPad.Touch
// [0x00020802] ( FUNC_Event )
struct ASG_KeyPad_eventTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UPrimitiveComponent*                         OtherComp;                                        		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitNormal;                                        		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// int                                             PlayerTeamIndex;                                  		// 0x0020 (0x0004) [0x0000000000000000]              
	// class APlayerController*                        PC;                                               		// 0x0024 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SG_KeyPad.PostBeginPlay
// [0x00020902] ( FUNC_Event )
struct ASG_KeyPad_eventPostBeginPlay_Parms
{
	// class ASGLockDevice*                            LockDevice;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGLockDevice.DoAction
// [0x00020002] 
struct ASGLockDevice_execDoAction_Parms
{
	class APawn*                                       Player;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class APlayerController*                        PC;                                               		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGLockDevice.IsInRange
// [0x00820002] 
struct ASGLockDevice_execIsInRange_Parms
{
	class APawn*                                       Player;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  Forward;                                          		// 0x0008 (0x000C) [0x0000000000000000]              
	// struct FVector                                  Direction;                                        		// 0x0014 (0x000C) [0x0000000000000000]              
	// float                                           PlayerFaceOf;                                     		// 0x0020 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGLockDevice.GetActType
// [0x00020002] 
struct ASGLockDevice_execGetActType_Parms
{
	class APawn*                                       Player;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             PlayerTeamIndex;                                  		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGSeqEvent_KeyPad.GetObjClassVersion
// [0x00022802] ( FUNC_Event )
struct USGSeqEvent_KeyPad_eventGetObjClassVersion_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGDestructible.Destroyed
// [0x00020902] ( FUNC_Event )
struct ASGDestructible_eventDestroyed_Parms
{
};

// Function SGshooter.SGDestructible.OnExplosionLightFinished
// [0x00020002] 
struct ASGDestructible_execOnExplosionLightFinished_Parms
{
	class UUDKExplosionLight*                          Light;                                            		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function SGshooter.SGDestructible.TakeRadiusDamage
// [0x00024102] 
struct ASGDestructible_execTakeRadiusDamage_Parms
{
	class AController*                                 InstigatedBy;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              BaseDamage;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              DamageRadius;                                     		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Momentum;                                         		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HurtOrigin;                                       		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bFullDamage : 1;                                  		// 0x0020 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	class AActor*                                      DamageCauser;                                     		// 0x0024 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              DamageFalloffExponent;                            		// 0x0028 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SGshooter.SGDestructible.Projectiles_Update
// [0x00020002] 
struct ASGDestructible_execProjectiles_Update_Parms
{
	// class AKActor*                                  KProj;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGDestructible.DoExplosionDamage
// [0x00020102] 
struct ASGDestructible_execDoExplosionDamage_Parms
{
	// class AActor*                                   Victim;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	// float                                           VictimDist;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	// class AFracturedStaticMeshActor*                FracActor;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	// unsigned char                                   WantPhysChunksAndParticles;                       		// 0x000C (0x0001) [0x0000000000000000]              
};

// Function SGshooter.SGDestructible.DestroyActors
// [0x00020102] 
struct ASGDestructible_execDestroyActors_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	// class AActor*                                   pActor;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGDestructible.TimedProjectiles
// [0x00820002] 
struct ASGDestructible_execTimedProjectiles_Parms
{
	// struct FMyProjectile                            Proj;                                             		// 0x0000 (0x0020) [0x0000000000000000]              
	// class AKActor*                                  KProj;                                            		// 0x0020 (0x0004) [0x0000000000000000]              
	// struct FVector                                  ProjLocation;                                     		// 0x0024 (0x000C) [0x0000000000000000]              
};

// Function SGshooter.SGDestructible.OnDestructed_SpawnDecals
// [0x00820002] 
struct ASGDestructible_execOnDestructed_SpawnDecals_Parms
{
	// struct FDecalInfo                               pDecal;                                           		// 0x0000 (0x0020) [0x0000000000000000]              
	// struct FVector                                  pos;                                              		// 0x0020 (0x000C) [0x0000000000000000]              
	// float                                           DecalRotation;                                    		// 0x002C (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGDestructible.OnDestructed_ChangeMesh
// [0x00020002] 
struct ASGDestructible_execOnDestructed_ChangeMesh_Parms
{
};

// Function SGshooter.SGAnimNodeTurnInPlace.TickAnim
// [0x00020802] ( FUNC_Event )
struct USGAnimNodeTurnInPlace_eventTickAnim_Parms
{
	float                                              DeltaSeconds;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// float                                           MinTurnRate;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             NewIndex;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
	// class AUDKPawn*                                 pPawn;                                            		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGAnimNotify_Damage.Notify
// [0x00820802] ( FUNC_Event )
struct USGAnimNotify_Damage_eventNotify_Parms
{
	class AActor*                                      Owner;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UAnimNodeSequence*                           AnimSeqInstigator;                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class AActor*                                   P;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
	// class AActor*                                   Enemy;                                            		// 0x000C (0x0004) [0x0000000000000000]              
	// struct FVector                                  HurtLoc;                                          		// 0x0010 (0x000C) [0x0000000000000000]              
	// class AUTPlayerController*                      PC;                                               		// 0x001C (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGAutoTurret.RotateTimer
// [0x00020002] 
struct ASGAutoTurret_execRotateTimer_Parms
{
};

// Function SGshooter.SGAutoTurret.DoRotation
// [0x00020002] 
struct ASGAutoTurret_execDoRotation_Parms
{
	struct FRotator                                    NewRotation;                                      		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              InterpTime;                                       		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGshooter.SGAutoTurret.TakeDamage
// [0x00024802] ( FUNC_Event )
struct ASGAutoTurret_eventTakeDamage_Parms
{
	int                                                Damage;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AController*                                 InstigatedBy;                                     		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Momentum;                                         		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FTraceHitInfo                               HitInfo;                                          		// 0x0024 (0x001C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class AActor*                                      DamageCauser;                                     		// 0x0040 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SGshooter.SGAutoTurret.Tick
// [0x00020002] 
struct ASGAutoTurret_execTick_Parms
{
	float                                              Delta;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// float                                           currDot;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
	// float                                           thisDot;                                          		// 0x0008 (0x0004) [0x0000000000000000]              
	// class ASGPawn*                                  P;                                                		// 0x000C (0x0004) [0x0000000000000000]              
	// unsigned long                                   bHasTarget : 1;                                   		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function SGshooter.SGAutoTurret.PostBeginPlay
// [0x00020802] ( FUNC_Event )
struct ASGAutoTurret_eventPostBeginPlay_Parms
{
};

// Function SGshooter.SGPawn.ServerPlayCustomAnim
// [0x002200C2] 
struct ASGPawn_execServerPlayCustomAnim_Parms
{
	struct FName                                       AnimName;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGshooter.SGPawn.SetHandIKEnabled
// [0x00020102] 
struct ASGPawn_execSetHandIKEnabled_Parms
{
	unsigned long                                      bEnabled : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function SGshooter.SGPawn.ServerStopRunning
// [0x002200C2] 
struct ASGPawn_execServerStopRunning_Parms
{
};

// Function SGshooter.SGPawn.ServerRun
// [0x002200C2] 
struct ASGPawn_execServerRun_Parms
{
};

// Function SGshooter.SGPawn.IsRunning
// [0x00020002] 
struct ASGPawn_execIsRunning_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGPawn.ProcessViewRotation
// [0x00420102] 
struct ASGPawn_execProcessViewRotation_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    out_ViewRotation;                                 		// 0x0004 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FRotator                                    out_DeltaRot;                                     		// 0x0010 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function SGshooter.SGPawn.GetViewRotation
// [0x00020902] ( FUNC_Event )
struct ASGPawn_eventGetViewRotation_Parms
{
	struct FRotator                                    ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGPawn.AddAimKick
// [0x00820102] 
struct ASGPawn_execAddAimKick_Parms
{
	struct FRotator                                    AimKick;                                          		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// struct FRotator                                 ViewR;                                            		// 0x000C (0x000C) [0x0000000000000000]              
};

// Function SGshooter.SGPawn.GetPawnViewLocation
// [0x00820102] 
struct ASGPawn_execGetPawnViewLocation_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  ViewLoc;                                          		// 0x000C (0x000C) [0x0000000000000000]              
	// struct FVector                                  Right;                                            		// 0x0018 (0x000C) [0x0000000000000000]              
	// struct FVector                                  Forward;                                          		// 0x0024 (0x000C) [0x0000000000000000]              
	// struct FVector                                  Up;                                               		// 0x0030 (0x000C) [0x0000000000000000]              
	// struct FVector                                  Result;                                           		// 0x003C (0x000C) [0x0000000000000000]              
};

// Function SGshooter.SGPawn.IsShotOnHead
// [0x00820002] 
struct ASGPawn_execIsShotOnHead_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     RayDir;                                           		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  HeadLocation;                                     		// 0x001C (0x000C) [0x0000000000000000]              
	// float                                           Distance;                                         		// 0x0028 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGPawn.TakeDamage
// [0x00824802] ( FUNC_Event )
struct ASGPawn_eventTakeDamage_Parms
{
	int                                                Damage;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AController*                                 InstigatedBy;                                     		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Momentum;                                         		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FTraceHitInfo                               HitInfo;                                          		// 0x0024 (0x001C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class AActor*                                      DamageCauser;                                     		// 0x0040 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	// struct FVector                                  AxisX;                                            		// 0x0044 (0x000C) [0x0000000000000000]              
	// struct FVector                                  AxisY;                                            		// 0x0050 (0x000C) [0x0000000000000000]              
	// struct FVector                                  AxisZ;                                            		// 0x005C (0x000C) [0x0000000000000000]              
	// struct FVector2D                                ADist;                                            		// 0x0068 (0x0008) [0x0000000000000000]              
	// struct FPostProcessSettings                     DamagePostProcess;                                		// 0x0070 (0x0154) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// class ASGController_Player*                     PC;                                               		// 0x01C4 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGPawn.IsAnimMirrorEnabled
// [0x00020002] 
struct ASGPawn_execIsAnimMirrorEnabled_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGPawn.SetAnimationMirror
// [0x00020002] 
struct ASGPawn_execSetAnimationMirror_Parms
{
	unsigned long                                      bEnableMirror : 1;                                		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function SGshooter.SGPawn.SetWeapAnimType
// [0x00020102] 
struct ASGPawn_execSetWeapAnimType_Parms
{
	unsigned char                                      AnimType;                                         		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	// class UAnimNodeAimOffset*                       AimN;                                             		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGPawn.Tick
// [0x00820902] ( FUNC_Event )
struct ASGPawn_eventTick_Parms
{
	float                                              ElapsedTime;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FVector2D                                skelAim;                                          		// 0x0004 (0x0008) [0x0000000000000000]              
	// int                                             I;                                                		// 0x000C (0x0004) [0x0000000000000000]              
	// class UMaterialInstanceConstant*                Mat;                                              		// 0x0010 (0x0004) [0x0000000000000000]              
	// class UTexture*                                 T;                                                		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGPawn.GetCloakValue
// [0x00020102] 
struct ASGPawn_execGetCloakValue_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGPawn.HealMeh
// [0x00020202] ( FUNC_Exec )
struct ASGPawn_execHealMeh_Parms
{
};

// Function SGshooter.SGPawn.IsDino
// [0x00020102] 
struct ASGPawn_execIsDino_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGPawn.PostInitAnimTree
// [0x00020902] ( FUNC_Event )
struct ASGPawn_eventPostInitAnimTree_Parms
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	// class UAnimNodeAimOffset*                       AimN;                                             		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGPawn.SetCharacterMeshInfo
// [0x00020102] 
struct ASGPawn_execSetCharacterMeshInfo_Parms
{
	class USkeletalMesh*                               SkelMesh;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UMaterialInterface*                          HeadMaterial;                                     		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UMaterialInterface*                          BodyMaterial;                                     		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGshooter.SGPawn.VerifyBodyMaterialInstance
// [0x00020102] 
struct ASGPawn_execVerifyBodyMaterialInstance_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             I;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGPawn.SetTeamColor
// [0x00020100] 
struct ASGPawn_execSetTeamColor_Parms
{
};

// Function SGshooter.SGPawn.SetCharacterClassFromInfo
// [0x00020102] 
struct ASGPawn_execSetCharacterClassFromInfo_Parms
{
	class UClass*                                      Info;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class UClass*                                   Family;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
	// class APlayerController*                        P;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGPawn.AddDefaultInventory
// [0x00020000] 
struct ASGPawn_execAddDefaultInventory_Parms
{
};

// Function SGshooter.SGPawn.HandleMomentum
// [0x00024000] 
struct ASGPawn_execHandleMomentum_Parms
{
	struct FVector                                     Momentum;                                         		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FTraceHitInfo                               HitInfo;                                          		// 0x001C (0x001C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SGshooter.SGPawn.PlayFootStepSound
// [0x00020902] ( FUNC_Event )
struct ASGPawn_eventPlayFootStepSound_Parms
{
	int                                                FootDown;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGshooter.SGPawn.OnHearSound
// [0x00020002] 
struct ASGPawn_execOnHearSound_Parms
{
	class ASGPawn*                                     NoiseMaker;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Loudness;                                         		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       SoundType;                                        		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGshooter.SGPawn.Make_Noise
// [0x00024002] 
struct ASGPawn_execMake_Noise_Parms
{
	float                                              SoundRadius;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       SoundType;                                        		// 0x0004 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	// class ASGPawn*                                  pPawn;                                            		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGPawn.ThrowWeaponOnDeath
// [0x00020002] 
struct ASGPawn_execThrowWeaponOnDeath_Parms
{
};

// Function SGshooter.SGPawn.LostEnemies
// [0x00020002] 
struct ASGPawn_execLostEnemies_Parms
{
};

// Function SGshooter.SGPawn.EnemySeesMe
// [0x00020102] 
struct ASGPawn_execEnemySeesMe_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGPawn.PlayTakeHitEffects
// [0x00820102] 
struct ASGPawn_execPlayTakeHitEffects_Parms
{
	// class UClass*                                   UTDamage;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	// struct FVector                                  BloodMomentum;                                    		// 0x0004 (0x000C) [0x0000000000000000]              
	// class AUTEmit_HitEffect*                        HitEffect;                                        		// 0x0010 (0x0004) [0x0000000000000000]              
	// class UParticleSystem*                          BloodTemplate;                                    		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGPawn.LeaveABloodSplatterDecal
// [0x00820102] 
struct ASGPawn_execLeaveABloodSplatterDecal_Parms
{
	struct FVector                                     HitLoc;                                           		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitNorm;                                          		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// class AActor*                                   TraceActor;                                       		// 0x0018 (0x0004) [0x0000000000000000]              
	// struct FVector                                  out_HitLocation;                                  		// 0x001C (0x000C) [0x0000000000000000]              
	// struct FVector                                  out_HitNormal;                                    		// 0x0028 (0x000C) [0x0000000000000000]              
	// struct FVector                                  TraceDest;                                        		// 0x0034 (0x000C) [0x0000000000000000]              
	// struct FVector                                  TraceStart;                                       		// 0x0040 (0x000C) [0x0000000000000000]              
	// struct FVector                                  TraceExtent;                                      		// 0x004C (0x000C) [0x0000000000000000]              
	// struct FTraceHitInfo                            HitInfo;                                          		// 0x0058 (0x001C) [0x0000000000000000]              
	// class UMaterialInstanceTimeVarying*             MITV_Decal;                                       		// 0x0074 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGPawn.DoDinoAttackJump
// [0x00820002] 
struct ASGPawn_execDoDinoAttackJump_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           T1;                                               		// 0x0004 (0x0004) [0x0000000000000000]              
	// float                                           t2;                                               		// 0x0008 (0x0004) [0x0000000000000000]              
	// float                                           X;                                                		// 0x000C (0x0004) [0x0000000000000000]              
	// float                                           Z;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
	// struct FVector                                  Vel;                                              		// 0x0014 (0x000C) [0x0000000000000000]              
	// float                                           G;                                                		// 0x0020 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGPawn.TriggerHealingEffect
// [0x00020002] 
struct ASGPawn_execTriggerHealingEffect_Parms
{
};

// Function SGshooter.SGPawn.IsJetPacking
// [0x00020102] 
struct ASGPawn_execIsJetPacking_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGPawn.IsCloaked
// [0x00020102] 
struct ASGPawn_execIsCloaked_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGPawn.ShouldCloak
// [0x00020100] 
struct ASGPawn_execShouldCloak_Parms
{
};

// Function SGshooter.SGPawn.TimeToDie
// [0x00020102] 
struct ASGPawn_execTimeToDie_Parms
{
};

// Function SGshooter.SGPawn.IsRolling
// [0x00020102] 
struct ASGPawn_execIsRolling_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGPawn.ReleaseMe
// [0x00820102] 
struct ASGPawn_execReleaseMe_Parms
{
	// struct FVector                                  Dir;                                              		// 0x0000 (0x000C) [0x0000000000000000]              
};

// Function SGshooter.SGPawn.TurnIntoRagdoll
// [0x00020102] 
struct ASGPawn_execTurnIntoRagdoll_Parms
{
};

// Function SGshooter.SGPawn.FinishMe
// [0x00020102] 
struct ASGPawn_execFinishMe_Parms
{
	// int                                             Yaw;                                              		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGPawn.TossMe
// [0x00020100] 
struct ASGPawn_execTossMe_Parms
{
};

// Function SGshooter.SGPawn.GetPlayerReplicationInfoClass
// [0x00020102] 
struct ASGPawn_execGetPlayerReplicationInfoClass_Parms
{
	class UClass*                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGPawn.GrabMe
// [0x00020100] 
struct ASGPawn_execGrabMe_Parms
{
};

// Function SGshooter.SGPawn.PlayCustomAnim
// [0x00024100] 
struct ASGPawn_execPlayCustomAnim_Parms
{
	struct FName                                       AnimName;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              Rate;                                             		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              BlendInTime;                                      		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              BlendOutTime;                                     		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bLooping : 1;                                     		// 0x0014 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bOverride : 1;                                    		// 0x0018 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	float                                              StartTime;                                        		// 0x001C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bHalfSlot : 1;                                    		// 0x0020 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bRoar : 1;                                        		// 0x0024 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bOverrideAnim : 1;                                		// 0x0028 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bLegs : 1;                                        		// 0x002C (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0030 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGPawn.ReplicatedEvent
// [0x00020902] ( FUNC_Event )
struct ASGPawn_eventReplicatedEvent_Parms
{
	struct FName                                       VarName;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGshooter.SGCheckPoint.Touch
// [0x00020802] ( FUNC_Event )
struct ASGCheckPoint_eventTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UPrimitiveComponent*                         OtherComp;                                        		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitNormal;                                        		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGshooter.SGgame.Sig
// [0x00022002] 
struct ASGgame_execSig_Parms
{
	float                                              A;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGgame.Vec3
// [0x00822002] 
struct ASGgame_execVec3_Parms
{
	float                                              X;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Y;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Z;                                                		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x000C (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  V;                                                		// 0x0018 (0x000C) [0x0000000000000000]              
};

// Function SGshooter.SGgame.Step
// [0x00022002] 
struct ASGgame_execStep_Parms
{
	float                                              V;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              A;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              B;                                                		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGgame.SmoothStep
// [0x00022002] 
struct ASGgame_execSmoothStep_Parms
{
	float                                              V;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              A;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              B;                                                		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              C;                                                		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              D;                                                		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGgame.PostLogin
// [0x00020802] ( FUNC_Event )
struct ASGgame_eventPostLogin_Parms
{
	class APlayerController*                           NewPlayer;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGshooter.SGgame.ForceRespawn
// [0x00020002] 
struct ASGgame_execForceRespawn_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGgame.NotifySpree
// [0x00020000] 
struct ASGgame_execNotifySpree_Parms
{
	class AUTPlayerReplicationInfo*                    Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                Num;                                              		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGshooter.SGgame.RestartPlayer
// [0x00020002] 
struct ASGgame_execRestartPlayer_Parms
{
	class AController*                                 NewPlayer;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGshooter.SGgame.CanSpawnTrex
// [0x00020002] 
struct ASGgame_execCanSpawnTrex_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGgame.PreBeginPlay
// [0x00020102] 
struct ASGgame_execPreBeginPlay_Parms
{
};

// Function SGshooter.SGgame.SquadLeaderDied
// [0x00020000] 
struct ASGgame_execSquadLeaderDied_Parms
{
	class ASGController_Bot*                           dino;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGshooter.SGgame.CreateSquad
// [0x00020000] 
struct ASGgame_execCreateSquad_Parms
{
	class ASGController_Bot*                           dino;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                Id;                                               		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGshooter.SGgame.AddToSquad
// [0x00020000] 
struct ASGgame_execAddToSquad_Parms
{
	class ASGController_Bot*                           dino;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                Id;                                               		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGgame.InitPawn
// [0x00020002] 
struct ASGgame_execInitPawn_Parms
{
	class APawn*                                       Pawn;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGshooter.SGgame.CanDinoSpawn
// [0x00020002] 
struct ASGgame_execCanDinoSpawn_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGController_Bot.ReEvaluatePath
// [0x00020002] 
struct ASGController_Bot_execReEvaluatePath_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGController_Bot.HandlePathObstruction
// [0x00020002] 
struct ASGController_Bot_execHandlePathObstruction_Parms
{
	class AActor*                                      BlockedBy;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGController_Bot.PutInSquad
// [0x00020002] 
struct ASGController_Bot_execPutInSquad_Parms
{
	int                                                Id;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGshooter.SGController_Bot.GetViewTarget
// [0x00020002] 
struct ASGController_Bot_execGetViewTarget_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGController_Bot.CheckTarget
// [0x00020002] 
struct ASGController_Bot_execCheckTarget_Parms
{
	struct FVector                                     Target;                                           		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGController_Bot.GetEyesLoc
// [0x00020002] 
struct ASGController_Bot_execGetEyesLoc_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGController_Bot.Tick
// [0x00020102] 
struct ASGController_Bot_execTick_Parms
{
	float                                              ElapsedTime;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGshooter.SGController_Bot.AngleBetween
// [0x00024002] 
struct ASGController_Bot_execAngleBetween_Parms
{
	float                                              Yaw1;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Yaw2;                                             		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      Absolute : 1;                                     		// 0x0008 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGController_Bot.MoveToActor
// [0x00024002] 
struct ASGController_Bot_execMoveToActor_Parms
{
	class AActor*                                      Dest;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      FocusTarget;                                      		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              DestOffset;                                       		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SGshooter.SGController_Bot.MoveToPoint
// [0x00024002] 
struct ASGController_Bot_execMoveToPoint_Parms
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      FocusTarget;                                      		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              DestOffset;                                       		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SGshooter.SGController_Bot.DisableLookAt
// [0x00020002] 
struct ASGController_Bot_execDisableLookAt_Parms
{
};

// Function SGshooter.SGController_Bot.LookAtPoint
// [0x00020002] 
struct ASGController_Bot_execLookAtPoint_Parms
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGshooter.SGController_Bot.LookAtActor
// [0x00020002] 
struct ASGController_Bot_execLookAtActor_Parms
{
	class AActor*                                      PFocus;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGshooter.SGController_BotBase.CanDoubleJump
// [0x00020002] 
struct ASGController_BotBase_execCanDoubleJump_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGshooter.SGController_BotBase.Initialize
// [0x00020000] 
struct ASGController_BotBase_execInitialize_Parms
{
};

// Function SGshooter.SGController_BotBase.AddDangerZone
// [0x00824002] 
struct ASGController_BotBase_execAddDangerZone_Parms
{
	struct FVector                                     Loc;                                              		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              InnerRadius;                                      		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Danger;                                           		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ValidTime;                                        		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              FadeOutLength;                                    		// 0x0018 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	// struct FSGDangerZone                            Zone;                                             		// 0x001C (0x0020) [0x0000000000000000]              
};

// Function SGshooter.SGController_BotBase.GetDangerFromDangerZones
// [0x00020002] 
struct ASGController_BotBase_execGetDangerFromDangerZones_Parms
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           MaxDanger;                                        		// 0x0010 (0x0004) [0x0000000000000000]              
	// float                                           D;                                                		// 0x0014 (0x0004) [0x0000000000000000]              
	// float                                           Danger;                                           		// 0x0018 (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x001C (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGController_BotBase.OnAIMoveToActor
// [0x00020002] 
struct ASGController_BotBase_execOnAIMoveToActor_Parms
{
	class USeqAct_AIMoveToActor*                       Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class AActor*                                   destActor;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function SGshooter.SGController_BotBase.ScriptedMove_RethinkPath
// [0x00020002] 
struct ASGController_BotBase_execScriptedMove_RethinkPath_Parms
{
};

// Function SGshooter.SGController_BotBase.ScriptedMove_TooMuchTime
// [0x00020002] 
struct ASGController_BotBase_execScriptedMove_TooMuchTime_Parms
{
};

// Function SGshooter.SGController_BotBase.MoveToPoint
// [0x00024002] 
struct ASGController_BotBase_execMoveToPoint_Parms
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      FocusTarget;                                      		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              DestOffset;                                       		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SGshooter.SGController_BotBase.MoveToActor
// [0x00024002] 
struct ASGController_BotBase_execMoveToActor_Parms
{
	class AActor*                                      Actor;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      FocusTarget;                                      		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              DestOffset;                                       		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SGshooter.SGController_BotBase.FindAValidPosition
// [0x00424002] 
struct ASGController_BotBase_execFindAValidPosition_Parms
{
	struct FVector                                     vTarget;                                          		// 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              MaxOffset;                                        		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bReachableFromStart : 1;                          		// 0x0010 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// TArray< struct FVector >                        ValidPositions;                                   		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function SGshooter.SGController_BotBase.NotifyHitWall
// [0x00020802] ( FUNC_Event )
struct ASGController_BotBase_eventNotifyHitWall_Parms
{
	struct FVector                                     HitNormal;                                        		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Wall;                                             		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

