/*
#############################################################################################
# ORION Dino Beatdown (Unknown) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: SGSOrion_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function SGSOrion.SGS_Achievements.AchievementDone
// [0x00020002] 
struct USGS_Achievements_execAchievementDone_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function SGSOrion.SGS_Achievements.UpdateSpiceOfLife
// [0x00020002] 
struct USGS_Achievements_execUpdateSpiceOfLife_Parms
{
	int                                                MutatorBitMask;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             CurrentMask;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             MutatorBit;                                       		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Achievements.UpdateVehicles
// [0x00020002] 
struct USGS_Achievements_execUpdateVehicles_Parms
{
	int                                                VehicleBitMask;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             CurrentMask;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             VehicleBit;                                       		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Achievements.UpdatePunches
// [0x00020002] 
struct USGS_Achievements_execUpdatePunches_Parms
{
	int                                                PunchBitMask;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             CurrentMask;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             PunchBit;                                         		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Achievements.UpdateMacGuyver
// [0x00020002] 
struct USGS_Achievements_execUpdateMacGuyver_Parms
{
	int                                                WeaponBitMask;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             CurrentMask;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             WeaponBit;                                        		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Achievements.ReadAchievementStatsComplete
// [0x00020002] 
struct USGS_Achievements_execReadAchievementStatsComplete_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.SpeakTTS
// [0x00024100] 
struct ASGS_Controller_Player_execSpeakTTS_Parms
{
	struct FString                                     S;                                                		// 0x0000 (0x000C) [0x0000000000400880]              ( CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink )
	class APlayerReplicationInfo*                      PRI;                                              		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.PerformedUseAction
// [0x00020102] 
struct ASGS_Controller_Player_execPerformedUseAction_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ASGS_BuyStation*                          BS;                                               		// 0x0004 (0x0004) [0x0000000000000000]              
	// TArray< class AUTWeapon* >                      WeaponList;                                       		// 0x0008 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             I;                                                		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Controller_Player.ServerPickupWeapon
// [0x002200C2] 
struct ASGS_Controller_Player_execServerPickupWeapon_Parms
{
	class ASGDroppedPickup*                            P;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             I;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
	// TArray< class AUTWeapon* >                      WeaponList;                                       		// 0x0008 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function SGSOrion.SGS_Controller_Player.SGSChangeSeat
// [0x002200C2] 
struct ASGS_Controller_Player_execSGSChangeSeat_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ServerGiveCredits
// [0x002200C2] 
struct ASGS_Controller_Player_execServerGiveCredits_Parms
{
	int                                                ParameterA;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.DoItUp
// [0x00020002] 
struct ASGS_Controller_Player_execDoItUp_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ClientOpenBarracksMenu
// [0x010201C2] 
struct ASGS_Controller_Player_execClientOpenBarracksMenu_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ClientOpenArmoryMenu
// [0x010201C2] 
struct ASGS_Controller_Player_execClientOpenArmoryMenu_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ClientOpenGarageMenu
// [0x010201C2] 
struct ASGS_Controller_Player_execClientOpenGarageMenu_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.Destroyed
// [0x00020902] ( FUNC_Event )
struct ASGS_Controller_Player_eventDestroyed_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.FindBuyStation
// [0x00820002] 
struct ASGS_Controller_Player_execFindBuyStation_Parms
{
	class ASGS_BuyStation*                             ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ASGS_Armory*                              A;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
	// class ASGS_Barracks*                            B;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
	// class ASGS_Garage*                              G;                                                		// 0x000C (0x0004) [0x0000000000000000]              
	// struct FVector                                  PawnLoc2D;                                        		// 0x0010 (0x000C) [0x0000000000000000]              
	// struct FVector                                  VLoc2D;                                           		// 0x001C (0x000C) [0x0000000000000000]              
	// unsigned long                                   bPowerOff : 1;                                    		// 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function SGSOrion.SGS_Controller_Player.ClientUpdatePunches
// [0x010201C2] 
struct ASGS_Controller_Player_execClientUpdatePunches_Parms
{
	int                                                WeaponBitMask;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.ClientUpdateVehicles
// [0x010201C2] 
struct ASGS_Controller_Player_execClientUpdateVehicles_Parms
{
	int                                                WeaponBitMask;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.ClientUpdateMacGuyver
// [0x010201C2] 
struct ASGS_Controller_Player_execClientUpdateMacGuyver_Parms
{
	int                                                WeaponBitMask;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.PickupWeapon
// [0x00820002] 
struct ASGS_Controller_Player_execPickupWeapon_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ASGDroppedPickup*                         W;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
	// struct FVector                                  ViewDir;                                          		// 0x0008 (0x000C) [0x0000000000000000]              
	// struct FVector                                  PawnLoc2D;                                        		// 0x0014 (0x000C) [0x0000000000000000]              
	// struct FVector                                  VLoc2D;                                           		// 0x0020 (0x000C) [0x0000000000000000]              
	// float                                           NewDot;                                           		// 0x002C (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Controller_Player.FindGenerator
// [0x00820002] 
struct ASGS_Controller_Player_execFindGenerator_Parms
{
	class ASGS_PowerGenerator*                         ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ASGS_PowerGenerator*                      Gen;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
	// struct FVector                                  ViewDir;                                          		// 0x0008 (0x000C) [0x0000000000000000]              
	// struct FVector                                  PawnLoc2D;                                        		// 0x0014 (0x000C) [0x0000000000000000]              
	// struct FVector                                  VLoc2D;                                           		// 0x0020 (0x000C) [0x0000000000000000]              
	// float                                           NewDot;                                           		// 0x002C (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Controller_Player.FindVehicleToDrive
// [0x00820002] 
struct ASGS_Controller_Player_execFindVehicleToDrive_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class AVehicle*                                 V;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
	// class AVehicle*                                 Best;                                             		// 0x0008 (0x0004) [0x0000000000000000]              
	// struct FVector                                  ViewDir;                                          		// 0x000C (0x000C) [0x0000000000000000]              
	// struct FVector                                  PawnLoc2D;                                        		// 0x0018 (0x000C) [0x0000000000000000]              
	// struct FVector                                  VLoc2D;                                           		// 0x0024 (0x000C) [0x0000000000000000]              
	// float                                           NewDot;                                           		// 0x0030 (0x0004) [0x0000000000000000]              
	// float                                           BestDot;                                          		// 0x0034 (0x0004) [0x0000000000000000]              
	// struct FVector                                  pos;                                              		// 0x0038 (0x000C) [0x0000000000000000]              
	// float                                           newdist;                                          		// 0x0044 (0x0004) [0x0000000000000000]              
	// float                                           bestDist;                                         		// 0x0048 (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x004C (0x0004) [0x0000000000000000]              
	// int                                             BestSeat;                                         		// 0x0050 (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Controller_Player.FindMechToDrive
// [0x00820002] 
struct ASGS_Controller_Player_execFindMechToDrive_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ASGS_MechPawn*                            M;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
	// class ASGS_MechPawn*                            Best;                                             		// 0x0008 (0x0004) [0x0000000000000000]              
	// struct FVector                                  ViewDir;                                          		// 0x000C (0x000C) [0x0000000000000000]              
	// struct FVector                                  PawnLoc2D;                                        		// 0x0018 (0x000C) [0x0000000000000000]              
	// struct FVector                                  VLoc2D;                                           		// 0x0024 (0x000C) [0x0000000000000000]              
	// float                                           NewDot;                                           		// 0x0030 (0x0004) [0x0000000000000000]              
	// float                                           BestDot;                                          		// 0x0034 (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Controller_Player.DoPathing
// [0x00020102] 
struct ASGS_Controller_Player_execDoPathing_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ClientShowPath
// [0x010201C0] 
struct ASGS_Controller_Player_execClientShowPath_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.StopRolling
// [0x00020002] 
struct ASGS_Controller_Player_execStopRolling_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ServerUseHardDevice
// [0x002200C2] 
struct ASGS_Controller_Player_execServerUseHardDevice_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.UseHardDevice
// [0x00020202] ( FUNC_Exec )
struct ASGS_Controller_Player_execUseHardDevice_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.GetPlayerViewPoint
// [0x00420902] ( FUNC_Event )
struct ASGS_Controller_Player_eventGetPlayerViewPoint_Parms
{
	struct FVector                                     POVLocation;                                      		// 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FRotator                                    POVRotation;                                      		// 0x000C (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	// float                                           DeltaTime;                                        		// 0x0018 (0x0004) [0x0000000000000000]              
	// class AUTPawn*                                  P;                                                		// 0x001C (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Controller_Player.StopTaunt
// [0x00020102] 
struct ASGS_Controller_Player_execStopTaunt_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.Taunt
// [0x00020202] ( FUNC_Exec )
struct ASGS_Controller_Player_execTaunt_Parms
{
	int                                                TauntIndex;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.FOV
// [0x00020202] ( FUNC_Exec )
struct ASGS_Controller_Player_execFOV_Parms
{
	float                                              F;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.FreeRoam
// [0x00020002] 
struct ASGS_Controller_Player_execFreeRoam_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGSOrion.SGS_Controller_Player.SlowDownCamera
// [0x00020002] 
struct ASGS_Controller_Player_execSlowDownCamera_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGSOrion.SGS_Controller_Player.SpeedUpCamera
// [0x00020002] 
struct ASGS_Controller_Player_execSpeedUpCamera_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGSOrion.SGS_Controller_Player.CycleCamera
// [0x00020002] 
struct ASGS_Controller_Player_execCycleCamera_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGSOrion.SGS_Controller_Player.SpecZoomOut
// [0x00020002] 
struct ASGS_Controller_Player_execSpecZoomOut_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGSOrion.SGS_Controller_Player.SpecZoomIn
// [0x00020002] 
struct ASGS_Controller_Player_execSpecZoomIn_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGSOrion.SGS_Controller_Player.SlowMotion
// [0x00020002] 
struct ASGS_Controller_Player_execSlowMotion_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGSOrion.SGS_Controller_Player.ThrowGrenade
// [0x00020202] ( FUNC_Exec )
struct ASGS_Controller_Player_execThrowGrenade_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.SetHand
// [0x00020002] 
struct ASGS_Controller_Player_execSetHand_Parms
{
	unsigned char                                      NewWeaponHand;                                    		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.SetBehindView
// [0x00020002] 
struct ASGS_Controller_Player_execSetBehindView_Parms
{
	unsigned long                                      bNewBehindView : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.SGSGetNextViewablePlayer
// [0x00020002] 
struct ASGS_Controller_Player_execSGSGetNextViewablePlayer_Parms
{
	int                                                Dir;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class APlayerReplicationInfo*                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             I;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             CurrentIndex;                                     		// 0x000C (0x0004) [0x0000000000000000]              
	// int                                             NewIndex;                                         		// 0x0010 (0x0004) [0x0000000000000000]              
	// class APlayerReplicationInfo*                   PRI;                                              		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Controller_Player.CloseAllBuyMenus
// [0x010201C2] 
struct ASGS_Controller_Player_execCloseAllBuyMenus_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ShowDeathOptions
// [0x00020002] 
struct ASGS_Controller_Player_execShowDeathOptions_Parms
{
	// class ASGS_Pawn_Soldier*                        P;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Controller_Player.AddLife
// [0x00020002] 
struct ASGS_Controller_Player_execAddLife_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ClientShowWaveIncoming
// [0x010201C2] 
struct ASGS_Controller_Player_execClientShowWaveIncoming_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ClientShowWaveCompleted
// [0x010201C2] 
struct ASGS_Controller_Player_execClientShowWaveCompleted_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ClientShowWaveTimer
// [0x010201C2] 
struct ASGS_Controller_Player_execClientShowWaveTimer_Parms
{
	int                                                TimeLeft;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.DeathEffectTimer
// [0x00020102] 
struct ASGS_Controller_Player_execDeathEffectTimer_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ProcessDriveMech
// [0x00020002] 
struct ASGS_Controller_Player_execProcessDriveMech_Parms
{
	float                                              InForward;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              InStrafe;                                         		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              InUp;                                             		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      InJump : 1;                                       		// 0x000C (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.ServerDriveMech
// [0x00A20042] 
struct ASGS_Controller_Player_execServerDriveMech_Parms
{
	float                                              InForward;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              InStrafe;                                         		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              aUp;                                              		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      InJump : 1;                                       		// 0x000C (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	int                                                View;                                             		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FRotator                                 ViewRotation;                                     		// 0x0014 (0x000C) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Controller_Player.CheckJumpOrDuck
// [0x00020002] 
struct ASGS_Controller_Player_execCheckJumpOrDuck_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.PlayAnnouncement
// [0x00024002] 
struct ASGS_Controller_Player_execPlayAnnouncement_Parms
{
	class UClass*                                      InMessageClass;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                MessageIndex;                                     		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class UObject*                                     OptionalObject;                                   		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.HeadshotMessage
// [0x00020002] 
struct ASGS_Controller_Player_execHeadshotMessage_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.BullseyeMessage
// [0x00020002] 
struct ASGS_Controller_Player_execBullseyeMessage_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.AcknowledgePossession
// [0x00820002] 
struct ASGS_Controller_Player_execAcknowledgePossession_Parms
{
	class APawn*                                       P;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FRotator                                 NewViewRotation;                                  		// 0x0004 (0x000C) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Controller_Player.PlayStartupMessage
// [0x010201C2] 
struct ASGS_Controller_Player_execPlayStartupMessage_Parms
{
	unsigned char                                      StartupStage;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.NotifyHitWall
// [0x00020802] ( FUNC_Event )
struct ASGS_Controller_Player_eventNotifyHitWall_Parms
{
	struct FVector                                     HitNormal;                                        		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Wall;                                             		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGSOrion.SGS_Controller_Player.ProcessViewRotation
// [0x00C20002] 
struct ASGS_Controller_Player_execProcessViewRotation_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    out_ViewRotation;                                 		// 0x0004 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FRotator                                    DeltaRot;                                         		// 0x0010 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// float                                           DesiredPitch;                                     		// 0x001C (0x0004) [0x0000000000000000]              
	// struct FVector                                  Dir;                                              		// 0x0020 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 TargetRotation;                                   		// 0x002C (0x000C) [0x0000000000000000]              
	// struct FRotator                                 ViewRotation;                                     		// 0x0038 (0x000C) [0x0000000000000000]              
	// float                                           ViewPitchMin;                                     		// 0x0044 (0x0004) [0x0000000000000000]              
	// float                                           ViewPitchMax;                                     		// 0x0048 (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Controller_Player.UpdateRotation
// [0x00820002] 
struct ASGS_Controller_Player_execUpdateRotation_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FRotator                                 DeltaRot;                                         		// 0x0004 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 NewRotation;                                      		// 0x0010 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 ViewRotation;                                     		// 0x001C (0x000C) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Controller_Player.SpectateOnServer
// [0x002200C2] 
struct ASGS_Controller_Player_execSpectateOnServer_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ServerSpectate
// [0x00020002] 
struct ASGS_Controller_Player_execServerSpectate_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.SetShowRespawnHud
// [0x010201C2] 
struct ASGS_Controller_Player_execSetShowRespawnHud_Parms
{
	unsigned long                                      bShow : 1;                                        		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.ServerTeamSelected
// [0x002200C2] 
struct ASGS_Controller_Player_execServerTeamSelected_Parms
{
	int                                                iTeam;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                iClass;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     CharacterType;                                    		// 0x0008 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function SGSOrion.SGS_Controller_Player.ClientSelectTeam
// [0x010201C2] 
struct ASGS_Controller_Player_execClientSelectTeam_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ClientShowHUD
// [0x010201C2] 
struct ASGS_Controller_Player_execClientShowHUD_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ClientSetChrType
// [0x010201C2] 
struct ASGS_Controller_Player_execClientSetChrType_Parms
{
	class UClass*                                      Type;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.SetCharacter
// [0x00020002] 
struct ASGS_Controller_Player_execSetCharacter_Parms
{
	struct FString                                     inCharacter;                                      		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             ChrClass;                                         		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Controller_Player.InitPlayerReplicationInfo
// [0x00020002] 
struct ASGS_Controller_Player_execInitPlayerReplicationInfo_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ServerRadioMessage
// [0x00220042] 
struct ASGS_Controller_Player_execServerRadioMessage_Parms
{
	unsigned char                                      T;                                                		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	// int                                             Offset;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Controller_Player.SGSSwitchWeapon
// [0x00020102] 
struct ASGS_Controller_Player_execSGSSwitchWeapon_Parms
{
	unsigned char                                      T;                                                		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGSOrion.SGS_Controller_Player.StopCharging
// [0x00020202] ( FUNC_Exec )
struct ASGS_Controller_Player_execStopCharging_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.OpenClassSelection
// [0x00020002] 
struct ASGS_Controller_Player_execOpenClassSelection_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ClientShowEndGame
// [0x010201C2] 
struct ASGS_Controller_Player_execClientShowEndGame_Parms
{
	unsigned long                                      bWinner : 1;                                      		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.ClientShowGameFull
// [0x010201C2] 
struct ASGS_Controller_Player_execClientShowGameFull_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ClientShowLeaveGame
// [0x010201C2] 
struct ASGS_Controller_Player_execClientShowLeaveGame_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ClientShowTeleportError
// [0x010201C2] 
struct ASGS_Controller_Player_execClientShowTeleportError_Parms
{
	int                                                Seconds;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.ClientShowDisconnect
// [0x010201C2] 
struct ASGS_Controller_Player_execClientShowDisconnect_Parms
{
	struct FString                                     msg;                                              		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function SGSOrion.SGS_Controller_Player.SuperJump
// [0x00020002] 
struct ASGS_Controller_Player_execSuperJump_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ServerDoSuperJump
// [0x002200C2] 
struct ASGS_Controller_Player_execServerDoSuperJump_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.CloseNotification
// [0x00020002] 
struct ASGS_Controller_Player_execCloseNotification_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ServerAddLife
// [0x002200C2] 
struct ASGS_Controller_Player_execServerAddLife_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ServerSetTeamIndex
// [0x002200C2] 
struct ASGS_Controller_Player_execServerSetTeamIndex_Parms
{
	int                                                I;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.SwitchWeapon
// [0x00020202] ( FUNC_Exec )
struct ASGS_Controller_Player_execSwitchWeapon_Parms
{
	unsigned char                                      T;                                                		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.ClientPlayTakeHit
// [0x01020142] 
struct ASGS_Controller_Player_execClientPlayTakeHit_Parms
{
	struct FVector                                     HitLoc;                                           		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      Damage;                                           		// 0x000C (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.ServerSubtractCredits
// [0x002200C2] 
struct ASGS_Controller_Player_execServerSubtractCredits_Parms
{
	int                                                Amount;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.ClientPlaySound
// [0x01020942] ( FUNC_Event )
struct ASGS_Controller_Player_eventClientPlaySound_Parms
{
	class USoundCue*                                   ASound;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.NotifyTakeHit
// [0x00020002] 
struct ASGS_Controller_Player_execNotifyTakeHit_Parms
{
	class AController*                                 InstigatedBy;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                Damage;                                           		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Momentum;                                         		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.GiveDefaultInventory
// [0x00020102] 
struct ASGS_Controller_Player_execGiveDefaultInventory_Parms
{
	TArray< class UClass* >                            InitialItems;                                     		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             I;                                                		// 0x000C (0x0004) [0x0000000000000000]              
	// class AInventory*                               Inv;                                              		// 0x0010 (0x0004) [0x0000000000000000]              
	// TArray< class AUTWeapon* >                      WeaponList;                                       		// 0x0014 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function SGSOrion.SGS_Controller_Player.SetMovie
// [0x00020002] 
struct ASGS_Controller_Player_execSetMovie_Parms
{
	class USGS_DBMainMenu*                             newMenu;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Controller_Player.JumpTimer
// [0x00020102] 
struct ASGS_Controller_Player_execJumpTimer_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ShowMeleeTip
// [0x010201C2] 
struct ASGS_Controller_Player_execShowMeleeTip_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ShowPowerOffTip
// [0x010201C2] 
struct ASGS_Controller_Player_execShowPowerOffTip_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ShowBuyStationTip
// [0x010201C2] 
struct ASGS_Controller_Player_execShowBuyStationTip_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ShowSupplyStationTip
// [0x010201C2] 
struct ASGS_Controller_Player_execShowSupplyStationTip_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ShowReloadTip
// [0x010201C2] 
struct ASGS_Controller_Player_execShowReloadTip_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ShowSeatChangeTip
// [0x010201C2] 
struct ASGS_Controller_Player_execShowSeatChangeTip_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ShowGenTurnOnTip
// [0x010201C2] 
struct ASGS_Controller_Player_execShowGenTurnOnTip_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.GetKeyBinding
// [0x010201C2] 
struct ASGS_Controller_Player_execGetKeyBinding_Parms
{
	struct FString                                     Binding;                                          		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FName                                       ReturnValue;                                      		// 0x000C (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             J;                                                		// 0x0014 (0x0004) [0x0000000000000000]              
	// struct FName                                    N;                                                		// 0x0018 (0x0008) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Controller_Player.ShowCrouchTip
// [0x010201C2] 
struct ASGS_Controller_Player_execShowCrouchTip_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ShowSkillTip
// [0x010201C2] 
struct ASGS_Controller_Player_execShowSkillTip_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ShowHudAwarenessTip
// [0x010201C2] 
struct ASGS_Controller_Player_execShowHudAwarenessTip_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ShowFireModeTip
// [0x010201C2] 
struct ASGS_Controller_Player_execShowFireModeTip_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ShowRollTip
// [0x010201C2] 
struct ASGS_Controller_Player_execShowRollTip_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ShowRadioTip
// [0x010201C2] 
struct ASGS_Controller_Player_execShowRadioTip_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ShowTeamChatTip
// [0x010201C2] 
struct ASGS_Controller_Player_execShowTeamChatTip_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ShowRandomTip
// [0x00020102] 
struct ASGS_Controller_Player_execShowRandomTip_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.PostBeginPlay
// [0x00020902] ( FUNC_Event )
struct ASGS_Controller_Player_eventPostBeginPlay_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ShowMoveTip
// [0x010201C2] 
struct ASGS_Controller_Player_execShowMoveTip_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.IsFlashing
// [0x00020102] 
struct ASGS_Controller_Player_execIsFlashing_Parms
{
	class AActor*                                      A;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGSOrion.SGS_Controller_Player.StopFlashing
// [0x00020102] 
struct ASGS_Controller_Player_execStopFlashing_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ServerThrowWeapon
// [0x002200C2] 
struct ASGS_Controller_Player_execServerThrowWeapon_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.ThrowWeapon
// [0x00020202] ( FUNC_Exec )
struct ASGS_Controller_Player_execThrowWeapon_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.DropMoney
// [0x00020202] ( FUNC_Exec )
struct ASGS_Controller_Player_execDropMoney_Parms
{
};

// Function SGSOrion.SGS_Controller_Player.Possess
// [0x00020902] ( FUNC_Event )
struct ASGS_Controller_Player_eventPossess_Parms
{
	class APawn*                                       inPawn;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bVehicleTransition : 1;                           		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function SGSOrion.SGS_Vehicle.InCombat
// [0x00020102] 
struct ASGS_Vehicle_execInCombat_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGSOrion.SGS_Vehicle.UpdateLookSteerStatus
// [0x00020100] 
struct ASGS_Vehicle_execUpdateLookSteerStatus_Parms
{
};

// Function SGSOrion.SGS_Vehicle.UpdateHateTimer
// [0x01020142] 
struct ASGS_Vehicle_execUpdateHateTimer_Parms
{
};

// Function SGSOrion.SGS_Vehicle.TurnEMPOff
// [0x00020102] 
struct ASGS_Vehicle_execTurnEMPOff_Parms
{
};

// Function SGSOrion.SGS_Vehicle.TurnEMPOn
// [0x00020102] 
struct ASGS_Vehicle_execTurnEMPOn_Parms
{
};

// Function SGSOrion.SGS_Vehicle.SetInputs
// [0x00020102] 
struct ASGS_Vehicle_execSetInputs_Parms
{
	float                                              InForward;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              InStrafe;                                         		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              InUp;                                             		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Vehicle.EndEMP
// [0x00020002] 
struct ASGS_Vehicle_execEndEMP_Parms
{
};

// Function SGSOrion.SGS_Vehicle.HitWithEMP
// [0x002200C2] 
struct ASGS_Vehicle_execHitWithEMP_Parms
{
};

// Function SGSOrion.SGS_Vehicle.SetBurnOut
// [0x00820102] 
struct ASGS_Vehicle_execSetBurnOut_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             NumElements;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             TeamNum;                                          		// 0x0008 (0x0004) [0x0000000000000000]              
	// struct FBurnOutDatum                            BOD;                                              		// 0x000C (0x0008) [0x0000000000000000]              
	// class AUTCarriedObject*                         Flag;                                             		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Vehicle.SitDriver
// [0x00020102] 
struct ASGS_Vehicle_execSitDriver_Parms
{
	class AUTPawn*                                     UTP;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                SeatIndex;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SGSOrion.SGS_Vehicle.PassengerEnter
// [0x00020002] 
struct ASGS_Vehicle_execPassengerEnter_Parms
{
	class APawn*                                       P;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                SeatIndex;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGSOrion.SGS_Vehicle.PassengerLeave
// [0x00020002] 
struct ASGS_Vehicle_execPassengerLeave_Parms
{
	int                                                SeatIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class APawn*                                    P;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Vehicle.ChangeSeat
// [0x00020002] 
struct ASGS_Vehicle_execChangeSeat_Parms
{
	class AController*                                 ControllerToMove;                                 		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                RequestedSeat;                                    		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SGSOrion.SGS_Vehicle.TryToGetIn
// [0x00020002] 
struct ASGS_Vehicle_execTryToGetIn_Parms
{
	int                                                SeatIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class APawn*                                       P;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             I;                                                		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Vehicle.DriverLeave
// [0x00020802] ( FUNC_Event )
struct ASGS_Vehicle_eventDriverLeave_Parms
{
	unsigned long                                      bForceLeave : 1;                                  		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// unsigned long                                   bRet : 1;                                         		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// class APawn*                                    P;                                                		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Vehicle.SetDirtEffects
// [0x00020102] 
struct ASGS_Vehicle_execSetDirtEffects_Parms
{
	unsigned long                                      bOn : 1;                                          		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// int                                             I;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Vehicle.UpdateDirtParticles
// [0x00020102] 
struct ASGS_Vehicle_execUpdateDirtParticles_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Vehicle.FixWheelParticlesPleaseEpic
// [0x00820102] 
struct ASGS_Vehicle_execFixWheelParticlesPleaseEpic_Parms
{
	// struct FVector                                  Loc;                                              		// 0x0000 (0x000C) [0x0000000000000000]              
	// struct FVector                                  norm;                                             		// 0x000C (0x000C) [0x0000000000000000]              
	// struct FVector                                  End;                                              		// 0x0018 (0x000C) [0x0000000000000000]              
	// struct FTraceHitInfo                            HitInfo;                                          		// 0x0024 (0x001C) [0x0000000000000000]              
	// class AActor*                                   traceHit;                                         		// 0x0040 (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0044 (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Vehicle.StopServerHandBrake
// [0x002200C2] 
struct ASGS_Vehicle_execStopServerHandBrake_Parms
{
};

// Function SGSOrion.SGS_Vehicle.ServerHandBrake
// [0x002200C2] 
struct ASGS_Vehicle_execServerHandBrake_Parms
{
};

// Function SGSOrion.SGS_Vehicle.SpawnTracer
// [0x00820102] 
struct ASGS_Vehicle_execSpawnTracer_Parms
{
	struct FVector                                     EffectLocation;                                   		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// struct FVector                                  Dir;                                              		// 0x0018 (0x000C) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Vehicle.VehicleWeaponFireEffects
// [0x00820102] 
struct ASGS_Vehicle_execVehicleWeaponFireEffects_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                SeatIndex;                                        		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FVector                                  pos;                                              		// 0x0010 (0x000C) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Vehicle.Register
// [0x00020102] 
struct ASGS_Vehicle_execRegister_Parms
{
	// class ASGS_Controller_Player*                   P;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Vehicle.PostBeginPlay
// [0x00020102] 
struct ASGS_Vehicle_execPostBeginPlay_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function SGSOrion.SGS_Vehicle.StartSmokeEffect
// [0x00020102] 
struct ASGS_Vehicle_execStartSmokeEffect_Parms
{
};

// Function SGSOrion.SGS_Vehicle.StartFireEffect
// [0x00020102] 
struct ASGS_Vehicle_execStartFireEffect_Parms
{
};

// Function SGSOrion.SGS_Vehicle.StopEffects
// [0x00020102] 
struct ASGS_Vehicle_execStopEffects_Parms
{
};

// Function SGSOrion.SGS_Vehicle.CheckDamageSmoke
// [0x00020102] 
struct ASGS_Vehicle_execCheckDamageSmoke_Parms
{
};

// Function SGSOrion.SGS_Vehicle.TakeDamage
// [0x00024902] ( FUNC_Event )
struct ASGS_Vehicle_eventTakeDamage_Parms
{
	int                                                Damage;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AController*                                 EventInstigator;                                  		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Momentum;                                         		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FTraceHitInfo                               HitInfo;                                          		// 0x0024 (0x001C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class AActor*                                      DamageCauser;                                     		// 0x0040 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SGSOrion.SGS_Vehicle.PostRenderFor
// [0x00820902] ( FUNC_Event )
struct ASGS_Vehicle_eventPostRenderFor_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UCanvas*                                     Canvas;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CameraPosition;                                   		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CameraDir;                                        		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// float                                           TextXL;                                           		// 0x0020 (0x0004) [0x0000000000000000]              
	// float                                           XL;                                               		// 0x0024 (0x0004) [0x0000000000000000]              
	// float                                           YL;                                               		// 0x0028 (0x0004) [0x0000000000000000]              
	// float                                           Dist;                                             		// 0x002C (0x0004) [0x0000000000000000]              
