/*
#############################################################################################
# ORION Dino Beatdown (Unknown) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: SGSOrion_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/


/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/

// Enum SGSOrion.SGS_Achievements.SGSGameAchievements
/*enum SGSGameAchievements
{
	SGSAchievement                                     = 0,
	SGSAchievement01                                   = 1,
	SGSAchievement02                                   = 2,
	SGSAchievement03                                   = 3,

	SGSAchievement42                                   = 42,
	SGSAchievement43                                   = 43,
	SGSAchievement44                                   = 44,
	SGSAchievement45                                   = 45,
	SGSAchievement46                                   = 46,
	SGSAchievement47                                   = 47,
	SGSAchievement48                                   = 48,
	SGSAchievement49                                   = 49,
	SGSAchievement50                                   = 50,
	SGSAchievement51                                   = 51,
	SGSAchievement52                                   = 52,
	SGSAchievement53                                   = 53,
	SGSAchievement54                                   = 54,
	SGSAchievement55                                   = 55,
	SGSAchievement56                                   = 56,
	SGSAchievement57                                   = 57,
	SGSAchievement_MAX                                 = 58
};*/

// Enum SGSOrion.SGS_DBMainMenu.EQueryCompletionAction
/*enum EQueryCompletionAction
{
	QUERYACTION_None                                   = 0,
	QUERYACTION_Default                                = 1,
	QUERYACTION_CloseScene                             = 2,
	QUERYACTION_JoinServer                             = 3,
	QUERYACTION_RefreshAll                             = 4,
	QUERYACTION_MAX                                    = 5
};*/

// Enum SGSOrion.SGS_GFxFrontEnd_JoinGame.EQueryCompletionAction
/*enum EQueryCompletionAction
{
	QUERYACTION_None                                   = 0,
	QUERYACTION_Default                                = 1,
	QUERYACTION_CloseScene                             = 2,
	QUERYACTION_JoinServer                             = 3,
	QUERYACTION_RefreshAll                             = 4,
	QUERYACTION_MAX                                    = 5
};*/

// Enum SGSOrion.SGS_MusicManager.SGS_EMusicState
/*enum SGS_EMusicState
{
	TRACK_Intro                                        = 0,
	TRACK_Ambient                                      = 1,
	TRACK_Tension                                      = 2,
	TRACK_Action_Winning                               = 3,
	TRACK_Action_Loosing                               = 4,
	TRACK_Ending                                       = 5,
	TRACK_MAX                                          = 6
};*/

// Enum SGSOrion.SGS_Weap_RocketLauncher.ERocketFireMode1
/*enum ERocketFireMode1
{
	RFM_Spread                                         = 0,
	RFM_Spiral                                         = 1,
	RFM_Grenades                                       = 2,
	RFM_Max                                            = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class SGSOrion.SGS_Achievements
// 0x0000 (0x0074 - 0x0074)
class USGS_Achievements : public UUTAchievementsBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 49824 ];

		return pClassPointer;
	};

	void AchievementDone ( unsigned long bWasSuccessful );
	void UpdateSpiceOfLife ( int MutatorBitMask );
	void UpdateVehicles ( int VehicleBitMask );
	void UpdatePunches ( int PunchBitMask );
	void UpdateMacGuyver ( int WeaponBitMask );
	void ReadAchievementStatsComplete ( unsigned long bWasSuccessful );
};

UClass* USGS_Achievements::pClassPointer = NULL;

// Class SGSOrion.SGS_Controller_Player
// 0x0084 (0x0A20 - 0x099C)
class ASGS_Controller_Player : public ASGController_Player
{
public:
	unsigned long                                      bTutMovement : 1;                                 		// 0x099C (0x0004) [0x0000000000004000] [0x00000001] ( CPF_Config )
	unsigned long                                      bTutTurnGeneratorOn : 1;                          		// 0x099C (0x0004) [0x0000000000004000] [0x00000002] ( CPF_Config )
	unsigned long                                      bTutHealGenerator : 1;                            		// 0x099C (0x0004) [0x0000000000004000] [0x00000004] ( CPF_Config )
	unsigned long                                      bTutGetInVehicle : 1;                             		// 0x099C (0x0004) [0x0000000000004000] [0x00000008] ( CPF_Config )
	unsigned long                                      bTutChangeSeat : 1;                               		// 0x099C (0x0004) [0x0000000000004000] [0x00000010] ( CPF_Config )
	unsigned long                                      bTutReload : 1;                                   		// 0x099C (0x0004) [0x0000000000004000] [0x00000020] ( CPF_Config )
	unsigned long                                      bTutRadio : 1;                                    		// 0x099C (0x0004) [0x0000000000004000] [0x00000040] ( CPF_Config )
	unsigned long                                      bTutTeamChat : 1;                                 		// 0x099C (0x0004) [0x0000000000004000] [0x00000080] ( CPF_Config )
	unsigned long                                      bTutPowerOff : 1;                                 		// 0x099C (0x0004) [0x0000000000004000] [0x00000100] ( CPF_Config )
	unsigned long                                      bTutHudAwareness : 1;                             		// 0x099C (0x0004) [0x0000000000004000] [0x00000200] ( CPF_Config )
	unsigned long                                      bTutHudColors : 1;                                		// 0x099C (0x0004) [0x0000000000004000] [0x00000400] ( CPF_Config )
	unsigned long                                      bTutChangeFiremode : 1;                           		// 0x099C (0x0004) [0x0000000000004000] [0x00000800] ( CPF_Config )
	unsigned long                                      bTutBuyStation : 1;                               		// 0x099C (0x0004) [0x0000000000004000] [0x00001000] ( CPF_Config )
	unsigned long                                      bTutSupplyStation : 1;                            		// 0x099C (0x0004) [0x0000000000004000] [0x00002000] ( CPF_Config )
	unsigned long                                      bTutRoll : 1;                                     		// 0x099C (0x0004) [0x0000000000004000] [0x00004000] ( CPF_Config )
	unsigned long                                      bTutSkill : 1;                                    		// 0x099C (0x0004) [0x0000000000004000] [0x00008000] ( CPF_Config )
	unsigned long                                      bTutCrouch : 1;                                   		// 0x099C (0x0004) [0x0000000000004000] [0x00010000] ( CPF_Config )
	unsigned long                                      bTutMelee : 1;                                    		// 0x099C (0x0004) [0x0000000000004000] [0x00020000] ( CPF_Config )
	unsigned long                                      bKeysSet : 1;                                     		// 0x099C (0x0004) [0x0000000000004000] [0x00040000] ( CPF_Config )
	unsigned long                                      bFlashBuyStation : 1;                             		// 0x099C (0x0004) [0x0000000000000000] [0x00080000] 
	unsigned long                                      bRequestedTeamSelection : 1;                      		// 0x099C (0x0004) [0x0000000000000000] [0x00100000] 
	unsigned long                                      bShowRespawnHud : 1;                              		// 0x099C (0x0004) [0x0000000000000000] [0x00200000] 
	unsigned long                                      bSnapShot : 1;                                    		// 0x099C (0x0004) [0x0000000000000020] [0x00400000] ( CPF_Net )
	unsigned long                                      bPressedSuperJump : 1;                            		// 0x099C (0x0004) [0x0000000000000000] [0x00800000] 
	unsigned long                                      bVaulted : 1;                                     		// 0x099C (0x0004) [0x0000000000000000] [0x01000000] 
	unsigned long                                      bCanFall : 1;                                     		// 0x099C (0x0004) [0x0000000000000000] [0x02000000] 
	unsigned long                                      bFlyUp : 1;                                       		// 0x099C (0x0004) [0x0000000000000000] [0x04000000] 
	unsigned long                                      bFlyDown : 1;                                     		// 0x099C (0x0004) [0x0000000000000000] [0x08000000] 
	float                                              LastRadioTime;                                    		// 0x09A0 (0x0004) [0x0000000000000000]              
	int                                                CharacterClass;                                   		// 0x09A4 (0x0004) [0x0000000000000000]              
	int                                                RespawnCountDown;                                 		// 0x09A8 (0x0004) [0x0000000000000000]              
	class USoundCue*                                   ReSpawnTick;                                      		// 0x09AC (0x0004) [0x0000000000000000]              
	TArray< struct FVector >                           PathArray;                                        		// 0x09B0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      ChrType;                                          		// 0x09BC (0x0004) [0x0000000000000000]              
	class USGS_DBMainMenu*                             MenuMovie;                                        		// 0x09C0 (0x0004) [0x0000000000000000]              
	float                                              LastHitSoundTime;                                 		// 0x09C4 (0x0004) [0x0000000000000000]              
	float                                              LastDeathTime;                                    		// 0x09C8 (0x0004) [0x0000000000000000]              
	class UMaterialEffect*                             DeathEffect;                                      		// 0x09CC (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   DeathEffectMaterialInstance;                      		// 0x09D0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class USoundCue*                                   ChargingSound;                                    		// 0x09D4 (0x0004) [0x0000000000000000]              
	unsigned char                                      RollDir;                                          		// 0x09D8 (0x0001) [0x0000000000000000]              
	float                                              VaultHeight;                                      		// 0x09DC (0x0004) [0x0000000000000000]              
	struct FVector                                     VaultNormal;                                      		// 0x09E0 (0x000C) [0x0000000000000000]              
	class ASGS_Garage*                                 CurrentGarage;                                    		// 0x09EC (0x0004) [0x0000000000000000]              
	class APawn*                                       MyKiller;                                         		// 0x09F0 (0x0004) [0x0000000000000000]              
	class UTextureRenderTarget2D*                      FreezeTex;                                        		// 0x09F4 (0x0004) [0x0000000000000000]              
	int                                                CameraIndex;                                      		// 0x09F8 (0x0004) [0x0000000000000000]              
	struct FVector                                     MaxCameraVelocity;                                		// 0x09FC (0x000C) [0x0000000000000000]              
	struct FName                                       DesiredSpawnArea;                                 		// 0x0A08 (0x0008) [0x0000000000000000]              
	int                                                TeamSelectionIndex;                               		// 0x0A10 (0x0004) [0x0000000000000000]              
	float                                              LastAttackTime;                                   		// 0x0A14 (0x0004) [0x0000000000000000]              
	float                                              LastAltAttackTime;                                		// 0x0A18 (0x0004) [0x0000000000000000]              
	float                                              LastJumpTime;                                     		// 0x0A1C (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 49828 ];

		return pClassPointer;
	};

	void SpeakTTS ( struct FString S, class APlayerReplicationInfo* PRI );
	bool PerformedUseAction ( );
	void ServerPickupWeapon ( class ASGDroppedPickup* P );
	void SGSChangeSeat ( );
	void ServerGiveCredits ( int ParameterA );
	void DoItUp ( );
	void ClientOpenBarracksMenu ( );
	void ClientOpenArmoryMenu ( );
	void ClientOpenGarageMenu ( );
	void eventDestroyed ( );
	class ASGS_BuyStation* FindBuyStation ( );
	void ClientUpdatePunches ( int WeaponBitMask );
	void ClientUpdateVehicles ( int WeaponBitMask );
	void ClientUpdateMacGuyver ( int WeaponBitMask );
	bool PickupWeapon ( );
	class ASGS_PowerGenerator* FindGenerator ( );
	bool FindVehicleToDrive ( );
	bool FindMechToDrive ( );
	void DoPathing ( );
	void ClientShowPath ( );
	void StopRolling ( );
	void ServerUseHardDevice ( );
	void UseHardDevice ( );
	void eventGetPlayerViewPoint ( struct FVector* POVLocation, struct FRotator* POVRotation );
	void StopTaunt ( );
	void Taunt ( int TauntIndex );
	void FOV ( float F );
	bool FreeRoam ( );
	bool SlowDownCamera ( );
	bool SpeedUpCamera ( );
	bool CycleCamera ( );
	bool SpecZoomOut ( );
	bool SpecZoomIn ( );
	bool SlowMotion ( );
	void ThrowGrenade ( );
	void SetHand ( unsigned char NewWeaponHand );
	void SetBehindView ( unsigned long bNewBehindView );
	class APlayerReplicationInfo* SGSGetNextViewablePlayer ( int Dir );
	void CloseAllBuyMenus ( );
	void ShowDeathOptions ( );
	void AddLife ( );
	void ClientShowWaveIncoming ( );
	void ClientShowWaveCompleted ( );
	void ClientShowWaveTimer ( int TimeLeft );
	void DeathEffectTimer ( );
	void ProcessDriveMech ( float InForward, float InStrafe, float InUp, unsigned long InJump );
	void ServerDriveMech ( float InForward, float InStrafe, float aUp, unsigned long InJump, int View );
	void CheckJumpOrDuck ( );
	void PlayAnnouncement ( class UClass* InMessageClass, int MessageIndex, class APlayerReplicationInfo* PRI, class UObject* OptionalObject );
	void HeadshotMessage ( );
	void BullseyeMessage ( );
	void AcknowledgePossession ( class APawn* P );
	void PlayStartupMessage ( unsigned char StartupStage );
	bool eventNotifyHitWall ( struct FVector HitNormal, class AActor* Wall );
	void ProcessViewRotation ( float DeltaTime, struct FRotator DeltaRot, struct FRotator* out_ViewRotation );
	void UpdateRotation ( float DeltaTime );
	void SpectateOnServer ( );
	void ServerSpectate ( );
	void SetShowRespawnHud ( unsigned long bShow );
	void ServerTeamSelected ( int iTeam, int iClass, struct FString CharacterType );
	void ClientSelectTeam ( );
	void ClientShowHUD ( );
	void ClientSetChrType ( class UClass* Type );
	void SetCharacter ( struct FString inCharacter );
	void InitPlayerReplicationInfo ( );
	void ServerRadioMessage ( unsigned char T );
	bool SGSSwitchWeapon ( unsigned char T );
	void StopCharging ( );
	void OpenClassSelection ( );
	void ClientShowEndGame ( unsigned long bWinner );
	void ClientShowGameFull ( );
	void ClientShowLeaveGame ( );
	void ClientShowTeleportError ( int Seconds );
	void ClientShowDisconnect ( struct FString msg );
	void SuperJump ( );
	void ServerDoSuperJump ( );
	void CloseNotification ( );
	void ServerAddLife ( );
	void ServerSetTeamIndex ( int I );
	void SwitchWeapon ( unsigned char T );
	void ClientPlayTakeHit ( struct FVector HitLoc, unsigned char Damage, class UClass* DamageType );
	void ServerSubtractCredits ( int Amount );
	void eventClientPlaySound ( class USoundCue* ASound );
	void NotifyTakeHit ( class AController* InstigatedBy, struct FVector HitLocation, int Damage, class UClass* DamageType, struct FVector Momentum );
	void GiveDefaultInventory ( TArray< class UClass* > InitialItems );
	void SetMovie ( class USGS_DBMainMenu* newMenu );
	void JumpTimer ( );
	void ShowMeleeTip ( );
	void ShowPowerOffTip ( );
	void ShowBuyStationTip ( );
	void ShowSupplyStationTip ( );
	void ShowReloadTip ( );
	void ShowSeatChangeTip ( );
	void ShowGenTurnOnTip ( );
	struct FName GetKeyBinding ( struct FString Binding );
	void ShowCrouchTip ( );
	void ShowSkillTip ( );
	void ShowHudAwarenessTip ( );
	void ShowFireModeTip ( );
	void ShowRollTip ( );
	void ShowRadioTip ( );
	void ShowTeamChatTip ( );
	void ShowRandomTip ( );
	void eventPostBeginPlay ( );
	void ShowMoveTip ( );
	bool IsFlashing ( class AActor* A );
	void StopFlashing ( );
	void ServerThrowWeapon ( );
	void ThrowWeapon ( );
	void DropMoney ( );
	void eventPossess ( class APawn* inPawn, unsigned long bVehicleTransition );
};

UClass* ASGS_Controller_Player::pClassPointer = NULL;

// Class SGSOrion.SGS_StatsReadAchievements
// 0x0000 (0x0088 - 0x0088)
class USGS_StatsReadAchievements : public UOnlineStatsRead
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 49853 ];

		return pClassPointer;
	};

};

UClass* USGS_StatsReadAchievements::pClassPointer = NULL;

// Class SGSOrion.SGS_StatsWriteAchievements
// 0x0000 (0x0088 - 0x0088)
class USGS_StatsWriteAchievements : public UOnlineStatsWrite
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 49854 ];

		return pClassPointer;
	};

};

UClass* USGS_StatsWriteAchievements::pClassPointer = NULL;

// Class SGSOrion.SGS_Vehicle
// 0x017C (0x0C0C - 0x0A90)
class ASGS_Vehicle : public AUTVehicle
{
public:
	class UParticleSystem*                             TracerTemplate;                                   		// 0x0A90 (0x0004) [0x0000000000000000]              
	float                                              HowOftenToShowBulletTracer;                       		// 0x0A94 (0x0004) [0x0000000000000000]              
	float                                              ForceSpawnTracerIfTime;                           		// 0x0A98 (0x0004) [0x0000000000000000]              
	float                                              LastTracerTime;                                   		// 0x0A9C (0x0004) [0x0000000000000000]              
	struct FName                                       oldMaterial;                                      		// 0x0AA0 (0x0008) [0x0000000000000000]              
	float                                              StartDrivingTime;                                 		// 0x0AA8 (0x0004) [0x0000000000000000]              
	float                                              LastHateTimer;                                    		// 0x0AAC (0x0004) [0x0000000000000000]              
	class UParticleSystem*                             FXSandImpact;                                     		// 0x0AB0 (0x0004) [0x0000000000000000]              
	class UParticleSystem*                             FXConcreteImpact;                                 		// 0x0AB4 (0x0004) [0x0000000000000000]              
	class UParticleSystem*                             FXGlassImpact;                                    		// 0x0AB8 (0x0004) [0x0000000000000000]              
	class UParticleSystem*                             FXGrassImpact;                                    		// 0x0ABC (0x0004) [0x0000000000000000]              
	class UParticleSystem*                             FXMetalImpact;                                    		// 0x0AC0 (0x0004) [0x0000000000000000]              
	class UParticleSystem*                             FXRockImpact;                                     		// 0x0AC4 (0x0004) [0x0000000000000000]              
	class UParticleSystem*                             FXSnowImpact;                                     		// 0x0AC8 (0x0004) [0x0000000000000000]              
	class UParticleSystem*                             FXWoodImpact;                                     		// 0x0ACC (0x0004) [0x0000000000000000]              
	class UParticleSystem*                             FXFleshImpact;                                    		// 0x0AD0 (0x0004) [0x0000000000000000]              
	float                                              LastBulletImpactTime;                             		// 0x0AD4 (0x0004) [0x0000000000000000]              
	struct FVector                                     TurretFlashLocation;                              		// 0x0AD8 (0x000C) [0x0000000000000020]              ( CPF_Net )
	struct FRotator                                    TurretWeaponRotation;                             		// 0x0AE4 (0x000C) [0x0000000000000020]              ( CPF_Net )
	unsigned char                                      TurretFlashCount;                                 		// 0x0AF0 (0x0001) [0x0000000000000020]              ( CPF_Net )
	unsigned char                                      TurretFiringMode;                                 		// 0x0AF1 (0x0001) [0x0000000000000020]              ( CPF_Net )
	unsigned char                                      nSmokeEffect;                                     		// 0x0AF2 (0x0001) [0x0000000000000020]              ( CPF_Net )
	class UAudioComponent*                             AudioCmp;                                         		// 0x0AF4 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UAudioComponent*                             AudioCmpTurret;                                   		// 0x0AF8 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UAudioComponent*                             AudioCmpTurret1;                                  		// 0x0AFC (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	unsigned long                                      bHiddenVehicle : 1;                               		// 0x0B00 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bHitWithEMP : 1;                                  		// 0x0B00 (0x0004) [0x0000000000000020] [0x00000002] ( CPF_Net )
	unsigned long                                      bDirtEffectsOn : 1;                               		// 0x0B00 (0x0004) [0x0000000000000020] [0x00000004] ( CPF_Net )
	unsigned long                                      bBoostersActivated : 1;                           		// 0x0B00 (0x0004) [0x0000000000000020] [0x00000008] ( CPF_Net )
	unsigned long                                      bHoverVehicle : 1;                                		// 0x0B00 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bCanBoost : 1;                                    		// 0x0B00 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bSteeringLimited : 1;                             		// 0x0B00 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      bTryToBoost : 1;                                  		// 0x0B00 (0x0004) [0x0000000000000000] [0x00000080] 
	class UParticleSystemComponent*                    BoostComp1;                                       		// 0x0B04 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UParticleSystemComponent*                    BoostComp2;                                       		// 0x0B08 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UParticleSystemComponent*                    DamageSmokeComp;                                  		// 0x0B0C (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UParticleSystem*                             DamageSmokeEffect;                                		// 0x0B10 (0x0004) [0x0000000000000000]              
	class UParticleSystem*                             DamageFireEffect;                                 		// 0x0B14 (0x0004) [0x0000000000000000]              
	struct FString                                     VehicleName;                                      		// 0x0B18 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FMaterialImpactEffect                       DefaultImpactEffect;                              		// 0x0B24 (0x0030) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FMaterialImpactEffect                       DefaultAltImpactEffect;                           		// 0x0B54 (0x0030) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              DamageSmokeScale;                                 		// 0x0B84 (0x0004) [0x0000000000000000]              
	TArray< struct FVector >                           SeatHacks;                                        		// 0x0B88 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class USoundCue*                                   HitSound;                                         		// 0x0B94 (0x0004) [0x0000000000000000]              
	int                                                CreditScore;                                      		// 0x0B98 (0x0004) [0x0000000000000000]              
	float                                              FullWheelSuspensionTravel;                        		// 0x0B9C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              CrouchedWheelSuspensionTravel;                    		// 0x0BA0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              SuspensionTravelAdjustSpeed;                      		// 0x0BA4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              FullWheelSuspensionStiffness;                     		// 0x0BA8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              CrouchedWheelSuspensionStiffness;                 		// 0x0BAC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BoneOffsetZAdjust;                                		// 0x0BB0 (0x0004) [0x0000000000000000]              
	float                                              CrouchedAirSpeed;                                 		// 0x0BB4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              FullAirSpeed;                                     		// 0x0BB8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BoostJuice;                                       		// 0x0BBC (0x0004) [0x0000000000000020]              ( CPF_Net )
	float                                              BoostStartTime;                                   		// 0x0BC0 (0x0004) [0x0000000000000000]              
	float                                              BoostPowerSpeed;                                  		// 0x0BC4 (0x0004) [0x0000000000000000]              
	float                                              BoostReleaseTime;                                 		// 0x0BC8 (0x0004) [0x0000000000000000]              
	float                                              BoostReleaseDelay;                                		// 0x0BCC (0x0004) [0x0000000000000000]              
	float                                              BoosterFOVAngle;                                  		// 0x0BD0 (0x0004) [0x0000000000000000]              
	class UUTAnimBlendByWeapon*                        BoosterBlend;                                     		// 0x0BD4 (0x0004) [0x0000000000000000]              
	float                                              BoostUprightTorqueFactor;                         		// 0x0BD8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BoostUprightMaxTorque;                            		// 0x0BDC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BoostSteerFactors[ 0x3 ];                         		// 0x0BE0 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              BoosterForceMagnitude;                            		// 0x0BEC (0x0004) [0x0000000000000000]              
	float                                              LockSuspensionTravel;                             		// 0x0BF0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              LockSuspensionStiffness;                          		// 0x0BF4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              RocketSpeed;                                      		// 0x0BF8 (0x0004) [0x0000000000000000]              
	float                                              DefaultUprightTorqueFactor;                       		// 0x0BFC (0x0004) [0x0000000000000000]              
	float                                              DefaultUprightMaxTorque;                          		// 0x0C00 (0x0004) [0x0000000000000000]              
	int                                                SoundIndex;                                       		// 0x0C04 (0x0004) [0x0000000000000020]              ( CPF_Net )
	class UParticleSystemComponent*                    EMPEffect;                                        		// 0x0C08 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 51016 ];

		return pClassPointer;
	};

	bool InCombat ( );
	void UpdateLookSteerStatus ( );
	void UpdateHateTimer ( );
	void TurnEMPOff ( );
	void TurnEMPOn ( );
	void SetInputs ( float InForward, float InStrafe, float InUp );
	void EndEMP ( );
	void HitWithEMP ( );
	void SetBurnOut ( );
	void SitDriver ( class AUTPawn* UTP, int SeatIndex );
	bool PassengerEnter ( class APawn* P, int SeatIndex );
	void PassengerLeave ( int SeatIndex );
	bool ChangeSeat ( class AController* ControllerToMove, int RequestedSeat );
	bool TryToGetIn ( int SeatIndex, class APawn* P );
	bool eventDriverLeave ( unsigned long bForceLeave );
	void SetDirtEffects ( unsigned long bOn );
	void UpdateDirtParticles ( );
	void FixWheelParticlesPleaseEpic ( );
	void StopServerHandBrake ( );
	void ServerHandBrake ( );
	void SpawnTracer ( struct FVector EffectLocation, struct FVector HitLocation );
	void VehicleWeaponFireEffects ( struct FVector HitLocation, int SeatIndex );
	void Register ( );
	void PostBeginPlay ( );
	void StartSmokeEffect ( );
	void StartFireEffect ( );
	void StopEffects ( );
	void CheckDamageSmoke ( );
	void eventTakeDamage ( int Damage, class AController* EventInstigator, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
	void eventPostRenderFor ( class APlayerController* PC, class UCanvas* Canvas, struct FVector CameraPosition, struct FVector CameraDir );
	bool Died ( class AController* Killer, class UClass* DamageType, struct FVector HitLocation );
	void eventRanInto ( class AActor* Other );
	void VehicleCalcCamera ( float DeltaTime, int SeatIndex, unsigned long bPivotOnly, struct FVector* out_CamLoc, struct FRotator* out_CamRot, struct FVector* CamStart );
	void PancakeOther ( class APawn* Other );
	bool CanBoost ( );
	int NumSeatsOccupied ( );
	void eventTick ( float DeltaSeconds );
	void StopBoost ( );
	void Boost ( );
	void eventDeactivateRocketBoosters ( );
	void eventActivateRocketBoosters ( );
	void UnlockWheels ( );
	void LockWheels ( );
	void eventEnableFullSteering ( );
	void PlayBoostSound ( class USoundCue* Sound );
	bool PlaceExitingDriver ( class APawn* ExitingDriver );
	void ServerSetSoundIndex ( int Index );
	bool DriverEnter ( class APawn* P );
	void PlayTurretSound1 ( class USoundCue* Sound );
	void PlayTurretSound ( class USoundCue* Sound );
	void eventRigidBodyCollision ( class UPrimitiveComponent* HitComponent, class UPrimitiveComponent* OtherComponent, int ContactIndex, struct FCollisionImpactData* Collision );
	void eventReplicatedEvent ( struct FName VarName );
	void VehicleWeaponImpactEffects ( struct FVector HitLocation, int SeatIndex );
	bool eventEncroachingOn ( class AActor* Other );
};

UClass* ASGS_Vehicle::pClassPointer = NULL;

// Class SGSOrion.SGS_GFXHud
// 0x02B4 (0x04BC - 0x0208)
class USGS_GFXHud : public USGGfxHud
{
public:
	class UGFxObject*                                  scrHud;                                           		// 0x0208 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  HudMC;                                            		// 0x020C (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  ScrCharacter;                                     		// 0x0210 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  scrScoreBoard;                                    		// 0x0214 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  scrInGameTeamInfo;                                		// 0x0218 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  scrRespawn;                                       		// 0x021C (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  ObjThubContainer;                                 		// 0x0220 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  ScoreTeam1;                                       		// 0x0224 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  ScoreTeam2;                                       		// 0x0228 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  HealthMC;                                         		// 0x022C (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  TF_TotalAmmo;                                     		// 0x0230 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  TF_AmmoInClip;                                    		// 0x0234 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  BulletCount_MC;                                   		// 0x0238 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  SkillBarMC;                                       		// 0x023C (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  TF_carrierScore;                                  		// 0x0240 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  TF_altairScore;                                   		// 0x0244 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  TF_GunType;                                       		// 0x0248 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  TF_ShotType;                                      		// 0x024C (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  WeaponSelectMC;                                   		// 0x0250 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  ScoreMC;                                          		// 0x0254 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  TF_ScoreTotal;                                    		// 0x0258 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  TF_Score;                                         		// 0x025C (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  TF_ScoreEnemy;                                    		// 0x0260 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  ScoreCountMC;                                     		// 0x0264 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  ScoreCountEnemyMC;                                		// 0x0268 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  WeaponText;                                       		// 0x026C (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  WeaponType;                                       		// 0x0270 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  WeaponSelect;                                     		// 0x0274 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  WeaponBulletCount;                                		// 0x0278 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  WeaponGrenade;                                    		// 0x027C (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  WeaponAmmoPercent;                                		// 0x0280 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  WeaponAmmoCount;                                  		// 0x0284 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  CompassMC;                                        		// 0x0288 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  CompassDisplay;                                   		// 0x028C (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  MatchMC;                                          		// 0x0290 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  MatchWinningScore;                                		// 0x0294 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  MatchYourTeamScore;                               		// 0x0298 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  MatchEnemyTeamScore;                              		// 0x029C (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  MatchCreditScore;                                 		// 0x02A0 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  TimerMC;                                          		// 0x02A4 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  TimerText;                                        		// 0x02A8 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  TextHealth;                                       		// 0x02AC (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  TextShield;                                       		// 0x02B0 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  WeaponImageSlots[ 0x3 ];                          		// 0x02B4 (0x000C) [0x0000000000000000]              
	class UGFxObject*                                  MatchWinningText;                                 		// 0x02C0 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  MatchYourTeamText;                                		// 0x02C4 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  MatchEnemyTeamText;                               		// 0x02C8 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  MatchCreditText;                                  		// 0x02CC (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  SquadMC[ 0x8 ];                                   		// 0x02D0 (0x0020) [0x0000000000000000]              
	class UGFxObject*                                  RadarMC;                                          		// 0x02F0 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  AwarenessMC;                                      		// 0x02F4 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  HealthBars[ 0xA ];                                		// 0x02F8 (0x0028) [0x0000000000000000]              
	class UGFxObject*                                  ShieldBars[ 0xA ];                                		// 0x0320 (0x0028) [0x0000000000000000]              
	class UGFxObject*                                  CrosshairMC;                                      		// 0x0348 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  CrosshairMC2;                                     		// 0x034C (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  MessageMC;                                        		// 0x0350 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  MessageTextMC[ 0x3 ];                             		// 0x0354 (0x000C) [0x0000000000000000]              
	class UGFxObject*                                  EnergyMC;                                         		// 0x0360 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  AwarenessTeamMC;                                  		// 0x0364 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  AwarenessEnemyMC;                                 		// 0x0368 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  AwarenessDinoMC;                                  		// 0x036C (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  AwarenessSquadMC;                                 		// 0x0370 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  AwarnessBaseMC;                                   		// 0x0374 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  DamageMC;                                         		// 0x0378 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  PlayerTextMC;                                     		// 0x037C (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  PlayerTextMC2;                                    		// 0x0380 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  MessageMC2;                                       		// 0x0384 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  ObjectiveMC;                                      		// 0x0388 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  ObjectiveMC2[ 0x5 ];                              		// 0x038C (0x0014) [0x0000000000000000]              
	class UGFxObject*                                  KillAssistMC;                                     		// 0x03A0 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  HealAmountMC;                                     		// 0x03A4 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  TimerBars;                                        		// 0x03A8 (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  ScopeMC;                                          		// 0x03AC (0x0004) [0x0000000000000000]              
	class UGFxObject*                                  WeaponTotalAmmoCount;                             		// 0x03B0 (0x0004) [0x0000000000000000]              
	TArray< class UGFxObject* >                        aObjThubs;                                        		// 0x03B4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FMatrix                                     IconMatrix;                                       		// 0x03C0 (0x0040) [0x0000000000000000]              
	float                                              TipTime;                                          		// 0x0400 (0x0004) [0x0000000000000000]              
	unsigned long                                      bTipOpen : 1;                                     		// 0x0404 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bSkillBarVisible : 1;                             		// 0x0404 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bScoreBoardVisible : 1;                           		// 0x0404 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bShowObjectives : 1;                              		// 0x0404 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bTurnAwarenessOn : 1;                             		// 0x0404 (0x0004) [0x0000000000000000] [0x00000010] 
	struct FString                                     sKillAssistMsg;                                   		// 0x0408 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              LastKillAssistTime;                               		// 0x0414 (0x0004) [0x0000000000000000]              
	unsigned char                                      CarrierTeamIndex;                                 		// 0x0418 (0x0001) [0x0000000000000000]              
	unsigned char                                      AltairTeamIndex;                                  		// 0x0419 (0x0001) [0x0000000000000000]              
	unsigned char                                      LastArmor;                                        		// 0x041A (0x0001) [0x0000000000000000]              
	float                                              LastDamageTime;                                   		// 0x041C (0x0004) [0x0000000000000000]              
	float                                              LastEnergy;                                       		// 0x0420 (0x0004) [0x0000000000000000]              
	TArray< class ASG_KeyPad* >                        aKeyPads;                                         		// 0x0424 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              MouseTimer;                                       		// 0x0430 (0x0004) [0x0000000000000000]              
	TArray< struct FAwarenessInfo >                    AwarenessItems;                                   		// 0x0434 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class USoundCue*                                   CarriersCue;                                      		// 0x0440 (0x0004) [0x0000000000000000]              
	class USoundCue*                                   AltairCue;                                        		// 0x0444 (0x0004) [0x0000000000000000]              
	class USoundCue*                                   SpectatorCue;                                     		// 0x0448 (0x0004) [0x0000000000000000]              
	class USoundCue*                                   AssaultCue;                                       		// 0x044C (0x0004) [0x0000000000000000]              
	class USoundCue*                                   SupportCue;                                       		// 0x0450 (0x0004) [0x0000000000000000]              
	class USoundCue*                                   ReconCue;                                         		// 0x0454 (0x0004) [0x0000000000000000]              
	class USoundCue*                                   WarriorCue;                                       		// 0x0458 (0x0004) [0x0000000000000000]              
	class USoundCue*                                   RukanCue;                                         		// 0x045C (0x0004) [0x0000000000000000]              
	class USoundCue*                                   WraithCue;                                        		// 0x0460 (0x0004) [0x0000000000000000]              
	class USoundCue*                                   HudAwarnessOpen;                                  		// 0x0464 (0x0004) [0x0000000000000000]              
	class USoundCue*                                   HudAwarnessClose;                                 		// 0x0468 (0x0004) [0x0000000000000000]              
	class USoundCue*                                   HudAwarnessObjectiveAddedDialogue;                		// 0x046C (0x0004) [0x0000000000000000]              
	class USoundCue*                                   HudAwarnessObjectiveAddedTick;                    		// 0x0470 (0x0004) [0x0000000000000000]              
	struct USGS_GFXHud_FScoreboardState                Score;                                            		// 0x0474 (0x0024) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FTeamScoreState                             ScoreState;                                       		// 0x0498 (0x000C) [0x0000000000000000]              
	TArray< struct FObjectiveDesc >                    aObjectiveDesc;                                   		// 0x04A4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FHudMessage >                       aHudMessages;                                     		// 0x04B0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 51175 ];

		return pClassPointer;
	};

	void Show_RespawnTime ( int Time );
	void UpdateObjectives ( );
	class UGFxObject* AddObjective ( struct FString Caption, class AActor* Owner, struct FVector pos, class UTexture2D* Tex );
	void UpdateObjThubPos ( class UCanvas* Canvas );
	void ToggleInGameTeamInfo ( );
	void UpdateScoreBoard ( );
	bool IsValidScoreboardPlayer ( class AUTPlayerReplicationInfo* PRI );
	void UpdateScore ( );
	void HideScoreBoard ( );
	void ShowScoreboard ( );
	class ATeamInfo* GetTeamInfo ( unsigned long MyTeam );
	class ATeamInfo* GetAltairTeam ( );
	class ATeamInfo* GetCarrierTeam ( );
	bool IsChangeTeamOrClassVisible ( );
	void ShowClassSelection ( );
	void ShowTeamSelection ( );
	void ChangeClass ( int iTeam, int iClass );
	void SetSpectatorMode ( );
	void HideToolTip ( );
	void ShowToolTip ( );
	void SkillBar_Hide ( );
	void SkillBar_Update ( int Percent );
	void Objetive_UpdatePos ( class UCanvas* Canvas );
	void UpdateHealth ( );
	void UpdateHitDamage ( );
	bool Update_WeaponIcons ( );
	void Weapon_UpdateFiringMode ( class ASGWeapon* Weapon );
	struct FASColorTransform StringToColor ( struct FString S );
	void ReceiveLocalMessage ( struct FString msg, float T );
	void ReceiveKillAssistMessage ( struct FString msg );
	void SetCrossHairHidden ( unsigned long Hidden );
	void HideScope ( );
	void ShowScope ( );
	void UpdateVehicleWeapon ( );
	void Weapon_SetSelected ( class ASGWeapon* Weapon );
	void UnHideud ( );
	void HideHUD ( );
	void Update_AmmoCount ( );
	void UpdateWeapon ( );
	void UpdateMouse ( );
	void UpdateGrenades ( );
	void UpdateMessages ( );
	void UpdateEnergy ( );
	void SetMiniGun ( int I );
	void UpdateCrossHair ( );
	void UpdateMissionObjectives ( );
	void UpdateHealAmount ( );
	void UpdateTimerBars ( );
	void TickHud ( class UCanvas* Canvas );
	void UpdatePlayerText ( );
	void UpdateCompass ( );
	void UpdateTimer ( );
	void Hud_TurnOn ( unsigned long bTurnOn, unsigned long bFull );
	bool UpdateHUD ( );
	void SetMiniMapMode ( unsigned long bLarge );
	void UpdatePlayerIcons ( class UCanvas* Canvas );
	void UnRegisterHudActor ( class AActor* Actor );
	void RegisterHudActor ( class AActor* A, struct FString Type );
	void UpdateFreezeCam ( class UCanvas* Canvas );
	void DisplayHit ( struct FVector HitDir, float Damage );
	void ShowTutorialTip ( struct FString Tip );
	void Init ( class ULocalPlayer* LocPlay );
};

UClass* USGS_GFXHud::pClassPointer = NULL;

// Class SGSOrion.SGS_HUD
// 0x0040 (0x0AD0 - 0x0A90)
class ASGS_HUD : public ASGHUD
{
public:
	float                                              RadioOpenTime;                                    		// 0x0A90 (0x0004) [0x0000000000000000]              
	unsigned long                                      bRadioOpen : 1;                                   		// 0x0A94 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bRadioOpen2 : 1;                                  		// 0x0A94 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bShowTeamSelection : 1;                           		// 0x0A94 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bShowCarrierClassSelection : 1;                   		// 0x0A94 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bShowAltairClassSelection : 1;                    		// 0x0A94 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bWaitingForRespawn : 1;                           		// 0x0A94 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bShowDeathOptions : 1;                            		// 0x0A94 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      bShowSpawnLocations : 1;                          		// 0x0A94 (0x0004) [0x0000000000000000] [0x00000080] 
	unsigned long                                      bShowDinoClassSelection : 1;                      		// 0x0A94 (0x0004) [0x0000000000000000] [0x00000100] 
	unsigned long                                      bShowBuyTradeMenu : 1;                            		// 0x0A94 (0x0004) [0x0000000000000000] [0x00000200] 
	unsigned long                                      bShowArmoryUpgrades : 1;                          		// 0x0A94 (0x0004) [0x0000000000000000] [0x00000400] 
	unsigned long                                      bShowArmoryWeaponUpgrades : 1;                    		// 0x0A94 (0x0004) [0x0000000000000000] [0x00000800] 
	unsigned long                                      bShowArmoryWeaponPurchases : 1;                   		// 0x0A94 (0x0004) [0x0000000000000000] [0x00001000] 
	unsigned long                                      bShowArmoryWeaponSidearm : 1;                     		// 0x0A94 (0x0004) [0x0000000000000000] [0x00002000] 
	unsigned long                                      bShowArmoryWeaponSecondary : 1;                   		// 0x0A94 (0x0004) [0x0000000000000000] [0x00004000] 
	unsigned long                                      bShowArmoryWeaponPrimary : 1;                     		// 0x0A94 (0x0004) [0x0000000000000000] [0x00008000] 
	unsigned long                                      bShowArmoryWeaponGrenades : 1;                    		// 0x0A94 (0x0004) [0x0000000000000000] [0x00010000] 
	unsigned long                                      bShowGarageVehicles : 1;                          		// 0x0A94 (0x0004) [0x0000000000000000] [0x00020000] 
	unsigned long                                      bShowBarracksUpgrades : 1;                        		// 0x0A94 (0x0004) [0x0000000000000000] [0x00040000] 
	unsigned long                                      bShowBarracksAbilityUpgrades : 1;                 		// 0x0A94 (0x0004) [0x0000000000000000] [0x00080000] 
	unsigned long                                      bShowBarracksPlayerUpgrades : 1;                  		// 0x0A94 (0x0004) [0x0000000000000000] [0x00100000] 
	unsigned long                                      bShowBarracksPlayerJumpUpgrades : 1;              		// 0x0A94 (0x0004) [0x0000000000000000] [0x00200000] 
	unsigned long                                      bShowBarracksPlayerMeleeUpgrades : 1;             		// 0x0A94 (0x0004) [0x0000000000000000] [0x00400000] 
	unsigned long                                      bShowBarracksPlayerRollUpgrades : 1;              		// 0x0A94 (0x0004) [0x0000000000000000] [0x00800000] 
	unsigned long                                      bShowTradePlayerMenu : 1;                         		// 0x0A94 (0x0004) [0x0000000000000000] [0x01000000] 
	unsigned long                                      bAllowAltair : 1;                                 		// 0x0A94 (0x0004) [0x0000000000000000] [0x02000000] 
	unsigned long                                      bAllowDinos : 1;                                  		// 0x0A94 (0x0004) [0x0000000000000000] [0x04000000] 
	int                                                RespawnTime;                                      		// 0x0A98 (0x0004) [0x0000000000000000]              
	class USGS_DBMainMenu*                             PauseMenuMovie1;                                  		// 0x0A9C (0x0004) [0x0000000000000000]              
