/*
#############################################################################################
# Tron Evolution (1.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: GridGame_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function GridGame.PgAltConfig.LoadAltConfig
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UPgAltConfig_execLoadAltConfig_Parms
{
	struct FString                                     configName;                                       		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     altName;                                          		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function GridGame.PgDamageParamInterface.OnDamageCaused
// [0x00020400] ( FUNC_Native )
struct UPgDamageParamInterface_execOnDamageCaused_Parms
{
	int                                                damageCaused;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      damageVictim;                                     		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      DamageCauser;                                     		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgDamageParamInterface.GetCauseDamageParam
// [0x00020400] ( FUNC_Native )
struct UPgDamageParamInterface_execGetCauseDamageParam_Parms
{
	class UPgDamageParam*                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgEventTrackerInterface.ClearTrackedEvents
// [0x00020400] ( FUNC_Native )
struct UPgEventTrackerInterface_execClearTrackedEvents_Parms
{
};

// Function GridGame.PgEventTrackerInterface.GetTrackedEventInfo
// [0x00420400] ( FUNC_Native )
struct UPgEventTrackerInterface_execGetTrackedEventInfo_Parms
{
	struct FName                                       EventName;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FTrackedEventInfo                           Info;                                             		// 0x0008 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgEventTrackerInterface.CheckForTrackedEvent
// [0x00020400] ( FUNC_Native )
struct UPgEventTrackerInterface_execCheckForTrackedEvent_Parms
{
	struct FName                                       EventName;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgEventTrackerInterface.TrackEventByName
// [0x00024400] ( FUNC_Native )
struct UPgEventTrackerInterface_execTrackEventByName_Parms
{
	struct FName                                       EventName;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitNormal;                                        		// 0x0008 (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function GridGame.PgGridProfileSettings.HasCompletedAchievement
// [0x00020802] ( FUNC_Event )
struct UPgGridProfileSettings_eventHasCompletedAchievement_Parms
{
	unsigned char                                      AchievementId;                                    		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             ProfileId;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             CompletionMaskValue;                              		// 0x000C (0x0004) [0x0000000000000000]              
	// unsigned long                                   bResult : 1;                                      		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GridGame.PgGridProfileSettings.MarkAchievementAsCompleted
// [0x00024802] ( FUNC_Event )
struct UPgGridProfileSettings_eventMarkAchievementAsCompleted_Parms
{
	unsigned char                                      AchievementId;                                    		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class APgPlayerController*                         GPC;                                              		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bSaveProfile : 1;                                 		// 0x0008 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             ProfileId;                                        		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             CurrentCompletedAchievementMask;                  		// 0x0014 (0x0004) [0x0000000000000000]              
	// unsigned long                                   bResult : 1;                                      		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GridGame.PgGridProfileSettings.GetProfileSettingValueIdByName
// [0x00420002] 
struct UPgGridProfileSettings_execGetProfileSettingValueIdByName_Parms
{
	struct FName                                       SettingName;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                OutValue;                                         		// 0x0008 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// unsigned long                                   bResult : 1;                                      		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             SettingId;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function GridGame.PgGridProfileSettings.GetProfileSettingValueStringByName
// [0x00420002] 
struct UPgGridProfileSettings_execGetProfileSettingValueStringByName_Parms
{
	struct FName                                       SettingName;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     OutValue;                                         		// 0x0008 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// unsigned long                                   bResult : 1;                                      		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             SettingId;                                        		// 0x001C (0x0004) [0x0000000000000000]              
};

// Function GridGame.PgGridProfileSettings.GetProfileSettingValueFloatByName
// [0x00420002] 
struct UPgGridProfileSettings_execGetProfileSettingValueFloatByName_Parms
{
	struct FName                                       SettingName;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              OutValue;                                         		// 0x0008 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// unsigned long                                   bResult : 1;                                      		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             SettingId;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function GridGame.PgGridProfileSettings.GetProfileSettingValueIntByName
// [0x00420002] 
struct UPgGridProfileSettings_execGetProfileSettingValueIntByName_Parms
{
	struct FName                                       SettingName;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                OutValue;                                         		// 0x0008 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// unsigned long                                   bResult : 1;                                      		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             SettingId;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function GridGame.PgHud.ShowGammaCalibration
// [0x00024802] ( FUNC_Event )
struct APgHud_eventShowGammaCalibration_Parms
{
	unsigned long                                      show : 1;                                         		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	int                                                X;                                                		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                Y;                                                		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                Width;                                            		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                Height;                                           		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function GridGame.PgHud.PostRender
// [0x00020802] ( FUNC_Event )
struct APgHud_eventPostRender_Parms
{
	// float                                           FontWidth;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	// float                                           FontHeight;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	// float                                           YPos;                                             		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function GridGame.PgMaterialInstanceInterface.GetMaterialInstanceList
// [0x00020400] ( FUNC_Native )
struct UPgMaterialInstanceInterface_execGetMaterialInstanceList_Parms
{
	TArray< class UMaterialInstanceConstant* >         ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function GridGame.PgMaterialInstanceInterface.InitMaterialInstanceList
// [0x00020400] ( FUNC_Native )
struct UPgMaterialInstanceInterface_execInitMaterialInstanceList_Parms
{
};

// Function GridGame.PgPlugInInterface.PlugIns
// [0x00424405] ( FUNC_Final | FUNC_Native )
struct UPgPlugInInterface_execPlugIns_Parms
{
	class UPgActorPlugIn*                              PlugIn;                                           		// 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	class UClass*                                      BaseClass;                                        		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function GridGame.PgPlugInInterface.TriggerInputPlugIns
// [0x00020400] ( FUNC_Native )
struct UPgPlugInInterface_execTriggerInputPlugIns_Parms
{
	unsigned long                                      pressed : 1;                                      		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FName                                       Button;                                           		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgPlugInInterface.SyncClientPlugIns
// [0x00020500] ( FUNC_Native )
struct UPgPlugInInterface_execSyncClientPlugIns_Parms
{
};

// Function GridGame.PgPlugInInterface.SyncServerPlugIns
// [0x00220CC0] ( FUNC_Event | FUNC_Native )
struct UPgPlugInInterface_eventSyncServerPlugIns_Parms
{
	int                                                plugInRep;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgPlugInInterface.GetConditionalPlugInField
// [0x00020400] ( FUNC_Native )
struct UPgPlugInInterface_execGetConditionalPlugInField_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgPlugInInterface.SetConditionalPlugInField
// [0x00020400] ( FUNC_Native )
struct UPgPlugInInterface_execSetConditionalPlugInField_Parms
{
	int                                                plugInRep;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgSimpleMenuMovie.Start
// [0x00024C00] ( FUNC_Event | FUNC_Native )
struct UPgSimpleMenuMovie_eventStart_Parms
{
	unsigned long                                      StartPaused : 1;                                  		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgTargetableInterface.CanTarget
// [0x00020400] ( FUNC_Native )
struct UPgTargetableInterface_execCanTarget_Parms
{
	class APawn*                                       thePawn;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgTargetableInterface.GetMaxTargetableDist
// [0x00020400] ( FUNC_Native )
struct UPgTargetableInterface_execGetMaxTargetableDist_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgTargetableInterface.GetMinTargetableDist
// [0x00020400] ( FUNC_Native )
struct UPgTargetableInterface_execGetMinTargetableDist_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgActorPlugIn.Detach
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugIn_execDetach_Parms
{
};

// Function GridGame.PgActorPlugIn.Deactivate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugIn_execDeactivate_Parms
{
};

// Function GridGame.PgActorPlugIn.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugIn_execActivate_Parms
{
};

// Function GridGame.PgActorPlugIn.OnDeactivate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugIn_execOnDeactivate_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgActorPlugIn.OnActivate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugIn_execOnActivate_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgActorPlugInActorFactory.Deactivate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInActorFactory_execDeactivate_Parms
{
};

// Function GridGame.PgActorPlugInActorFactory.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInActorFactory_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInAkSetState.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInAkSetState_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInAkSetSwitch.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInAkSetSwitch_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInComponent.Deactivate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInComponent_execDeactivate_Parms
{
};

// Function GridGame.PgActorPlugInComponent.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInComponent_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInConditional.Deactivate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInConditional_execDeactivate_Parms
{
};

// Function GridGame.PgActorPlugInConditional.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInConditional_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInConditional.Detach
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInConditional_execDetach_Parms
{
};

// Function GridGame.PgActorPlugInEmitter.Deactivate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInEmitter_execDeactivate_Parms
{
};

// Function GridGame.PgActorPlugInEmitter.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInEmitter_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInBeamTrailEmitter.Deactivate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInBeamTrailEmitter_execDeactivate_Parms
{
};

// Function GridGame.PgActorPlugInBeamTrailEmitter.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInBeamTrailEmitter_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInFireSideEffect.Deactivate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInFireSideEffect_execDeactivate_Parms
{
};

// Function GridGame.PgActorPlugInFireSideEffect.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInFireSideEffect_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInLightWall.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInLightWall_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInMaterialParam.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInMaterialParam_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInModifyCameraScore.Deactivate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInModifyCameraScore_execDeactivate_Parms
{
};

// Function GridGame.PgActorPlugInModifyCameraScore.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInModifyCameraScore_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInModifyProperty.Deactivate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInModifyProperty_execDeactivate_Parms
{
};

// Function GridGame.PgActorPlugInModifyProperty.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInModifyProperty_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInPhysMatEffect.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInPhysMatEffect_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInResetFreeCamera.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInResetFreeCamera_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInSeqAction.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInSeqAction_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInSetCameraStyle.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInSetCameraStyle_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInSetMaterial.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInSetMaterial_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInSetPhysics.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInSetPhysics_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInSetSkeletalMesh.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInSetSkeletalMesh_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInSound.Deactivate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInSound_execDeactivate_Parms
{
};

// Function GridGame.PgActorPlugInSound.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInSound_execActivate_Parms
{
};

// Function GridGame.PgActorPlugInTakeDamage.Activate
// [0x00020400] ( FUNC_Native )
struct UPgActorPlugInTakeDamage_execActivate_Parms
{
};

// Function GridGame.PgPawnPlugInSpecialMove.Deactivate
// [0x00020400] ( FUNC_Native )
struct UPgPawnPlugInSpecialMove_execDeactivate_Parms
{
};

// Function GridGame.PgPawnPlugInSpecialMove.Activate
// [0x00020400] ( FUNC_Native )
struct UPgPawnPlugInSpecialMove_execActivate_Parms
{
};

// Function GridGame.PgPawnPlugInVehicle.Activate
// [0x00020400] ( FUNC_Native )
struct UPgPawnPlugInVehicle_execActivate_Parms
{
};

// Function GridGame.PgPlayerPlugInLockOn.SetLockTarget
// [0x00020400] ( FUNC_Native )
struct UPgPlayerPlugInLockOn_execSetLockTarget_Parms
{
	unsigned long                                      lockTarget : 1;                                   		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function GridGame.PgPlayerPlugInLockOn.Deactivate
// [0x00020400] ( FUNC_Native )
struct UPgPlayerPlugInLockOn_execDeactivate_Parms
{
};

// Function GridGame.PgPlayerPlugInLockOn.Activate
// [0x00020400] ( FUNC_Native )
struct UPgPlayerPlugInLockOn_execActivate_Parms
{
};

// Function GridGame.PgPlayerPlugInLockOn.SetTargetScan
// [0x00024400] ( FUNC_Native )
struct UPgPlayerPlugInLockOn_execSetTargetScan_Parms
{
	unsigned char                                      targetScan;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	float                                              targetScanAngle;                                  		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function GridGame.PgPlayerPlugInLockOn.SwitchTarget
// [0x00020400] ( FUNC_Native )
struct UPgPlayerPlugInLockOn_execSwitchTarget_Parms
{
};

// Function GridGame.PgPlayerPlugInLockOn.GetTargets
// [0x00420400] ( FUNC_Native )
struct UPgPlayerPlugInLockOn_execGetTargets_Parms
{
	TArray< class AActor* >                            Targets;                                          		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function GridGame.PgPlayerPlugInLockOn.GetTarget
// [0x00024400] ( FUNC_Native )
struct UPgPlayerPlugInLockOn_execGetTarget_Parms
{
	class UClass*                                      TargetClass;                                      		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class AActor*                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgPlayerPlugInLockOn.DisplayDebug
// [0x00020400] ( FUNC_Native )
struct UPgPlayerPlugInLockOn_execDisplayDebug_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgPlayerPlugInTargetSelector.SetLockTarget
// [0x00020400] ( FUNC_Native )
struct UPgPlayerPlugInTargetSelector_execSetLockTarget_Parms
{
	unsigned long                                      lockTarget : 1;                                   		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function GridGame.PgPlugInList.Detach
// [0x00020400] ( FUNC_Native )
struct UPgPlugInList_execDetach_Parms
{
};

// Function GridGame.PgPlugInList.Deactivate
// [0x00020400] ( FUNC_Native )
struct UPgPlugInList_execDeactivate_Parms
{
};

// Function GridGame.PgPlugInList.Activate
// [0x00020400] ( FUNC_Native )
struct UPgPlugInList_execActivate_Parms
{
};

// Function GridGame.PgDynamicSMActor.Bump
// [0x00020802] ( FUNC_Event )
struct APgDynamicSMActor_eventBump_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UPrimitiveComponent*                         OtherComp;                                        		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FVector                                     HitNormal;                                        		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgDynamicSMActor.Touch
// [0x00020802] ( FUNC_Event )
struct APgDynamicSMActor_eventTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UPrimitiveComponent*                         OtherComp;                                        		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitNormal;                                        		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgDynamicSMActor.TouchDamage
// [0x00020400] ( FUNC_Native )
struct APgDynamicSMActor_execTouchDamage_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitNormal;                                        		// 0x0010 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgDynamicSMActor.Detach
// [0x00020800] ( FUNC_Event )
struct APgDynamicSMActor_eventDetach_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgDynamicSMActor.Attach
// [0x00020800] ( FUNC_Event )
struct APgDynamicSMActor_eventAttach_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgDynamicSMActor.PostBeginPlay
// [0x00020802] ( FUNC_Event )
struct APgDynamicSMActor_eventPostBeginPlay_Parms
{
};

// Function GridGame.PgDynamicSMActor.PreBeginPlay
// [0x00020802] ( FUNC_Event )
struct APgDynamicSMActor_eventPreBeginPlay_Parms
{
};

// Function GridGame.PgDynamicSMActor.OnDamageCaused
// [0x00020400] ( FUNC_Native )
struct APgDynamicSMActor_execOnDamageCaused_Parms
{
	int                                                damageCaused;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      damageVictim;                                     		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      DamageCauser;                                     		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgDynamicSMActor.GetCauseDamageParam
// [0x00020400] ( FUNC_Native )
struct APgDynamicSMActor_execGetCauseDamageParam_Parms
{
	class UPgDamageParam*                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgPathNode.IsUsableAnchorFor
// [0x00020400] ( FUNC_Native )
struct APgPathNode_execIsUsableAnchorFor_Parms
{
	class APawn*                                       P;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgRallyPoint.GenericToggle
// [0x00020102] 
struct APgRallyPoint_execGenericToggle_Parms
{
};

// Function GridGame.PgRallyPoint.OnToggle
// [0x00020102] 
struct APgRallyPoint_execOnToggle_Parms
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgRallyPoint.UpdatePawnCounts
// [0x00020400] ( FUNC_Native )
struct APgRallyPoint_execUpdatePawnCounts_Parms
{
};

// Function GridGame.PgRallyPoint.GetAllRallyPointActors
// [0x00420400] ( FUNC_Native )
struct APgRallyPoint_execGetAllRallyPointActors_Parms
{
	TArray< class AActor* >                            rallyPointActors;                                 		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function GridGame.PgRallyPoint.IsValidRallyPoint
// [0x00020400] ( FUNC_Native )
struct APgRallyPoint_execIsValidRallyPoint_Parms
{
	class APgAIController*                             Controller;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgPedestrianSpawnPoint.OnToggle
// [0x00020102] 
struct APgPedestrianSpawnPoint_execOnToggle_Parms
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgAIController.Restart
// [0x00020002] 
struct APgAIController_execRestart_Parms
{
	unsigned long                                      bVehicleTransition : 1;                           		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function GridGame.PgAIController.CanFireWeapon
// [0x00020002] 
struct APgAIController_execCanFireWeapon_Parms
{
	class AWeapon*                                     Weap;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      FireModeNum;                                      		// 0x0004 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.PawnDied
// [0x00020002] 
struct APgAIController_execPawnDied_Parms
{
	class APawn*                                       inPawn;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgAIController.Tick
// [0x00020802] ( FUNC_Event )
struct APgAIController_eventTick_Parms
{
	float                                              Delta;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgAIController.DisplayDebug
// [0x00420102] 
struct APgAIController_execDisplayDebug_Parms
{
	class AHUD*                                        HUD;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              out_YL;                                           		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              out_YPos;                                         		// 0x0008 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	// class UCanvas*                                  Canvas;                                           		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function GridGame.PgAIController.ReceiveProjectileWarning
// [0x00820002] 
struct APgAIController_execReceiveProjectileWarning_Parms
{
	class AProjectile*                                 Proj;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FVector                                  ViewLocation;                                     		// 0x0004 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 ViewRotation;                                     		// 0x0010 (0x000C) [0x0000000000000000]              
};

// Function GridGame.PgAIController.ReceiveWarning
// [0x00820002] 
struct APgAIController_execReceiveWarning_Parms
{
	class APawn*                                       shooter;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              projSpeed;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     FireDir;                                          		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// struct FVector                                  ViewLocation;                                     		// 0x0014 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 ViewRotation;                                     		// 0x0020 (0x000C) [0x0000000000000000]              
};

// Function GridGame.PgAIController.ReceiveFireWarning
// [0x00820002] 
struct APgAIController_execReceiveFireWarning_Parms
{
	class AActor*                                      shooter;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AWeapon*                                     FiredWeapon;                                      		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     FireDir;                                          		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// struct FVector                                  ViewLocation;                                     		// 0x0014 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 ViewRotation;                                     		// 0x0020 (0x000C) [0x0000000000000000]              
};

// Function GridGame.PgAIController.GetAdjustedAimFor
// [0x00820002] 
struct APgAIController_execGetAdjustedAimFor_Parms
{
	class AWeapon*                                     InWeapon;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     projStart;                                        		// 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    ReturnValue;                                      		// 0x0010 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FRotator                                 adjustedAim;                                      		// 0x001C (0x000C) [0x0000000000000000]              
	// class APgAIController*                          pgAI;                                             		// 0x0028 (0x0004) [0x0000000000000000]              
	// class APawn*                                    focusPawn;                                        		// 0x002C (0x0004) [0x0000000000000000]              
	// class UClass*                                   projectileClass;                                  		// 0x0030 (0x0004) [0x0000000000000000]              
};

// Function GridGame.PgAIController.NotifyLandedFromHighFall
// [0x00020800] ( FUNC_Event )
struct APgAIController_eventNotifyLandedFromHighFall_Parms
{
};

// Function GridGame.PgAIController.NotifyRagdollKnockdown
// [0x00020800] ( FUNC_Event )
struct APgAIController_eventNotifyRagdollKnockdown_Parms
{
};

// Function GridGame.PgAIController.NotifyKilled
// [0x00020002] 
struct APgAIController_execNotifyKilled_Parms
{
	class AController*                                 Killer;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AController*                                 Killed;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class APawn*                                       KilledPawn;                                       		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgAIController.NotifyTakeHit
// [0x00020000] 
struct APgAIController_execNotifyTakeHit_Parms
{
	class AController*                                 InstigatedBy;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                Damage;                                           		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Momentum;                                         		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgAIController.NotifyWeaponFiredShot
// [0x00020000] 
struct APgAIController_execNotifyWeaponFiredShot_Parms
{
	class AWeapon*                                     Weapon;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      FiringMode;                                       		// 0x0004 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgAIController.NotifyWeaponFinishedReloading
// [0x00020000] 
struct APgAIController_execNotifyWeaponFinishedReloading_Parms
{
};

// Function GridGame.PgAIController.NotifyWeaponFinishedFiring
// [0x00020000] 
struct APgAIController_execNotifyWeaponFinishedFiring_Parms
{
	class AWeapon*                                     W;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      FireMode;                                         		// 0x0004 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgAIController.NotifyWeaponFired
// [0x00020000] 
struct APgAIController_execNotifyWeaponFired_Parms
{
	class AWeapon*                                     W;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      FireMode;                                         		// 0x0004 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgAIController.Possess
// [0x00020802] ( FUNC_Event )
struct APgAIController_eventPossess_Parms
{
	class APawn*                                       aPawn;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bVehicleTransition : 1;                           		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function GridGame.PgAIController.PlayerAimingAt
// [0x00020800] ( FUNC_Event )
struct APgAIController_eventPlayerAimingAt_Parms
{
	class APawn*                                       aimer;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgAIController.FriendlyDied
// [0x00020800] ( FUNC_Event )
struct APgAIController_eventFriendlyDied_Parms
{
	class APawn*                                       friendly;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgAIController.PlayerNotVisible
// [0x00020800] ( FUNC_Event )
struct APgAIController_eventPlayerNotVisible_Parms
{
	class APawn*                                       Player;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgAIController.HearNoise
// [0x00024800] ( FUNC_Event )
struct APgAIController_eventHearNoise_Parms
{
	float                                              Loudness;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      NoiseMaker;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       NoiseType;                                        		// 0x0008 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function GridGame.PgAIController.EnemyNotVisible
// [0x00020802] ( FUNC_Event )
struct APgAIController_eventEnemyNotVisible_Parms
{
};

// Function GridGame.PgAIController.SeeMonster
// [0x00020802] ( FUNC_Event )
struct APgAIController_eventSeeMonster_Parms
{
	class APawn*                                       seenMonster;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgAIController.SeePlayer
// [0x00020802] ( FUNC_Event )
struct APgAIController_eventSeePlayer_Parms
{
	class APawn*                                       seenPlayer;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgAIController.NotifyLanded
// [0x00020802] ( FUNC_Event )
struct APgAIController_eventNotifyLanded_Parms
{
	struct FVector                                     HitNormal;                                        		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      FloorActor;                                       		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.NotifyBump
// [0x00020802] ( FUNC_Event )
struct APgAIController_eventNotifyBump_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitNormal;                                        		// 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class APawn*                                    OtherPawn;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
	// float                                           noiseLevel;                                       		// 0x0018 (0x0004) [0x0000000000000000]              
	// class APgPawn*                                  pgp;                                              		// 0x001C (0x0004) [0x0000000000000000]              
};

// Function GridGame.PgAIController.NotifyHitWall
// [0x00020800] ( FUNC_Event )
struct APgAIController_eventNotifyHitWall_Parms
{
	struct FVector                                     HitNormal;                                        		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Wall;                                             		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.OnCheckCondition
// [0x00020500] ( FUNC_Native )
struct APgAIController_execOnCheckCondition_Parms
{
	class UPgSeqAct_CheckCondition*                    inAction;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgAIController.Release
// [0x00020400] ( FUNC_Native )
struct APgAIController_execRelease_Parms
{
	class APgObjective*                                Obj;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgAIController.Claim
// [0x00020400] ( FUNC_Native )
struct APgAIController_execClaim_Parms
{
	class APgObjective*                                Obj;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgAIController.VehicleCourseCorrect
// [0x00020400] ( FUNC_Native )
struct APgAIController_execVehicleCourseCorrect_Parms
{
};

// Function GridGame.PgAIController.LeaveVehicle
// [0x00020400] ( FUNC_Native )
struct APgAIController_execLeaveVehicle_Parms
{
};

// Function GridGame.PgAIController.EnterVehicle
// [0x00020400] ( FUNC_Native )
struct APgAIController_execEnterVehicle_Parms
{
};

// Function GridGame.PgAIController.ShouldLeaveVehicle
// [0x00020400] ( FUNC_Native )
struct APgAIController_execShouldLeaveVehicle_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.ShouldEnterVehicle
// [0x00020400] ( FUNC_Native )
struct APgAIController_execShouldEnterVehicle_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.CanLeaveVehicle
// [0x00020400] ( FUNC_Native )
struct APgAIController_execCanLeaveVehicle_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.CanEnterVehicle
// [0x00020400] ( FUNC_Native )
struct APgAIController_execCanEnterVehicle_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.IsDriving
// [0x00020400] ( FUNC_Native )
struct APgAIController_execIsDriving_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.LeaveGame
// [0x00020400] ( FUNC_Native )
struct APgAIController_execLeaveGame_Parms
{
};

// Function GridGame.PgAIController.CanLeaveGame
// [0x00020400] ( FUNC_Native )
struct APgAIController_execCanLeaveGame_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.IsLeavingGame
// [0x00020400] ( FUNC_Native )
struct APgAIController_execIsLeavingGame_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.SetIsLeavingGame
// [0x00020400] ( FUNC_Native )
struct APgAIController_execSetIsLeavingGame_Parms
{
	unsigned long                                      Leaving : 1;                                      		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function GridGame.PgAIController.GetTarget
// [0x00020500] ( FUNC_Native )
struct APgAIController_execGetTarget_Parms
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.GetIncomingProjectile
// [0x00020400] ( FUNC_Native )
struct APgAIController_execGetIncomingProjectile_Parms
{
	class AProjectile*                                 ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.IsPedestrian
// [0x00020400] ( FUNC_Native )
struct APgAIController_execIsPedestrian_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.GetTeamSpawnOrder
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct APgAIController_execGetTeamSpawnOrder_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.GetTeamSpawnCount
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct APgAIController_execGetTeamSpawnCount_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.GetTeamIndex
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct APgAIController_execGetTeamIndex_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.IsFriendly
// [0x00020400] ( FUNC_Native )
struct APgAIController_execIsFriendly_Parms
{
	class AActor*                                      Target;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.ReadyToFire
// [0x00020400] ( FUNC_Native )
struct APgAIController_execReadyToFire_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.SetEnemy
// [0x00020400] ( FUNC_Native )
struct APgAIController_execSetEnemy_Parms
{
	class APawn*                                       newEnemy;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridGame.PgAIController.LineOfSightToEnemy
// [0x00020400] ( FUNC_Native )
struct APgAIController_execLineOfSightToEnemy_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.GetInvestigateMarker
// [0x00020400] ( FUNC_Native )
struct APgAIController_execGetInvestigateMarker_Parms
{
	class APgTargetMarker*                             ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.GetTargetMarkerFor
// [0x00020400] ( FUNC_Native )
struct APgAIController_execGetTargetMarkerFor_Parms
{
	class AActor*                                      Target;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class APgTargetMarker*                             ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.EndPlannerAnimation
// [0x00020400] ( FUNC_Native )
struct APgAIController_execEndPlannerAnimation_Parms
{
};

// Function GridGame.PgAIController.UnPauseAIController
// [0x00020400] ( FUNC_Native )
struct APgAIController_execUnPauseAIController_Parms
{
};

// Function GridGame.PgAIController.PauseAIController
// [0x00020400] ( FUNC_Native )
struct APgAIController_execPauseAIController_Parms
{
};

// Function GridGame.PgAIController.GetAIState
// [0x00020400] ( FUNC_Native )
struct APgAIController_execGetAIState_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIController.PostEvent
// [0x00024400] ( FUNC_Native )
struct APgAIController_execPostEvent_Parms
{
	struct FName                                       EventName;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       listName;                                         		// 0x0008 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function GridGame.PgAIAwareness.GetTargetMarkerFor
// [0x00020400] ( FUNC_Native )
struct UPgAIAwareness_execGetTargetMarkerFor_Parms
{
	class AActor*                                      Target;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class APgTargetMarker*                             ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIAwareness.SpawnTargetMarker
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UPgAIAwareness_execSpawnTargetMarker_Parms
{
	class AActor*                                      Target;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class APgTargetMarker*                             ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridGame.PgAIAwareness.GetRawAwarenessOfTarget
// [0x00020400] ( FUNC_Native )
struct UPgAIAwareness_execGetRawAwarenessOfTarget_Parms
{
	class AActor*                                      Target;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
