/*
#############################################################################################
# Tron Evolution (1.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: GridGame_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_INVALID_TEAM_ID                                    255
#define CONST_NUM_TEAM_COLORS                                    4
#define CONST_DEFAULT_3D_STRENGTH                                0.16f
#define CONST_STATS_COLUMN_DISCONNECTS                           7
#define CONST_STATS_COLUMN_GAMES_PLAYED                          6
#define CONST_STATS_COLUMN_POINTS                                5
#define CONST_STATS_COLUMN_ASSISTS                               4
#define CONST_STATS_COLUMN_DEATHS                                3

/*enum ESmartObjectUseAngleType
{
	ESOUAT_None                                        = 0,
	ESOUAT_SmartObject                                 = 1,
	ESOUAT_LineUp                                      = 2,
	ESOUAT_MAX                                         = 3
};*/

// Enum GridGame.PgSmartObject.ESmartObjectTarget
/*enum ESmartObjectTarget
{
	ESOT_Everyone                                      = 0,
	ESOT_Player                                        = 1,
	ESOT_AI                                            = 2,
	ESOT_MAX                                           = 3
};*/

// Enum GridGame.PgUnlockItem.eUnlockType
/*enum eUnlockType
{
	UNT_Invalid                                        = 0,
	UNT_Disc                                           = 1,
	UNT_DiscPower                                      = 2,
	UNT_Perk                                           = 3,
	UNT_Vehicle                                        = 4,
	UNT_Slot                                           = 5,
	UNT_PlayerUgrade                                   = 6,
	UNT_PlayerSkin                                     = 7,
	UNT_MAX                                            = 8
};*/

// Enum GridGame.PgUnlockItem.eUnlockState
/*enum eUnlockState
{
	UNS_Locked                                         = 0,
	UNS_RecentlyAvailable                              = 1,
	UNS_Available                                      = 2,
	UNS_RecentlyOwned                                  = 3,
	UNS_Owned                                          = 4,
	UNS_Disabled                                       = 5,
	UNS_MAX                                            = 6
};*/

// Enum GridGame.PgUnlockItemDisc.eUnlockDiscType
/*enum eUnlockDiscType
{
	UNDT_Invalid                                       = 0,
	UNDT_HeavyDisc                                     = 1,
	UNDT_StasisDisc                                    = 2,
	UNDT_BombDisc                                      = 3,
	UNDT_CorruptionDisc                                = 4,
	UNDT_MAX                                           = 5
};*/

// Enum GridGame.PgUnlockItemDiscPower.eDiscPowerType
/*enum eDiscPowerType
{
	UNPT_Invalid                                       = 0,
	UNPT_Active                                        = 1,
	UNPT_Passive                                       = 2,
	UNPT_MAX                                           = 3
};*/

// Enum GridGame.PgVehicle.DriverExitAction
/*enum DriverExitAction
{
	DEA_Leave                                          = 0,
	DEA_Hide                                           = 1,
	DEA_Destroy                                        = 2,
	DEA_MAX                                            = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class GridGame.GridEngine
// 0x0000 (0x0708 - 0x0708)
class UGridEngine : public UGameEngine
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1807 ];

		return pClassPointer;
	};

};

UClass* UGridEngine::pClassPointer = NULL;

// Class GridGame.GridMemcard
// 0x0000 (0x0040 - 0x0040)
class UGridMemcard : public USubsystem
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1808 ];

		return pClassPointer;
	};

};

UClass* UGridMemcard::pClassPointer = NULL;

// Class GridGame.InterpTrackCollision
// 0x0010 (0x006C - 0x005C)
class UInterpTrackCollision : public UInterpTrack
{
public:
	TArray< struct FCollisionTrackKey >                CollisionTrack;                                   		// 0x005C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bFireEventsWhenForwards : 1;                      		// 0x0068 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bFireEventsWhenBackwards : 1;                     		// 0x0068 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bFireEventsWhenJumpingForwards : 1;               		// 0x0068 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1809 ];

		return pClassPointer;
	};

};

UClass* UInterpTrackCollision::pClassPointer = NULL;

// Class GridGame.InterpTrackInstCollision
// 0x0008 (0x0044 - 0x003C)
class UInterpTrackInstCollision : public UInterpTrackInst
{
public:
	unsigned char                                      Action;                                           		// 0x003C (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      mCachedCollisionType;                             		// 0x003D (0x0001) [0x0000000000000000]              
	float                                              LastUpdatePosition;                               		// 0x0040 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1810 ];

		return pClassPointer;
	};

};

UClass* UInterpTrackInstCollision::pClassPointer = NULL;

// Class GridGame.PgAltConfig
// 0x0000 (0x003C - 0x003C)
class UPgAltConfig : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1811 ];

		return pClassPointer;
	};

	void LoadAltConfig ( struct FString configName, struct FString altName );
};

UClass* UPgAltConfig::pClassPointer = NULL;

// Class GridGame.PgCommonControllerInterface
// 0x0000 (0x003C - 0x003C)
class UPgCommonControllerInterface : public UInterface
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1812 ];

		return pClassPointer;
	};

};

UClass* UPgCommonControllerInterface::pClassPointer = NULL;

// Class GridGame.PgDamageCauserInterface
// 0x0000 (0x003C - 0x003C)
class UPgDamageCauserInterface : public UInterface
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1813 ];

		return pClassPointer;
	};

};

UClass* UPgDamageCauserInterface::pClassPointer = NULL;

// Class GridGame.PgDamageParamInterface
// 0x0000 (0x003C - 0x003C)
class UPgDamageParamInterface : public UInterface
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1814 ];

		return pClassPointer;
	};

	void OnDamageCaused ( int damageCaused, class AActor* damageVictim, class AActor* DamageCauser );
	class UPgDamageParam* GetCauseDamageParam ( );
};

UClass* UPgDamageParamInterface::pClassPointer = NULL;

// Class GridGame.PgDamageType
// 0x0000 (0x0088 - 0x0088)
class UPgDamageType : public UDamageType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1815 ];

		return pClassPointer;
	};

};

UClass* UPgDamageType::pClassPointer = NULL;

// Class GridGame.PgEventTrackerInterface
// 0x0000 (0x003C - 0x003C)
class UPgEventTrackerInterface : public UInterface
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1816 ];

		return pClassPointer;
	};

	void ClearTrackedEvents ( );
	bool GetTrackedEventInfo ( struct FName EventName, struct FTrackedEventInfo* Info );
	bool CheckForTrackedEvent ( struct FName EventName );
	void TrackEventByName ( struct FName EventName, struct FVector HitNormal );
};

UClass* UPgEventTrackerInterface::pClassPointer = NULL;

// Class GridGame.PgGridProfileSettings
// 0x0000 (0x008C - 0x008C)
class UPgGridProfileSettings : public UOnlineProfileSettings
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1817 ];

		return pClassPointer;
	};

	bool eventHasCompletedAchievement ( unsigned char AchievementId );
	bool eventMarkAchievementAsCompleted ( unsigned char AchievementId, class APgPlayerController* GPC, unsigned long bSaveProfile );
	bool GetProfileSettingValueIdByName ( struct FName SettingName, int* OutValue );
	bool GetProfileSettingValueStringByName ( struct FName SettingName, struct FString* OutValue );
	bool GetProfileSettingValueFloatByName ( struct FName SettingName, float* OutValue );
	bool GetProfileSettingValueIntByName ( struct FName SettingName, int* OutValue );
};

UClass* UPgGridProfileSettings::pClassPointer = NULL;

// Class GridGame.PgGridTypes
// 0x0000 (0x003C - 0x003C)
class UPgGridTypes : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1818 ];

		return pClassPointer;
	};

};

UClass* UPgGridTypes::pClassPointer = NULL;

// Class GridGame.PgHud
// 0x0018 (0x0490 - 0x0478)
class APgHud : public AHUD
{
public:
	unsigned long                                      mShowGammaCalibration : 1;                        		// 0x0478 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                mGammaX;                                          		// 0x047C (0x0004) [0x0000000000000000]              
	int                                                mGammaY;                                          		// 0x0480 (0x0004) [0x0000000000000000]              
	int                                                mGammaXL;                                         		// 0x0484 (0x0004) [0x0000000000000000]              
	int                                                mGammaYL;                                         		// 0x0488 (0x0004) [0x0000000000000000]              
	class UMaterialInterface*                          mGammaMI;                                         		// 0x048C (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1819 ];

		return pClassPointer;
	};

	void eventShowGammaCalibration ( unsigned long show, int X, int Y, int Width, int Height );
	void eventPostRender ( );
};

UClass* APgHud::pClassPointer = NULL;

// Class GridGame.PgMailboxInterface
// 0x0000 (0x003C - 0x003C)
class UPgMailboxInterface : public UInterface
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1820 ];

		return pClassPointer;
	};

};

UClass* UPgMailboxInterface::pClassPointer = NULL;

// Class GridGame.PgMailingListInterface
// 0x0000 (0x003C - 0x003C)
class UPgMailingListInterface : public UInterface
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1821 ];

		return pClassPointer;
	};

};

UClass* UPgMailingListInterface::pClassPointer = NULL;

// Class GridGame.PgMailmanNative
// 0x0000 (0x003C - 0x003C)
class UPgMailmanNative : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1822 ];

		return pClassPointer;
	};

};

UClass* UPgMailmanNative::pClassPointer = NULL;

// Class GridGame.PgMaterialInstanceInterface
// 0x0000 (0x003C - 0x003C)
class UPgMaterialInstanceInterface : public UInterface
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1823 ];

		return pClassPointer;
	};

	TArray< class UMaterialInstanceConstant* > GetMaterialInstanceList ( );
	void InitMaterialInstanceList ( );
};

UClass* UPgMaterialInstanceInterface::pClassPointer = NULL;

// Class GridGame.PgObjectPropertyInterface
// 0x0000 (0x003C - 0x003C)
class UPgObjectPropertyInterface : public UInterface
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1824 ];

		return pClassPointer;
	};

};

UClass* UPgObjectPropertyInterface::pClassPointer = NULL;

// Class GridGame.PgPlayerInputConfiguration
// 0x000C (0x0048 - 0x003C)
class UPgPlayerInputConfiguration : public UUIRoot
{
public:
	TArray< struct FUIAxisEmulationDefinition >        AxisEmulationDefinitions;                         		// 0x003C (0x000C) [0x0000000000404002]              ( CPF_Const | CPF_Config | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1825 ];

		return pClassPointer;
	};

};

UClass* UPgPlayerInputConfiguration::pClassPointer = NULL;

// Class GridGame.PgPlugInInterface
// 0x0000 (0x003C - 0x003C)
class UPgPlugInInterface : public UInterface
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1826 ];

		return pClassPointer;
	};

	void PlugIns ( class UClass* BaseClass, class UPgActorPlugIn** PlugIn );
	bool TriggerInputPlugIns ( unsigned long pressed, struct FName Button );
	void SyncClientPlugIns ( );
	void eventSyncServerPlugIns ( int plugInRep );
	int GetConditionalPlugInField ( );
	void SetConditionalPlugInField ( int plugInRep );
};

UClass* UPgPlugInInterface::pClassPointer = NULL;

// Class GridGame.PgRadialBlurComponent
// 0x0010 (0x00D0 - 0x00C0)
class UPgRadialBlurComponent : public URadialBlurComponent
{
public:
	struct FInterpCurveFloat                           mSpeedBasedBlurScaleCurve;                        		// 0x00C0 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1827 ];

		return pClassPointer;
	};

};

UClass* UPgRadialBlurComponent::pClassPointer = NULL;

// Class GridGame.PgRB_ConstraintInstance
// 0x0000 (0x00AC - 0x00AC)
class UPgRB_ConstraintInstance : public URB_ConstraintInstance
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1828 ];

		return pClassPointer;
	};

};

UClass* UPgRB_ConstraintInstance::pClassPointer = NULL;

// Class GridGame.PgRB_StayUprightSetup
// 0x0018 (0x0118 - 0x0100)
class UPgRB_StayUprightSetup : public URB_StayUprightSetup
{
public:
	struct FVector                                     mLocalAnchor1;                                    		// 0x0100 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     mLocalAnchor2;                                    		// 0x010C (0x000C) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1829 ];

		return pClassPointer;
	};

};

UClass* UPgRB_StayUprightSetup::pClassPointer = NULL;

// Class GridGame.PgSimpleMenuMovie
// 0x0000 (0x00BC - 0x00BC)
class UPgSimpleMenuMovie : public UPgGFxMovie
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1830 ];

		return pClassPointer;
	};

	bool eventStart ( unsigned long StartPaused );
};

UClass* UPgSimpleMenuMovie::pClassPointer = NULL;

// Class GridGame.PgStasisEffectInterface
// 0x0000 (0x003C - 0x003C)
class UPgStasisEffectInterface : public UInterface
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1831 ];

		return pClassPointer;
	};

};

UClass* UPgStasisEffectInterface::pClassPointer = NULL;

// Class GridGame.PgTargetableInterface
// 0x0000 (0x003C - 0x003C)
class UPgTargetableInterface : public UInterface
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1832 ];

		return pClassPointer;
	};

	bool CanTarget ( class APawn* thePawn );
	float GetMaxTargetableDist ( );
	float GetMinTargetableDist ( );
};

UClass* UPgTargetableInterface::pClassPointer = NULL;

// Class GridGame.PgActorPlugIn
// 0x0030 (0x006C - 0x003C)
class UPgActorPlugIn : public UObject
{
public:
	class AActor*                                      mOwner;                                           		// 0x003C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UMeshComponent*                              mOwnerMesh;                                       		// 0x0040 (0x0004) [0x0000000004082008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline )
	struct FName                                       mName;                                            		// 0x0044 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      mActive : 1;                                      		// 0x004C (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      mAlwaysTick : 1;                                  		// 0x004C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      mOutputComment : 1;                               		// 0x004C (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      mLoop : 1;                                        		// 0x004C (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	float                                              mTimeActive;                                      		// 0x0050 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FString                                     mComment;                                         		// 0x0054 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	float                                              mLifeSpan;                                        		// 0x0060 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mActivateDelay;                                   		// 0x0064 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mCurrentActivateDelay;                            		// 0x0068 (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1833 ];

		return pClassPointer;
	};

	void Detach ( );
	void Deactivate ( );
	void Activate ( );
	bool OnDeactivate ( );
	bool OnActivate ( );
};

UClass* UPgActorPlugIn::pClassPointer = NULL;

// Class GridGame.PgActorPlugInActorFactory
// 0x002C (0x0098 - 0x006C)
class UPgActorPlugInActorFactory : public UPgActorPlugIn
{
public:
	class AActor*                                      mSpawnedActor;                                    		// 0x006C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      mAttach : 1;                                      		// 0x0070 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      mCheckSpawnCollision : 1;                         		// 0x0070 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      mbHardAttach : 1;                                 		// 0x0070 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      mbUseRelativeOffset : 1;                          		// 0x0070 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      mbUseRelativeRotation : 1;                        		// 0x0070 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	unsigned long                                      bDestroyOnDeactivate : 1;                         		// 0x0070 (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
	struct FName                                       mAttachName;                                      		// 0x0074 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     mRelativeOffset;                                  		// 0x007C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FRotator                                    mRelativeRotation;                                		// 0x0088 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	class UActorFactory*                               mFactory;                                         		// 0x0094 (0x0004) [0x0000000004000001]              ( CPF_Edit | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1834 ];

		return pClassPointer;
	};

	void Deactivate ( );
	void Activate ( );
};

UClass* UPgActorPlugInActorFactory::pClassPointer = NULL;

// Class GridGame.PgActorPlugInAkSetRTPCValue
// 0x001C (0x0088 - 0x006C)
class UPgActorPlugInAkSetRTPCValue : public UPgActorPlugIn
{
public:
	struct FName                                       mRealTimeParameterControlName;                    		// 0x006C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       mNameOfActorPropertyToForward;                    		// 0x0074 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class AActor*                                      mParamPropOwner;                                  		// 0x007C (0x0004) [0x0000000000000000]              
	struct FPointer                                    mParamPropPtr;                                    		// 0x0080 (0x0004) [0x0000000000000000]              
	float                                              mLastForwardedValue;                              		// 0x0084 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1835 ];

		return pClassPointer;
	};

};

UClass* UPgActorPlugInAkSetRTPCValue::pClassPointer = NULL;

// Class GridGame.PgActorPlugInAkSetState
// 0x0010 (0x007C - 0x006C)
class UPgActorPlugInAkSetState : public UPgActorPlugIn
{
public:
	struct FName                                       mWwiseStateGroup;                                 		// 0x006C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       mWwiseStateName;                                  		// 0x0074 (0x0008) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1836 ];

		return pClassPointer;
	};

	void Activate ( );
};

UClass* UPgActorPlugInAkSetState::pClassPointer = NULL;

// Class GridGame.PgActorPlugInAkSetSwitch
// 0x0010 (0x007C - 0x006C)
class UPgActorPlugInAkSetSwitch : public UPgActorPlugIn
{
public:
	struct FName                                       mWwiseSwitchGroup;                                		// 0x006C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       mWwiseSwitchName;                                 		// 0x0074 (0x0008) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1837 ];

		return pClassPointer;
	};

	void Activate ( );
};

UClass* UPgActorPlugInAkSetSwitch::pClassPointer = NULL;

// Class GridGame.PgActorPlugInComponent
// 0x0011 (0x007D - 0x006C)
class UPgActorPlugInComponent : public UPgActorPlugIn
{
public:
	class UActorComponent*                             mComponent;                                       		// 0x006C (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	struct FName                                       mAttachName;                                      		// 0x0070 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      mUseTickGroupOverride : 1;                        		// 0x0078 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned char                                      mTickGroupOverride;                               		// 0x007C (0x0001) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1838 ];

		return pClassPointer;
	};

	void Deactivate ( );
	void Activate ( );
};

UClass* UPgActorPlugInComponent::pClassPointer = NULL;

// Class GridGame.PgActorPlugInConditional
// 0x0027 (0x0093 - 0x006C)
class UPgActorPlugInConditional : public UPgActorPlugIn
{
public:
	class UPgCondition*                                mPreconditionData;                                		// 0x006C (0x0004) [0x0000000004400009]              ( CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline )
	class UPgActorPlugIn*                              mPlugIn;                                          		// 0x0070 (0x0004) [0x0000000004400009]              ( CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline )
	class UPgCondition*                                mPostConditionData;                               		// 0x0074 (0x0004) [0x0000000004400009]              ( CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline )
	float                                              mMaxDistanceActivation;                           		// 0x0078 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      mOffscreenActivation : 1;                         		// 0x007C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	float                                              mNextActivateWaitTime;                            		// 0x0080 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mNextDeactivateWaitTime;                          		// 0x0084 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mLastActivateCheckTime;                           		// 0x0088 (0x0004) [0x0000000000000000]              
	float                                              mLastDeactivateCheckTime;                         		// 0x008C (0x0004) [0x0000000000000000]              
	unsigned char                                      mActivationReplication;                           		// 0x0090 (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	unsigned char                                      mConditionGameModeType;                           		// 0x0091 (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	unsigned char                                      mConditionTestType;                               		// 0x0092 (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1839 ];

		return pClassPointer;
	};

	void Deactivate ( );
	void Activate ( );
	void Detach ( );
};

UClass* UPgActorPlugInConditional::pClassPointer = NULL;

// Class GridGame.PgActorPlugInEmitter
// 0x0078 (0x00E4 - 0x006C)
class UPgActorPlugInEmitter : public UPgActorPlugIn
{
public:
	class UParticleSystem*                             mPSTemplate;                                      		// 0x006C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      mAttach : 1;                                      		// 0x0070 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      mUseOwnerTeamColor : 1;                           		// 0x0070 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      mValidTeamColor : 1;                              		// 0x0070 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      mHiddenSceneCapture : 1;                          		// 0x0070 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      mHiddenSceneCaptureCube : 1;                      		// 0x0070 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	struct FName                                       mAttachName;                                      		// 0x0074 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class APgDynamicEmitter*                           mEmitter;                                         		// 0x007C (0x0004) [0x0000000000000000]              
	float                                              mPostDeactivateLifeSpan;                          		// 0x0080 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     mTranslation;                                     		// 0x0084 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FRotator                                    mRotation;                                        		// 0x0090 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              mScale;                                           		// 0x009C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      mParticleSystemTickGroup;                         		// 0x00A0 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      mDepthPriorityGroup;                              		// 0x00A1 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       mFloatParameterName;                              		// 0x00A4 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              mFloatParameterValue;                             		// 0x00AC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       mVectorParameterName;                             		// 0x00B0 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     mVectorParameterValue;                            		// 0x00B8 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       mColorParameterName;                              		// 0x00C4 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FColor                                      mColorParameterValue;                             		// 0x00CC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                mTeamColor;                                       		// 0x00D0 (0x0010) [0x0000000000000000]              
	int                                                mLastLevel;                                       		// 0x00E0 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1840 ];

		return pClassPointer;
	};

	void Deactivate ( );
	void Activate ( );
};

UClass* UPgActorPlugInEmitter::pClassPointer = NULL;

// Class GridGame.PgActorPlugInBeamTrailEmitter
// 0x000C (0x00F0 - 0x00E4)
class UPgActorPlugInBeamTrailEmitter : public UPgActorPlugInEmitter
{
public:
	TArray< class APgDynamicEmitter* >                 mEmitterList;                                     		// 0x00E4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1841 ];

		return pClassPointer;
	};

	void Deactivate ( );
	void Activate ( );
};

UClass* UPgActorPlugInBeamTrailEmitter::pClassPointer = NULL;

// Class GridGame.PgActorPlugInCameraEmitter
// 0x0000 (0x00E4 - 0x00E4)
class UPgActorPlugInCameraEmitter : public UPgActorPlugInEmitter
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1842 ];

		return pClassPointer;
	};

};

UClass* UPgActorPlugInCameraEmitter::pClassPointer = NULL;

// Class GridGame.PgActorPlugInFireSideEffect
// 0x0009 (0x0075 - 0x006C)
class UPgActorPlugInFireSideEffect : public UPgActorPlugIn
{
public:
	class UPgSideEffectContainer*                      mSideEffectContainer;                             		// 0x006C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      mbUseOwnerLocationAsEpicenter : 1;                		// 0x0070 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned char                                      mFireMode;                                        		// 0x0074 (0x0001) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1843 ];

		return pClassPointer;
	};

	void Deactivate ( );
	void Activate ( );
};

UClass* UPgActorPlugInFireSideEffect::pClassPointer = NULL;

// Class GridGame.PgActorPlugInLightWall
// 0x002C (0x0098 - 0x006C)
class UPgActorPlugInLightWall : public UPgActorPlugIn
{
public:
	class APgDynamicSMActor*                           mWallArchetype;                                   		// 0x006C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mWallOffset;                                      		// 0x0070 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mWallLifeSpan;                                    		// 0x0074 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      mOverrideVehicleTeamCollisionChannel : 1;         		// 0x0078 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      mOrientToOwner : 1;                               		// 0x0078 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      mInitialWall : 1;                                 		// 0x0078 (0x0004) [0x0000000000000000] [0x00000004] 
	int                                                mTeamCollisionChannel;                            		// 0x007C (0x0004) [0x0000000000000000]              
	struct FVector                                     mLastWallPos;                                     		// 0x0080 (0x000C) [0x0000000000000000]              
	struct FRotator                                    mLastWallRot;                                     		// 0x008C (0x000C) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1844 ];

		return pClassPointer;
	};

	void Activate ( );
};

UClass* UPgActorPlugInLightWall::pClassPointer = NULL;

// Class GridGame.PgActorPlugInMaterialParam
// 0x00AC (0x0118 - 0x006C)
class UPgActorPlugInMaterialParam : public UPgActorPlugIn
{
public:
	float                                              mBlendTime;                                       		// 0x006C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mCurrentBlendTime;                                		// 0x0070 (0x0004) [0x0000000000000000]              
	struct FName                                       mScalarParameterName;                             		// 0x0074 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     mScalarParameterValue;                            		// 0x007C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     mScalarParameterValueInitial;                     		// 0x0088 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FInterpCurveFloat                           mScalarParameterCurve;                            		// 0x0094 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	float                                              mLastScalarParameterValue;                        		// 0x00A4 (0x0004) [0x0000000000000000]              
	class AActor*                                      mScalarParamPropOwner;                            		// 0x00A8 (0x0004) [0x0000000000000000]              
	class AActor*                                      mScalarParamInitialPropOwner;                     		// 0x00AC (0x0004) [0x0000000000000000]              
	struct FPointer                                    mScalarParamPropPtr;                              		// 0x00B0 (0x0004) [0x0000000000000000]              
	struct FPointer                                    mScalarParamInitialPropPtr;                       		// 0x00B4 (0x0004) [0x0000000000000000]              
	float                                              mCurrentScalarBlendValue;                         		// 0x00B8 (0x0004) [0x0000000000000000]              
	struct FName                                       mVectorParameterName;                             		// 0x00BC (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                mVectorParameterValue;                            		// 0x00C4 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FInterpCurveQuat                            mVectorParameterCurve;                            		// 0x00D4 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FLinearColor                                mLastVectorParameterValue;                        		// 0x00E4 (0x0010) [0x0000000000000000]              
	struct FLinearColor                                mCurrentVectorBlendValue;                         		// 0x00F4 (0x0010) [0x0000000000000000]              
	struct FName                                       mTextureParameterName;                            		// 0x0104 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UTexture*                                    mTextureParameterValue;                           		// 0x010C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mMinRenderTime;                                   		// 0x0110 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class APgInterpActor*                              mPgInterpActorOwner;                              		// 0x0114 (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1845 ];

		return pClassPointer;
	};

	void Activate ( );
};

UClass* UPgActorPlugInMaterialParam::pClassPointer = NULL;

// Class GridGame.PgActorPlugInTeamColor
// 0x0000 (0x0118 - 0x0118)
class UPgActorPlugInTeamColor : public UPgActorPlugInMaterialParam
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1846 ];

		return pClassPointer;
	};

};

UClass* UPgActorPlugInTeamColor::pClassPointer = NULL;

// Class GridGame.PgActorPlugInModifyCameraScore
// 0x0010 (0x007C - 0x006C)
class UPgActorPlugInModifyCameraScore : public UPgActorPlugIn
{
public:
	unsigned char                                      mAffectedCameras;                                 		// 0x006C (0x0001) [0x0000000000000000]              
	struct FName                                       mCameraStyle;                                     		// 0x0070 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              mAmount;                                          		// 0x0078 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1847 ];

		return pClassPointer;
	};

	void Deactivate ( );
	void Activate ( );
};

UClass* UPgActorPlugInModifyCameraScore::pClassPointer = NULL;

// Class GridGame.PgActorPlugInModifyProperty
// 0x0044 (0x00B0 - 0x006C)
class UPgActorPlugInModifyProperty : public UPgActorPlugIn
{
public:
	struct FName                                       mPropertyName;                                    		// 0x006C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class AActor*                                      mPropertyOwner;                                   		// 0x0074 (0x0004) [0x0000000000000000]              
	struct FPointer                                    mPropertyPtr;                                     		// 0x0078 (0x0004) [0x0000000000000000]              
	struct FString                                     mPropertyValue;                                   		// 0x007C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class AActor*                                      mPropertyValueOwner;                              		// 0x0088 (0x0004) [0x0000000000000000]              
	struct FPointer                                    mPropertyValuePtr;                                		// 0x008C (0x0004) [0x0000000000000000]              
	unsigned char                                      mModifyType;                                      		// 0x0090 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     mPropertyValueMax;                                		// 0x0094 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     mPropertyValueMin;                                		// 0x00A0 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned long                                      mRestoreToDefaultOnDeactivate : 1;                		// 0x00AC (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      mReplicate : 1;                                   		// 0x00AC (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1848 ];

		return pClassPointer;
	};

	void Deactivate ( );
	void Activate ( );
};

UClass* UPgActorPlugInModifyProperty::pClassPointer = NULL;

// Class GridGame.PgActorPlugInPhysMatEffect
// 0x0010 (0x007C - 0x006C)
class UPgActorPlugInPhysMatEffect : public UPgActorPlugIn
{
public:
	class UPgPhysMatEffect*                            mHitEffect;                                       		// 0x006C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       mTraceFromSocketName;                             		// 0x0070 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              mTraceDistance;                                   		// 0x0078 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1849 ];

		return pClassPointer;
	};

	void Activate ( );
};

UClass* UPgActorPlugInPhysMatEffect::pClassPointer = NULL;

// Class GridGame.PgActorPlugInResetFreeCamera
// 0x0010 (0x007C - 0x006C)
class UPgActorPlugInResetFreeCamera : public UPgActorPlugIn
{
public:
	struct FRotationSpringParameters                   mSpringParameters;                                		// 0x006C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              mActiveTime;                                      		// 0x0078 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1850 ];

		return pClassPointer;
	};

	void Activate ( );
};

UClass* UPgActorPlugInResetFreeCamera::pClassPointer = NULL;

// Class GridGame.PgActorPlugInSeqAction
// 0x0008 (0x0074 - 0x006C)
class UPgActorPlugInSeqAction : public UPgActorPlugIn
{
public:
	class USequenceAction*                             mSeqAction;                                       		// 0x006C (0x0004) [0x0000000014400009]              ( CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineUse )
	int                                                mImpulseInputLink;                                		// 0x0070 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1851 ];

		return pClassPointer;
	};

	void Activate ( );
};

UClass* UPgActorPlugInSeqAction::pClassPointer = NULL;

// Class GridGame.PgActorPlugInSetCameraStyle
// 0x0008 (0x0074 - 0x006C)
class UPgActorPlugInSetCameraStyle : public UPgActorPlugIn
{
public:
	struct FName                                       mCameraStyle;                                     		// 0x006C (0x0008) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1852 ];

		return pClassPointer;
	};

	void Activate ( );
};

UClass* UPgActorPlugInSetCameraStyle::pClassPointer = NULL;

// Class GridGame.PgActorPlugInSetMaterial
// 0x000C (0x0078 - 0x006C)
class UPgActorPlugInSetMaterial : public UPgActorPlugIn
{
public:
	TArray< struct FSetMaterialInfo >                  mNewMaterialList;                                 		// 0x006C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1853 ];

		return pClassPointer;
	};

	void Activate ( );
};

UClass* UPgActorPlugInSetMaterial::pClassPointer = NULL;

// Class GridGame.PgActorPlugInSetPhysics
// 0x0001 (0x006D - 0x006C)
class UPgActorPlugInSetPhysics : public UPgActorPlugIn
{
public:
	unsigned char                                      mNewPhysics;                                      		// 0x006C (0x0001) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1854 ];

		return pClassPointer;
	};

	void Activate ( );
};

UClass* UPgActorPlugInSetPhysics::pClassPointer = NULL;

// Class GridGame.PgActorPlugInSetSkeletalMesh
// 0x000C (0x0078 - 0x006C)
class UPgActorPlugInSetSkeletalMesh : public UPgActorPlugIn
{
public:
	class USkeletalMesh*                               mSkelMesh;                                        		// 0x006C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       mSkelMeshName;                                    		// 0x0070 (0x0008) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1855 ];

		return pClassPointer;
	};

	void Activate ( );
};

UClass* UPgActorPlugInSetSkeletalMesh::pClassPointer = NULL;

// Class GridGame.PgActorPlugInSound
// 0x0014 (0x0080 - 0x006C)
class UPgActorPlugInSound : public UPgActorPlugIn
{
public:
	class UAkEvent*                                    mAkEventToPlay;                                   		// 0x006C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAkEvent*                                    mAkEventToStop;                                   		// 0x0070 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      mStopWhenOwnerDestroyed : 1;                      		// 0x0074 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      mNotReplicated : 1;                               		// 0x0074 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      mNoRepToOwner : 1;                                		// 0x0074 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	struct FName                                       mAttachName;                                      		// 0x0078 (0x0008) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1856 ];

		return pClassPointer;
	};

	void Deactivate ( );
	void Activate ( );
};

UClass* UPgActorPlugInSound::pClassPointer = NULL;

// Class GridGame.PgActorPlugInTakeDamage
// 0x0008 (0x0074 - 0x006C)
class UPgActorPlugInTakeDamage : public UPgActorPlugIn
{
public:
	class UClass*                                      mDamageType;                                      		// 0x006C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mDamageAmount;                                    		// 0x0070 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1857 ];

		return pClassPointer;
	};

	void Activate ( );
};

UClass* UPgActorPlugInTakeDamage::pClassPointer = NULL;

// Class GridGame.PgPawnPlugInGib
// 0x001C (0x0088 - 0x006C)
class UPgPawnPlugInGib : public UPgActorPlugIn
{
public:
	class UPhysicsAsset*                               mGibPhysicsAsset;                                 		// 0x006C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	class USkeletalMesh*                               mGibSkeletalMesh;                                 		// 0x0070 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              mAdditionalZVelocity;                             		// 0x0074 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              mGibVelocityMultiplier;                           		// 0x0078 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	TArray< int >                                      mMaterialRemap;                                   		// 0x007C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1858 ];

		return pClassPointer;
	};

};

UClass* UPgPawnPlugInGib::pClassPointer = NULL;

// Class GridGame.PgPawnPlugInLean
// 0x0048 (0x00B4 - 0x006C)
class UPgPawnPlugInLean : public UPgActorPlugIn
{
public:
	struct FRotator                                    mMinLeanYaw;                                      		// 0x006C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FRotator                                    mMaxLeanYaw;                                      		// 0x0078 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      mbUseDesiredSpeed : 1;                            		// 0x0084 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	float                                              mMinLeanSpeed;                                    		// 0x0088 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mMaxLeanSpeed;                                    		// 0x008C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FRotator                                    mMaxRotationRoll;                                 		// 0x0090 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              mLeanNormalBlendSpeed;                            		// 0x009C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mLeanFastBlendSpeed;                              		// 0x00A0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              mLeanOutBlendSpeed;                               		// 0x00A4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FRotator                                    mRotation;                                        		// 0x00A8 (0x000C) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1859 ];

		return pClassPointer;
	};

};

UClass* UPgPawnPlugInLean::pClassPointer = NULL;

// Class GridGame.PgPawnPlugInSpecialMove
// 0x0008 (0x0074 - 0x006C)
class UPgPawnPlugInSpecialMove : public UPgActorPlugIn
{
public:
	class UPgSpecialMoveAsset*                         mSpecialMoveAsset;                                		// 0x006C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	unsigned long                                      mEndComboOnDeactivate : 1;                        		// 0x0070 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1860 ];

		return pClassPointer;
	};

	void Deactivate ( );
	void Activate ( );
};

UClass* UPgPawnPlugInSpecialMove::pClassPointer = NULL;

// Class GridGame.PgPawnPlugInTerrainFollow
// 0x0060 (0x00CC - 0x006C)
class UPgPawnPlugInTerrainFollow : public UPgActorPlugIn
{
public:
	struct FVector                                     mTranslation;                                     		// 0x006C (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FVector                                     mDefaultTranslation;                              		// 0x0078 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	TArray< class USkelControlBase* >                  mIKControllers;                                   		// 0x0084 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
