/*
#############################################################################################
# Tron Evolution (1.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: GridVehicle_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function GridVehicle.ForcedDirVolume.StopsProjectile
// [0x00020102] 
struct AForcedDirVolume_execStopsProjectile_Parms
{
	class AProjectile*                                 P;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridVehicle.ForcedDirVolume.UnTouch
// [0x00020902] ( FUNC_Event )
struct AForcedDirVolume_eventUnTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// unsigned long                                   bInAnotherVolume : 1;                             		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AForcedDirVolume*                         AnotherVolume;                                    		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.ForcedDirVolume.Touch
// [0x00020902] ( FUNC_Event )
struct AForcedDirVolume_eventTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UPrimitiveComponent*                         OtherComp;                                        		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitNormal;                                        		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// class AUTVehicle*                               V;                                                		// 0x0020 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.ForcedDirVolume.ActorEnteredVolume
// [0x00020802] ( FUNC_Event )
struct AForcedDirVolume_eventActorEnteredVolume_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridVehicle.ForcedDirVolume.PostBeginPlay
// [0x00020102] 
struct AForcedDirVolume_execPostBeginPlay_Parms
{
};

// Function GridVehicle.UTSkelControl_Damage.RestorePart
// [0x00020902] ( FUNC_Event )
struct UUTSkelControl_Damage_eventRestorePart_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridVehicle.UTSkelControl_Damage.BreakApartOnDeath
// [0x00020902] ( FUNC_Event )
struct UUTSkelControl_Damage_eventBreakApartOnDeath_Parms
{
	struct FVector                                     PartLocation;                                     		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bIsVisible : 1;                                   		// 0x000C (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function GridVehicle.UTSkelControl_Damage.BreakApart
// [0x00020902] ( FUNC_Event )
struct UUTSkelControl_Damage_eventBreakApart_Parms
{
	struct FVector                                     PartLocation;                                     		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bIsVisible : 1;                                   		// 0x000C (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function GridVehicle.UTSkelControl_TurretConstrained.WouldConstrainPitch
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UUTSkelControl_TurretConstrained_execWouldConstrainPitch_Parms
{
	int                                                TestPitch;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridVehicle.UTSkelControl_TurretConstrained.InitTurret
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UUTSkelControl_TurretConstrained_execInitTurret_Parms
{
	struct FRotator                                    InitRot;                                          		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x000C (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function GridVehicle.UTSkelControl_TurretConstrained.OnTurretStatusChange
// [0x00120000] 
struct UUTSkelControl_TurretConstrained_execOnTurretStatusChange_Parms
{
	unsigned long                                      bIsMoving : 1;                                    		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function GridVehicle.UTVehicleBase.ApplyWeaponEffects
// [0x00024100] 
struct AUTVehicleBase_execApplyWeaponEffects_Parms
{
	int                                                OverlayFlags;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                SeatIndex;                                        		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function GridVehicle.UTVehicleBase.QuickPick
// [0x00020100] 
struct AUTVehicleBase_execQuickPick_Parms
{
	int                                                Quad;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridVehicle.UTVehicleBase.DisplayHud
// [0x00024000] 
struct AUTVehicleBase_execDisplayHud_Parms
{
	class AHUD*                                        HUD;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UCanvas*                                     Canvas;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector2D                                   HudPOS;                                           		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                SIndex;                                           		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function GridVehicle.UTVehicleBase.GetPowerLevel
// [0x00420102] 
struct AUTVehicleBase_execGetPowerLevel_Parms
{
	float                                              PowerLevel;                                       		// 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridVehicle.UTVehicleBase.HandleDeadVehicleDriver
// [0x00020002] 
struct AUTVehicleBase_execHandleDeadVehicleDriver_Parms
{
	// class APawn*                                    OldDriver;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	// class AUTVehicle*                               VehicleBase;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicleBase.DetachDriver
// [0x00020102] 
struct AUTVehicleBase_execDetachDriver_Parms
{
	class APawn*                                       P;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridVehicle.UTVehicleBase.StopFiringWeapon
// [0x00020102] 
struct AUTVehicleBase_execStopFiringWeapon_Parms
{
};

// Function GridVehicle.UTVehicleBase.EjectDriver
// [0x00820002] 
struct AUTVehicleBase_execEjectDriver_Parms
{
	// float                                           Speed;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	// struct FRotator                                 ExitRotation;                                     		// 0x0004 (0x000C) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicleBase.DriverLeft
// [0x00020002] 
struct AUTVehicleBase_execDriverLeft_Parms
{
	// class AAIController*                            C;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicleBase.DriverEnter
// [0x00020002] 
struct AUTVehicleBase_execDriverEnter_Parms
{
	class APawn*                                       P;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class AAIController*                            C;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicleBase.DrivingStatusChanged
// [0x00020102] 
struct AUTVehicleBase_execDrivingStatusChanged_Parms
{
};

// Function GridVehicle.UTVehicleBase.GetVehicleDrivingStatName
// [0x00020002] 
struct AUTVehicleBase_execGetVehicleDrivingStatName_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FName                                    VehicleStatName;                                  		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicleBase.NeedToTurn
// [0x00020002] 
struct AUTVehicleBase_execNeedToTurn_Parms
{
	struct FVector                                     targ;                                             		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class AUTVehicleWeapon*                         VWeapon;                                          		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicleBase.GetDamageScaling
// [0x00020002] 
struct AUTVehicleBase_execGetDamageScaling_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridVehicle.UTVehicleBase.BotFire
// [0x00020002] 
struct AUTVehicleBase_execBotFire_Parms
{
	unsigned long                                      bFinished : 1;                                    		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridVehicle.UTVehicleBase.ChooseFireMode
// [0x00020002] 
struct AUTVehicleBase_execChooseFireMode_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridVehicle.UTVehicleBase.ServerChangeSeat
// [0x002200C0] 
struct AUTVehicleBase_execServerChangeSeat_Parms
{
	int                                                RequestedSeat;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridVehicle.UTVehicleBase.ServerAdjacentSeat
// [0x002200C0] 
struct AUTVehicleBase_execServerAdjacentSeat_Parms
{
	int                                                Direction;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AController*                                 C;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridVehicle.UTVehicleBase.AdjacentSeat
// [0x00020102] 
struct AUTVehicleBase_execAdjacentSeat_Parms
{
	int                                                Direction;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AController*                                 C;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridVehicle.UTVehicleBase.SwitchWeapon
// [0x00020102] 
struct AUTVehicleBase_execSwitchWeapon_Parms
{
	unsigned char                                      NewGroup;                                         		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridVehicle.UTVehicle.DetachTowCable
// [0x00020000] 
struct AUTVehicle_execDetachTowCable_Parms
{
};

// Function GridVehicle.UTVehicle.GetTowedVehicles
// [0x00420002] 
struct AUTVehicle_execGetTowedVehicles_Parms
{
	TArray< class AUTVehicle* >                        TowedVehicles;                                    		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	// class AUTVehicle*                               V;                                                		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.GetTowingVehicle
// [0x00020000] 
struct AUTVehicle_execGetTowingVehicle_Parms
{
	class AUTVehicle*                                  ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridVehicle.UTVehicle.OnTouchForcedDirVolume
// [0x00020002] 
struct AUTVehicle_execOnTouchForcedDirVolume_Parms
{
	class AForcedDirVolume*                            Vol;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridVehicle.UTVehicle.ApplyWeaponEffects
// [0x00024102] 
struct AUTVehicle_execApplyWeaponEffects_Parms
{
	int                                                OverlayFlags;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                SeatIndex;                                        		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	// int                                             I;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             OverlayIndex;                                     		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.GetVehicleKillStatName
// [0x00020002] 
struct AUTVehicle_execGetVehicleKillStatName_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FName                                    VehicleKillStatName;                              		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.CanAttack
// [0x00020002] 
struct AUTVehicle_execCanAttack_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           MaxRange;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
	// class AWeapon*                                  W;                                                		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.GetAlternateLockTarget
// [0x00020400] ( FUNC_Native )
struct AUTVehicle_execGetAlternateLockTarget_Parms
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridVehicle.UTVehicle.DetachDriver
// [0x00020102] 
struct AUTVehicle_execDetachDriver_Parms
{
	class APawn*                                       P;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridVehicle.UTVehicle.SetMovementEffect
// [0x00024102] 
struct AUTVehicle_execSetMovementEffect_Parms
{
	int                                                SeatIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bSetActive : 1;                                   		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	class APawn*                                       UTP;                                              		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	// unsigned long                                   bIsLocal : 1;                                     		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GridVehicle.UTVehicle.SetSeatStoragePawn
// [0x00020002] 
struct AUTVehicle_execSetSeatStoragePawn_Parms
{
	int                                                SeatIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class APawn*                                       PawnToSit;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             Mask;                                             		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.GetHoverBoardAttachPoint
// [0x00820102] 
struct AUTVehicle_execGetHoverBoardAttachPoint_Parms
{
	struct FVector                                     HoverBoardLocation;                               		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       ReturnValue;                                      		// 0x000C (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FName                                    Result;                                           		// 0x0014 (0x0008) [0x0000000000000000]              
	// float                                           Dist;                                             		// 0x001C (0x0004) [0x0000000000000000]              
	// float                                           MinDist;                                          		// 0x0020 (0x0004) [0x0000000000000000]              
	// struct FVector                                  V;                                                		// 0x0024 (0x000C) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0030 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.SetHoverBoardAttachPointInUse
// [0x00020102] 
struct AUTVehicle_execSetHoverBoardAttachPointInUse_Parms
{
	struct FName                                       PointName;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bInUse : 1;                                       		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// int                                             I;                                                		// 0x000C (0x0004) [0x0000000000000000]              
	// unsigned long                                   bFound : 1;                                       		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GridVehicle.UTVehicle.SetShieldActive
// [0x00020000] 
struct AUTVehicle_execSetShieldActive_Parms
{
	int                                                SeatIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bActive : 1;                                      		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function GridVehicle.UTVehicle.GetSVehicleDebug
// [0x00420102] 
struct AUTVehicle_execGetSVehicleDebug_Parms
{
	TArray< struct FString >                           DebugInfo;                                        		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	// int                                             I;                                                		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.MorphTargetDestroyed
// [0x00020900] ( FUNC_Event )
struct AUTVehicle_eventMorphTargetDestroyed_Parms
{
	int                                                MorphNodeIndex;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridVehicle.UTVehicle.ApplyRandomMorphDamage
// [0x00020102] 
struct AUTVehicle_execApplyRandomMorphDamage_Parms
{
	int                                                Amount;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             Min;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             minindex;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x000C (0x0004) [0x0000000000000000]              
	// float                                           MinAmt;                                           		// 0x0010 (0x0004) [0x0000000000000000]              
	// float                                           Weight;                                           		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.ApplyMorphHeal
// [0x00020902] ( FUNC_Event )
struct AUTVehicle_eventApplyMorphHeal_Parms
{
	int                                                Amount;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             Individual;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             Total;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             Remaining;                                        		// 0x000C (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
	// float                                           Weight;                                           		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.ReceivedHealthChange
// [0x00020902] ( FUNC_Event )
struct AUTVehicle_eventReceivedHealthChange_Parms
{
	// int                                             Diff;                                             		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.ApplyMorphDamage
// [0x00020400] ( FUNC_Native )
struct AUTVehicle_execApplyMorphDamage_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                Damage;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Momentum;                                         		// 0x0010 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridVehicle.UTVehicle.UpdateDamageMaterial
// [0x00020500] ( FUNC_Native )
struct AUTVehicle_execUpdateDamageMaterial_Parms
{
};

// Function GridVehicle.UTVehicle.InitDamageSkel
// [0x00020500] ( FUNC_Native )
struct AUTVehicle_execInitDamageSkel_Parms
{
};

// Function GridVehicle.UTVehicle.InitializeMorphs
// [0x00020102] 
struct AUTVehicle_execInitializeMorphs_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             J;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.RBPenetrationDestroy
// [0x00020802] ( FUNC_Event )
struct AUTVehicle_eventRBPenetrationDestroy_Parms
{
};

// Function GridVehicle.UTVehicle.RigidBodyCollision
// [0x00420902] ( FUNC_Event )
struct AUTVehicle_eventRigidBodyCollision_Parms
{
	class UPrimitiveComponent*                         HitComponent;                                     		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	class UPrimitiveComponent*                         OtherComponent;                                   		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FCollisionImpactData                        Collision;                                        		// 0x0008 (0x0024) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                ContactIndex;                                     		// 0x002C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             Damage;                                           		// 0x0030 (0x0004) [0x0000000000000000]              
	// class AUTVehicle*                               V;                                                		// 0x0034 (0x0004) [0x0000000000000000]              
	// class AController*                              InstigatorController;                             		// 0x0038 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.GetCollisionDamageModifier
// [0x00C20002] 
struct AUTVehicle_execGetCollisionDamageModifier_Parms
{
	TArray< struct FRigidBodyContactInfo >             ContactInfos;                                     		// 0x0000 (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           Angle;                                            		// 0x0010 (0x0004) [0x0000000000000000]              
	// struct FVector                                  X;                                                		// 0x0014 (0x000C) [0x0000000000000000]              
	// struct FVector                                  Y;                                                		// 0x0020 (0x000C) [0x0000000000000000]              
	// struct FVector                                  Z;                                                		// 0x002C (0x000C) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.GetHealth
// [0x00020102] 
struct AUTVehicle_execGetHealth_Parms
{
	int                                                SeatIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridVehicle.UTVehicle.OnPropertyChange
// [0x00020802] ( FUNC_Event )
struct AUTVehicle_eventOnPropertyChange_Parms
{
	struct FName                                       PropName;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// int                                             I;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.GetHumanReadableName
// [0x00020102] 
struct AUTVehicle_execGetHumanReadableName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function GridVehicle.UTVehicle.SitDriver
// [0x00020102] 
struct AUTVehicle_execSitDriver_Parms
{
	class APawn*                                       UTP;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                SeatIndex;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridVehicle.UTVehicle.AttachDriver
// [0x00020102] 
struct AUTVehicle_execAttachDriver_Parms
{
	class APawn*                                       P;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class APawn*                                    UTP;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.CheckDamageSmoke
// [0x00020102] 
struct AUTVehicle_execCheckDamageSmoke_Parms
{
};

// Function GridVehicle.UTVehicle.StopVehicleSounds
// [0x00020102] 
struct AUTVehicle_execStopVehicleSounds_Parms
{
	// int                                             SeatIdx;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.TurretExplosion
// [0x00820102] 
struct AUTVehicle_execTurretExplosion_Parms
{
	// struct FVector                                  SpawnLoc;                                         		// 0x0000 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 SpawnRot;                                         		// 0x000C (0x000C) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.ShouldSpawnExplosionLight
// [0x00020102] 
struct AUTVehicle_execShouldSpawnExplosionLight_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitNormal;                                        		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class APlayerController*                        P;                                                		// 0x001C (0x0004) [0x0000000000000000]              
	// float                                           Dist;                                             		// 0x0020 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.SetBurnOut
// [0x00820102] 
struct AUTVehicle_execSetBurnOut_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             NumElements;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             TeamNum;                                          		// 0x0008 (0x0004) [0x0000000000000000]              
	// struct FBurnOutDatum                            BOD;                                              		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.DisableCollision
// [0x00020102] 
struct AUTVehicle_execDisableCollision_Parms
{
};

// Function GridVehicle.UTVehicle.DisableDamageSmoke
// [0x00020102] 
struct AUTVehicle_execDisableDamageSmoke_Parms
{
};

// Function GridVehicle.UTVehicle.TurnOffShadows
// [0x00020102] 
struct AUTVehicle_execTurnOffShadows_Parms
{
};

// Function GridVehicle.UTVehicle.StartBurnOut
// [0x00020102] 
struct AUTVehicle_execStartBurnOut_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             NumBurnOutMaterials;                              		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.AdjustCameraScale
// [0x00020100] 
struct AUTVehicle_execAdjustCameraScale_Parms
{
	unsigned long                                      bMoveCameraIn : 1;                                		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function GridVehicle.UTVehicle.VehicleCalcCamera
// [0x00C24102] 
struct AUTVehicle_execVehicleCalcCamera_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                SeatIndex;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     out_CamLoc;                                       		// 0x0008 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FRotator                                    out_CamRot;                                       		// 0x0014 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FVector                                     CamStart;                                         		// 0x0020 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      bPivotOnly : 1;                                   		// 0x002C (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	// struct FVector                                  CamPos;                                           		// 0x0030 (0x000C) [0x0000000000000000]              
	// struct FVector                                  CamDir;                                           		// 0x003C (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x0048 (0x000C) [0x0000000000000000]              
	// struct FVector                                  FirstHitLocation;                                 		// 0x0054 (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitNormal;                                        		// 0x0060 (0x000C) [0x0000000000000000]              
	// struct FVector                                  CamRotX;                                          		// 0x006C (0x000C) [0x0000000000000000]              
	// struct FVector                                  CamRotY;                                          		// 0x0078 (0x000C) [0x0000000000000000]              
	// struct FVector                                  CamRotZ;                                          		// 0x0084 (0x000C) [0x0000000000000000]              
	// struct FVector                                  SafeLocation;                                     		// 0x0090 (0x000C) [0x0000000000000000]              
	// struct FVector                                  X;                                                		// 0x009C (0x000C) [0x0000000000000000]              
	// struct FVector                                  Y;                                                		// 0x00A8 (0x000C) [0x0000000000000000]              
	// struct FVector                                  Z;                                                		// 0x00B4 (0x000C) [0x0000000000000000]              
	// class AActor*                                   HitActor;                                         		// 0x00C0 (0x0004) [0x0000000000000000]              
	// float                                           NewCamStartZ;                                     		// 0x00C4 (0x0004) [0x0000000000000000]              
	// unsigned long                                   bObstructed : 1;                                  		// 0x00C8 (0x0004) [0x0000000000000000] [0x00000001] 
	// unsigned long                                   bInsideVehicle : 1;                               		// 0x00CC (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GridVehicle.UTVehicle.LimitCameraZ
// [0x00820102] 
struct AUTVehicle_execLimitCameraZ_Parms
{
	float                                              CurrentCamZ;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              OriginalCamZ;                                     		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                SeatIndex;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FRotator                                 CamRot;                                           		// 0x0010 (0x000C) [0x0000000000000000]              
	// float                                           Pct;                                              		// 0x001C (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.GetCameraStart
// [0x00820102] 
struct AUTVehicle_execGetCameraStart_Parms
{
	int                                                SeatIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             Len;                                              		// 0x0014 (0x0004) [0x0000000000000000]              
	// int                                             Obsolete;                                         		// 0x0018 (0x0004) [0x0000000000000000]              
	// struct FVector                                  CamStart;                                         		// 0x001C (0x000C) [0x0000000000000000]              
	// float                                           OriginalCamZ;                                     		// 0x0028 (0x0004) [0x0000000000000000]              
	// struct FTimePosition                            NewPos;                                           		// 0x002C (0x0010) [0x0000000000000000]              
	// struct FTimePosition                            PrevPos;                                          		// 0x003C (0x0010) [0x0000000000000000]              
	// float                                           DeltaTime;                                        		// 0x004C (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.GetCameraFocus
// [0x00820102] 
struct AUTVehicle_execGetCameraFocus_Parms
{
	int                                                SeatIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  CamStart;                                         		// 0x0010 (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x001C (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitNormal;                                        		// 0x0028 (0x000C) [0x0000000000000000]              
	// class AActor*                                   HitActor;                                         		// 0x0034 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.CalcCamera
// [0x00C20102] 
struct AUTVehicle_execCalcCamera_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     out_CamLoc;                                       		// 0x0004 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FRotator                                    out_CamRot;                                       		// 0x0010 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              out_FOV;                                          		// 0x001C (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  out_CamStart;                                     		// 0x0024 (0x000C) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.FindGoodEndView
// [0x00C20102] 
struct AUTVehicle_execFindGoodEndView_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    GoodRotation;                                     		// 0x0004 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	// struct FVector                                  cameraLoc;                                        		// 0x0010 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 cameraRot;                                        		// 0x001C (0x000C) [0x0000000000000000]              
	// struct FRotator                                 ViewRotation;                                     		// 0x0028 (0x000C) [0x0000000000000000]              
	// int                                             tries;                                            		// 0x0034 (0x0004) [0x0000000000000000]              
	// float                                           bestDist;                                         		// 0x0038 (0x0004) [0x0000000000000000]              
	// float                                           newdist;                                          		// 0x003C (0x0004) [0x0000000000000000]              
	// float                                           FOVAngle;                                         		// 0x0040 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.VehicleAdjustFlashLocation
// [0x00024102] 
struct AUTVehicle_execVehicleAdjustFlashLocation_Parms
{
	int                                                SeatIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      FireModeNum;                                      		// 0x0004 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     NewLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bClear : 1;                                       		// 0x0014 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function GridVehicle.UTVehicle.VehicleAdjustFlashCount
// [0x00024102] 
struct AUTVehicle_execVehicleAdjustFlashCount_Parms
{
	int                                                SeatIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      FireModeNum;                                      		// 0x0004 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bClear : 1;                                       		// 0x0008 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function GridVehicle.UTVehicle.FindWeaponHitNormal
// [0x00420102] 
struct AUTVehicle_execFindWeaponHitNormal_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FVector                                     HitNormal;                                        		// 0x000C (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FVector                                     End;                                              		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Start;                                            		// 0x0024 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FTraceHitInfo                               HitInfo;                                          		// 0x0030 (0x001C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	class AActor*                                      ReturnValue;                                      		// 0x004C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridVehicle.UTVehicle.VehicleWeaponFireEffects
// [0x00020102] 
struct AUTVehicle_execVehicleWeaponFireEffects_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                SeatIndex;                                        		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridVehicle.UTVehicle.VehicleWeaponStoppedFiring
// [0x00020102] 
struct AUTVehicle_execVehicleWeaponStoppedFiring_Parms
{
	unsigned long                                      bViaReplication : 1;                              		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	int                                                SeatIndex;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FName                                    StopName;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.WeaponStoppedFiring
// [0x00020102] 
struct AUTVehicle_execWeaponStoppedFiring_Parms
{
	class AWeapon*                                     InWeapon;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bViaReplication : 1;                              		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function GridVehicle.UTVehicle.VehicleWeaponFired
// [0x00020102] 
struct AUTVehicle_execVehicleWeaponFired_Parms
{
	unsigned long                                      bViaReplication : 1;                              		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                SeatIndex;                                        		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridVehicle.UTVehicle.WeaponFired
// [0x00024102] 
struct AUTVehicle_execWeaponFired_Parms
{
	class AWeapon*                                     InWeapon;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bViaReplication : 1;                              		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function GridVehicle.UTVehicle.CauseMuzzleFlashLight
// [0x00020102] 
struct AUTVehicle_execCauseMuzzleFlashLight_Parms
{
	int                                                SeatIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GridVehicle.UTVehicle.OverrideEndFire
// [0x00020100] 
struct AUTVehicle_execOverrideEndFire_Parms
{
	unsigned char                                      FireModeNum;                                      		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridVehicle.UTVehicle.OverrideBeginFire
// [0x00020100] 
struct AUTVehicle_execOverrideBeginFire_Parms
{
	unsigned char                                      FireModeNum;                                      		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GridVehicle.UTVehicle.GetWeaponAim
// [0x00820002] 
struct AUTVehicle_execGetWeaponAim_Parms
{
	class AUTVehicleWeapon*                            VWeapon;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  SocketLocation;                                   		// 0x0010 (0x000C) [0x0000000000000000]              
	// struct FVector                                  CameraLocation;                                   		// 0x001C (0x000C) [0x0000000000000000]              
	// struct FVector                                  RealAimPoint;                                     		// 0x0028 (0x000C) [0x0000000000000000]              
	// struct FVector                                  DesiredAimPoint;                                  		// 0x0034 (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x0040 (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitRotation;                                      		// 0x004C (0x000C) [0x0000000000000000]              
	// struct FRotator                                 CameraRotation;                                   		// 0x0058 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 SocketRotation;                                   		// 0x0064 (0x000C) [0x0000000000000000]              
	// class AController*                              C;                                                		// 0x0070 (0x0004) [0x0000000000000000]              
	// class APlayerController*                        PC;                                               		// 0x0074 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.GetPhysicalFireStartLoc
// [0x00020102] 
struct AUTVehicle_execGetPhysicalFireStartLoc_Parms
{
	class AGameWeapon*                                 ForWeapon;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class AUTVehicleWeapon*                         VWeap;                                            		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.GetEffectLocation
// [0x00820102] 
struct AUTVehicle_execGetEffectLocation_Parms
{
	int                                                SeatIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  SocketLocation;                                   		// 0x0010 (0x000C) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.GetBarrelLocationAndRotation
// [0x00424902] ( FUNC_Event )
struct AUTVehicle_eventGetBarrelLocationAndRotation_Parms
{
	int                                                SeatIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     SocketLocation;                                   		// 0x0004 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FRotator                                    SocketRotation;                                   		// 0x0010 (0x000C) [0x0000000000000190]              ( CPF_OptionalParm | CPF_Parm | CPF_OutParm )
};

// Function GridVehicle.UTVehicle.ClearFlashLocation
// [0x00020002] 
struct AUTVehicle_execClearFlashLocation_Parms
{
	class AWeapon*                                     Who;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class AUTVehicleWeapon*                         VWeap;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.SetFlashLocation
// [0x00020102] 
struct AUTVehicle_execSetFlashLocation_Parms
{
	class AWeapon*                                     Who;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      FireModeNum;                                      		// 0x0004 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     NewLoc;                                           		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// class AUTVehicleWeapon*                         VWeap;                                            		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function GridVehicle.UTVehicle.IncrementFlashCount
// [0x00020102] 
struct AUTVehicle_execIncrementFlashCount_Parms
{
	class AWeapon*                                     Who;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      FireModeNum;                                      		// 0x0004 (0x0001) [0x0000000000000080]              ( CPF_Parm )
