/*
#############################################################################################
# Spec Ops The Line (idk) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: SRGame_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_CONST_NbMajorPerkLevel                             2
#define CONST_CONST_NbMajorPerks                                 8
#define CONST_UnlockItemShift                                    16
#define CONST_UnlockItemMaskValue                                0x00ff
#define CONST_YPSI_Stat_MaxLimit                                 498
#define CONST_YPSI_ExtraStats40                                  498
#define CONST_YPSI_ExtraStats39                                  497
#define CONST_YPSI_ExtraStats38                                  496

	YSQUADIMAGE_BothDown                               = 3,
	YSQUADIMAGE_MAX                                    = 4
};*/

// Enum SRGame.YUIScoreboardPanel.YE_ColumnDataDisplayType
/*enum YE_ColumnDataDisplayType
{
	YCDDT_OneLabelCells                                = 0,
	YCDDT_RankIconCells                                = 1,
	YCDDT_OneLabelColumn                               = 2,
	YCDDT_ConnectionIconCells                          = 3,
	YCDDT_SpacerColumn                                 = 4,
	YCDDT_MAX                                          = 5
};*/

// Enum SRGame.YUIScoreboardPanel.YE_CellTextState
/*enum YE_CellTextState
{
	YCTS_Normal                                        = 0,
	YCTS_Glow                                          = 1,
	YCTS_MAX                                           = 2
};*/

// Enum SRGame.YUIScoreboardPanel_KillsLeaderboard.YE_ColumnDisplayType
/*enum YE_ColumnDisplayType
{
	YCDT_OneLabelCells                                 = 0,
	YCDT_RankIconCells                                 = 1,
	YCDT_SpacerColumn                                  = 2,
	YCDT_MAX                                           = 3
};*/

// Enum SRGame.YUnrealScriptStudioParserBuster.ESubID1
/*enum ESubID1
{
	SUBID1                                             = 0,
	SUBID101                                           = 1,
	SUBID102                                           = 2,
	SUBID103                                           = 3,
	SUBID104                                           = 4,
	SUBID1_MAX                                         = 5
};*/

// Enum SRGame.YUnrealScriptStudioParserBuster.EGroupID
/*enum EGroupID
{
	Group                                              = 0,
	Group01                                            = 1,
	Group_MAX                                          = 2
};*/

// Enum SRGame.YUnrealScriptStudioParserBuster.ESubID2
/*enum ESubID2
{
	SUBID2                                             = 0,
	SUBID201                                           = 1,
	SUBID202                                           = 2,
	SUBID203                                           = 3,
	SUBID204                                           = 4,
	SUBID2_MAX                                         = 5
};*/

// Enum SRGame.YWeapon_Shotgun.YE_ShotgunImpactPriority
/*enum YE_ShotgunImpactPriority
{
	YSIP_World                                         = 0,
	YSIP_Destructible                                  = 1,
	YSIP_Explosive                                     = 2,
	YSIP_CheapShooter                                  = 3,
	YSIP_Pawn                                          = 4,
	YSIP_MAX                                           = 5
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class SRGame.GameNote
// 0x001C (0x0214 - 0x01F8)
class AGameNote : public AActor
{
public:
	class UGameNoteRenderComponent*                    m_text;                                           		// 0x01F8 (0x0004) [0x00000000040A000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject | CPF_EditConst | CPF_Component | CPF_EditInline )
	struct FNoteProperties                             m_replicationProps;                               		// 0x01FC (0x0018) [0x0000000000400020]              ( CPF_Net | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1421 ];

		return pClassPointer;
	};

	void OnToggle ( class USeqAct_Toggle* Action );
	void PostBeginPlay ( );
	void ReplicatedEvent ( struct FName VarName );
	void ForceUpdateData ( );
};

UClass* AGameNote::pClassPointer = NULL;

// Class SRGame.GameNoteRenderComponent
// 0x0018 (0x0218 - 0x0200)
class UGameNoteRenderComponent : public UPrimitiveComponent
{
public:
	struct FNoteProperties                             m_props;                                          		// 0x0200 (0x0018) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1422 ];

		return pClassPointer;
	};

};

UClass* UGameNoteRenderComponent::pClassPointer = NULL;

// Class SRGame.YAAAResolve
// 0x0000 (0x0061 - 0x0061)
class UYAAAResolve : public UPostProcessEffect
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1423 ];

		return pClassPointer;
	};

};

UClass* UYAAAResolve::pClassPointer = NULL;

// Class SRGame.YActorFactory_CombatPosSet
// 0x0000 (0x005C - 0x005C)
class UYActorFactory_CombatPosSet : public UActorFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1424 ];

		return pClassPointer;
	};

};

UClass* UYActorFactory_CombatPosSet::pClassPointer = NULL;

// Class SRGame.YActorFactory_YAISpawnPoint
// 0x0000 (0x005C - 0x005C)
class UYActorFactory_YAISpawnPoint : public UActorFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1425 ];

		return pClassPointer;
	};

};

UClass* UYActorFactory_YAISpawnPoint::pClassPointer = NULL;

// Class SRGame.YActorFactory_YPlayerStart
// 0x0000 (0x005C - 0x005C)
class UYActorFactory_YPlayerStart : public UActorFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1426 ];

		return pClassPointer;
	};

};

UClass* UYActorFactory_YPlayerStart::pClassPointer = NULL;

// Class SRGame.YAIBlockingVolume
// 0x0000 (0x0238 - 0x0238)
class AYAIBlockingVolume : public ABlockingVolume
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1427 ];

		return pClassPointer;
	};

};

UClass* AYAIBlockingVolume::pClassPointer = NULL;

// Class SRGame.YAIFakeTarget
// 0x0018 (0x0210 - 0x01F8)
class AYAIFakeTarget : public AActor
{
public:
	struct FPointer                                    m_kynapseConnector;                               		// 0x01F8 (0x0004) [0x0000000000001000]              ( CPF_Native )
	float                                              m_width;                                          		// 0x01FC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_height;                                         		// 0x0200 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_usageCount;                                     		// 0x0204 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                m_entityConnectorType;                            		// 0x0208 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class AYCheapShooter*                              m_cheapShooter;                                   		// 0x020C (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1428 ];

		return pClassPointer;
	};

	void ConnectEntity ( );
	void PostBeginPlay ( );
};

UClass* AYAIFakeTarget::pClassPointer = NULL;

// Class SRGame.YAssetReference
// 0x001C (0x0058 - 0x003C)
class UYAssetReference : public UObject
{
public:
	class UClass*                                      m_assetClass;                                     		// 0x003C (0x0004) [0x0000000000000000]              
	struct FName                                       m_referencePath;                                  		// 0x0040 (0x0008) [0x0000000000000000]              
	class UObject*                                     m_referenceObject;                                		// 0x0048 (0x0004) [0x0000000000000000]              
	TArray< class UObject* >                           m_forcedReferences;                               		// 0x004C (0x000C) [0x0000000000422003]              ( CPF_Edit | CPF_Const | CPF_Transient | CPF_EditConst | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1429 ];

		return pClassPointer;
	};

	class UObject* GetReference ( );
	void SetReference ( class UClass* assetClass, struct FName referencePath );
};

UClass* UYAssetReference::pClassPointer = NULL;

// Class SRGame.YBadge
// 0x0014 (0x0050 - 0x003C)
class UYBadge : public UObject
{
public:
	struct FString                                     m_badgeName;                                      		// 0x003C (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	unsigned char                                      m_ChallengeEnum;                                  		// 0x0048 (0x0001) [0x0000000000000000]              
	int                                                m_UnlockLevel;                                    		// 0x004C (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1430 ];

		return pClassPointer;
	};

	struct FName StaticGetProviderTag ( );
	struct FString StaticGetBadgeFriendlyName ( int Index );
};

UClass* UYBadge::pClassPointer = NULL;

// Class SRGame.YBlockingVolume
// 0x0004 (0x023C - 0x0238)
class AYBlockingVolume : public ABlockingVolume
{
public:
	unsigned long                                      m_blockCamera : 1;                                		// 0x0238 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1431 ];

		return pClassPointer;
	};

};

UClass* AYBlockingVolume::pClassPointer = NULL;

// Class SRGame.YBoneData
// 0x0004 (0x0040 - 0x003C)
class UYBoneData : public UObject
{
public:
	unsigned long                                      m_vaporizeEnemies : 1;                            		// 0x003C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_civilianDamage : 1;                             		// 0x003C (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      m_explodingHeads : 1;                             		// 0x003C (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      m_toughExecutions : 1;                            		// 0x003C (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1432 ];

		return pClassPointer;
	};

};

UClass* UYBoneData::pClassPointer = NULL;

// Class SRGame.YCameraActor
// 0x0010 (0x0378 - 0x0368)
class AYCameraActor : public ACameraActor
{
public:
	struct FString                                     CameraName;                                       		// 0x0368 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	int                                                OrderIndex;                                       		// 0x0374 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1433 ];

		return pClassPointer;
	};

	void DisplayDebug ( class AHUD* HUD, float* out_YL, float* out_YPos );
};

UClass* AYCameraActor::pClassPointer = NULL;

// Class SRGame.YLookatCameraActor
// 0x0044 (0x03BC - 0x0378)
class AYLookatCameraActor : public AYCameraActor
{
public:
	class AActor*                                      m_target;                                         		// 0x0378 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class AActor*                                      m_lookAtTarget;                                   		// 0x037C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     m_targetOffset;                                   		// 0x0380 (0x000C) [0x0000000000000000]              
	struct FTPOV                                       m_lastPOV;                                        		// 0x038C (0x001C) [0x0000000000000000]              
	float                                              m_distanceToTarget;                               		// 0x03A8 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              m_minAngle;                                       		// 0x03AC (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              m_maxAngle;                                       		// 0x03B0 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              m_minAngleInterpSpeed;                            		// 0x03B4 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              m_lookAtAngleInterp;                              		// 0x03B8 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1434 ];

		return pClassPointer;
	};

	void RotateAroundTarget ( struct FRotator DeltaRot, float dt );
	struct FVector GetTargetLocationWithOffset ( );
	void GetCameraView ( float DeltaTime, struct FTPOV* OutPOV );
	void SetLookatTarget ( class AActor* Target );
	void SetTarget ( class AActor* Target, struct FVector TargetOffset );
	void DisplayDebug ( class AHUD* HUD, float* out_YL, float* out_YPos );
};

UClass* AYLookatCameraActor::pClassPointer = NULL;

// Class SRGame.YCheatManager
// 0x0000 (0x005C - 0x005C)
class UYCheatManager : public UCheatManager
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1435 ];

		return pClassPointer;
	};

	void TriggerLiveTuning ( );
	void OnReadGameNewsCompleted ( unsigned long bWasSuccessful, unsigned char NewsType );
	void TriggerNewsRead ( );
	void ResetPerkStats ( );
	void GetStatProgress ( int statistic );
	void SetRemainingTime ( int secondsLeft );
	void ProfileResetCharacter ( );
	void DisplayPlayersCount ( );
	void OnReadPlayersCountCompleted ( unsigned long bSuccesful, int Count );
	void SendKeepAlive ( );
	void UnmarkHardwareStatsAsUploaded ( );
	void UpdateAchievement ( unsigned char achievement, int Value );
	void ToggleAiStuckResponse ( );
	void ClearProfileStats ( );
	void ResetProfileStat ( struct FString YPSIName );
	void IncrementProfileStat_Menu ( struct FString YPSIName, int Value, unsigned char TeamID );
	void IncrementProfileStat ( struct FString YPSIName, int Value );
	void SetExodusProgressLevel ( int Level );
	void SetCommunityChallengeState ( int ChallengeID, unsigned long bAchieved );
	void ClearUnlockedItem ( );
	void SetProfilePrestigeLevelForPlayer ( int PlayerID, int Value );
	void SetProfileRankForPlayer ( int PlayerID, int Value );
	void SetProfileXPForPlayer ( int PlayerID, int Value );
	void DumpSceneStack ( );
	class APlayerReplicationInfo* GetPlayerByScoreboardPos ( int PlayerID );
	void SetProfilePrestigeLevelForAll ( int Value );
	void SetProfileRankForAll ( int Value );
	void SetProfileXPForAll ( int Value );
	void SetProfilePrestigeLevel ( int Value );
	void SetStatProgress ( int statistic, int Value );
	void PerkLevel2Toggle ( );
	void SetProfileRank ( int Value );
	void SetProfileXP ( int Value );
	void GVXP ( int Amount );
	void DrawMatch ( );
	void LoseMatch ( );
	void WinMatch ( struct FString Param );
	void EvilTakeover ( );
	void KillFriends ( );
	void KillEnemies ( );
	void MPRegenerateCharacterList ( struct FString Provider, int magicNumber );
	void MPLogCharacterList ( int Team, unsigned long bLogAI );
	void Crash ( );
	void UnlockAllIntelCollectibles ( );
	void DumpMissionProgress ( );
	void ResetMissionProgress ( );
	void UnlockMissionPersistent ( unsigned char mission, unsigned char diff );
	void TestMissionCompleted ( unsigned char Difficulty );
	void ClearAllCollectiblesPersistent ( );
	void SetLastPlayedMissionPersistent ( int Idx );
	void UnlockAllMissionsPersistent ( );
	void Gods ( );
	void pGod ( );
	void God ( );
	void DebugLogToScreen ( struct FString Message );
	void DemiGods ( );
	void demiGod ( );
	void testMB ( );
	unsigned char Grenade ( struct FString grenadeTypeStr );
	class AWeapon* GiveWeapon ( struct FString WeaponClassStr );
	void FakeAmmo ( );
	void AllWeapons ( );
	void InfiniteGrenades ( );
	void AllAmmo ( );
	void DebugSloMo ( float TimeScale );
	void ToggleEventTracker ( );
	void ClearAchievementsOnStart ( );
};

UClass* UYCheatManager::pClassPointer = NULL;

// Class SRGame.YConfigFileCreationDummy
// 0x0000 (0x003C - 0x003C)
class UYConfigFileCreationDummy : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1436 ];

		return pClassPointer;
	};

};

UClass* UYConfigFileCreationDummy::pClassPointer = NULL;

// Class SRGame.YCustomAnimationBase
// 0x0031 (0x006D - 0x003C)
class UYCustomAnimationBase : public UObject
{
public:
	struct FName                                       m_animName;                                       		// 0x003C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       m_animNameAdditive;                               		// 0x0044 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UAnimSet*                                    m_animSet;                                        		// 0x004C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     m_alignPosition;                                  		// 0x0050 (0x000C) [0x0000000000000000]              
	struct FVector                                     m_alignDirection;                                 		// 0x005C (0x000C) [0x0000000000000000]              
	unsigned long                                      m_disableLookAt : 1;                              		// 0x0068 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned char                                      m_aimingPose;                                     		// 0x006C (0x0001) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1437 ];

		return pClassPointer;
	};

	struct FName GetAnimName ( );
};

UClass* UYCustomAnimationBase::pClassPointer = NULL;

// Class SRGame.YDamageType
// 0x003C (0x00C4 - 0x0088)
class UYDamageType : public UDamageType
{
public:
	unsigned long                                      m_neverKills : 1;                                 		// 0x0088 (0x0004) [0x0000000000004001] [0x00000001] ( CPF_Edit | CPF_Config )
	unsigned long                                      m_allowDeathAnimation : 1;                        		// 0x0088 (0x0004) [0x0000000000004001] [0x00000002] ( CPF_Edit | CPF_Config )
	unsigned long                                      m_preventDBNO : 1;                                		// 0x0088 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      m_isExecution : 1;                                		// 0x0088 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      m_isExplosive : 1;                                		// 0x0088 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      m_isFire : 1;                                     		// 0x0088 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      m_ignorePawnInstantDeathAvoidance : 1;            		// 0x0088 (0x0004) [0x0000000000004001] [0x00000040] ( CPF_Edit | CPF_Config )
	unsigned long                                      m_canDestroyRadiomanSpeakers : 1;                 		// 0x0088 (0x0004) [0x0000000000000000] [0x00000080] 
	unsigned char                                      m_weaponEnum;                                     		// 0x008C (0x0001) [0x0000000000000002]              ( CPF_Const )
	unsigned char                                      m_impactType;                                     		// 0x008D (0x0001) [0x0000000000000000]              
	unsigned char                                      m_impactTypeKillShot;                             		// 0x008E (0x0001) [0x0000000000000000]              
	struct FString                                     m_damageIconCharacter;                            		// 0x0090 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	float                                              m_hitReactionProbabilityMod;                      		// 0x009C (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              m_hitReactionBigProbabilityMod;                   		// 0x00A0 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              m_maxPhysImpulse;                                 		// 0x00A4 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              m_burnDuration;                                   		// 0x00A8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              m_burnDamageInterval;                             		// 0x00AC (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                m_burnDamageAmount;                               		// 0x00B0 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              m_sfxDuration;                                    		// 0x00B4 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	TArray< struct FYS_DamageCamShakeParams >          m_damageCamShakes;                                		// 0x00B8 (0x000C) [0x0000000000404001]              ( CPF_Edit | CPF_Config | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1438 ];

		return pClassPointer;
	};

};

UClass* UYDamageType::pClassPointer = NULL;

// Class SRGame.YDamageType_Scripted
// 0x0000 (0x00C4 - 0x00C4)
class UYDamageType_Scripted : public UYDamageType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1439 ];

		return pClassPointer;
	};

};

UClass* UYDamageType_Scripted::pClassPointer = NULL;

// Class SRGame.YDamageType_Suicide
// 0x0000 (0x00C4 - 0x00C4)
class UYDamageType_Suicide : public UYDamageType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1440 ];

		return pClassPointer;
	};

};

UClass* UYDamageType_Suicide::pClassPointer = NULL;

// Class SRGame.YDecalManager
// 0x0030 (0x0258 - 0x0228)
class AYDecalManager : public ADecalManager
{
public:
	struct FPointer                                    m_pDecalClusterManager;                           		// 0x0228 (0x0004) [0x0000000000001000]              ( CPF_Native )
	unsigned long                                      m_bStopDecalProcessing : 1;                       		// 0x022C (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              m_clusterRadius[ 0x3 ];                           		// 0x0230 (0x000C) [0x0000000000004000]              ( CPF_Config )
	int                                                m_maxDecalPerCluster[ 0x2 ];                      		// 0x023C (0x0008) [0x0000000000004000]              ( CPF_Config )
	float                                              m_occlusionPSRadius;                              		// 0x0244 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                m_pawnGroundBloodCounter;                         		// 0x0248 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FYS_DelayedImpactSound >            m_impactSounds;                                   		// 0x024C (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1441 ];

		return pClassPointer;
	};

	void ForceTick ( float DeltaTime );
	void Reset ( );
	class UDecalComponent* SpawnDecalWithLifetime ( class UMaterialInterface* DecalMaterial, struct FVector DecalLocation, struct FRotator DecalOrientation, float Width, float Height, float Thickness, unsigned long bNoClip, float DecalRotation, class UPrimitiveComponent* HitComponent, unsigned long bProjectOnTerrain, unsigned long bProjectOnSkeletalMeshes, struct FName HitBone, int HitNodeIndex, int HitLevelIndex, float InDecalLifeSpan, float BackfaceAngle, struct FVector2D InBlendRange );
	class UDecalComponent* SpawnDecalWithLifetimeNative ( class UMaterialInterface* DecalMaterial, struct FVector DecalLocation, struct FRotator DecalOrientation, float Width, float Height, float Thickness, unsigned long bNoClip, float DecalRotation, class UPrimitiveComponent* HitComponent, unsigned long bProjectOnTerrain, unsigned long bProjectOnSkeletalMeshes, struct FName HitBone, int HitNodeIndex, int HitLevelIndex, float InDecalLifeSpan, float BackfaceAngle, struct FVector2D InBlendRange );
	bool CheckFlameClusters ( struct FVector pos, float TimeOut, float Radius );
	bool CheckFootstepClusters ( struct FVector pos, float TimeOut, float Radius );
	void SetClusterRadius ( int clusterLevel, float Radius );
	void SetMaxDecalPerCluster ( int clusterLevel, int Value );
	void RemoveDecalSP ( class UDecalComponent* Decal );
};

UClass* AYDecalManager::pClassPointer = NULL;

// Class SRGame.YDestructibleObject
// 0x01A8 (0x03A0 - 0x01F8)
class AYDestructibleObject : public AActor
{
public:
	class UAudioComponent*                             m_ambientSoundComponent;                          		// 0x01F8 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	unsigned long                                      m_playFromStart : 1;                              		// 0x01FC (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_componentsSetUp : 1;                            		// 0x01FC (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	unsigned long                                      m_destroyWhenWeaponSticksThroughInCover : 1;      		// 0x01FC (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      m_destroyOnTouch : 1;                             		// 0x01FC (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      m_useExtendedBreakageConditions : 1;              		// 0x01FC (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	unsigned long                                      m_forceBreakageOnSlipOut : 1;                     		// 0x01FC (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
	unsigned long                                      m_alwaysBreakForAI : 1;                           		// 0x01FC (0x0004) [0x0000000000000001] [0x00000040] ( CPF_Edit )
	unsigned long                                      m_alwaysBreakForProjectiles : 1;                  		// 0x01FC (0x0004) [0x0000000000000001] [0x00000080] ( CPF_Edit )
	unsigned long                                      m_disableCollisionOnDestroy : 1;                  		// 0x01FC (0x0004) [0x0000000000000001] [0x00000100] ( CPF_Edit )
	unsigned long                                      m_burnable : 1;                                   		// 0x01FC (0x0004) [0x0000000000000001] [0x00000200] ( CPF_Edit )
	unsigned long                                      m_damagingEnabled : 1;                            		// 0x01FC (0x0004) [0x0000000000000001] [0x00000400] ( CPF_Edit )
	unsigned long                                      m_destroyingHitsPassRightThrough : 1;             		// 0x01FC (0x0004) [0x0000000000000001] [0x00000800] ( CPF_Edit )
	unsigned long                                      m_bAmbientSoundShouldBePlaying : 1;               		// 0x01FC (0x0004) [0x0000000000000000] [0x00001000] 
	float                                              m_ambientSoundStartDelay;                         		// 0x0200 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FYS_DestructibleSubobject >         m_subObjects;                                     		// 0x0204 (0x000C) [0x0000000000480001]              ( CPF_Edit | CPF_Component | CPF_NeedCtorLink )
	TArray< class UStaticMeshComponent* >              m_tempSubMeshes;                                  		// 0x0210 (0x000C) [0x0000000004482008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_NeedCtorLink | CPF_EditInline )
	TArray< float >                                    m_subObjectHealths;                               		// 0x021C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< float >                                    m_subObjectTempHealths;                           		// 0x0228 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< float >                                    m_tempDamageCache;                                		// 0x0234 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	int                                                m_resetCount;                                     		// 0x0240 (0x0004) [0x0000000000000020]              ( CPF_Net )
	struct FYS_ReplicatedDamageModInfo                 m_replicatedDamageMods[ 0x20 ];                   		// 0x0244 (0x0100) [0x0000000000000020]              ( CPF_Net )
	unsigned char                                      m_processedMods[ 0x20 ];                          		// 0x0344 (0x0020) [0x0000000000000000]              
	class ULightEnvironmentComponent*                  m_lightEnvironment;                               		// 0x0364 (0x0004) [0x000000000408000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject | CPF_Component | CPF_EditInline )
	float                                              m_breakageVelocity;                               		// 0x0368 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       m_damageModToApplyOnTouch;                        		// 0x036C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_maxDamagePerHit;                                		// 0x0374 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< class UClass* >                            m_vulnerableToDamageTypes;                        		// 0x0378 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FYS_AttractionActorParams >         m_attractionActor;                                		// 0x0384 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FVector                                     m_lastHitLocation;                                		// 0x0390 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	float                                              m_actorReactivationCheckDist;                     		// 0x039C (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1442 ];

		return pClassPointer;
	};

	void OnToggle ( class USeqAct_Toggle* Action );
	void UnShutDownObject ( );
	void ShutDownSubObject ( struct FYS_DestructibleSubobject* subObj );
	void DisableSubObjectsRBCollision ( );
	void ShutDownObject ( );
	void InformBasedObjectsAboutDetruction ( class AController* EventInstigator );
	void CheckSleepingObjectReactivation ( );
	void ConditionalStopAmbientSound ( );
	void StartAmbientSound ( );
	void ConditionalStartAmbientSound ( );
	void OnDestroyedEvent ( );
	void TriggerDestroyedEvent ( class AController* EventInstigator );
	void TakeDamage ( int Damage, class AController* EventInstigator, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
	void PostBeginPlay ( );
	void DamageSubObject ( int objIdx, int Damage, class AController* EventInstigator, class UClass* damType, float Delay );
	void RemoveDecals ( );
	void ApplyDamageMod ( int objIdx, int modIdx, unsigned long bPartial, class AController* DamageInstigator );
	void SpawnAttractionActor ( );
	void SetSubObjectStaticMesh ( class UStaticMesh* StaticMesh, struct FYS_DestructibleSubobject* subObj );
	void SetupComponents ( );
	void UnDestroy ( );
	void OneTimeInit ( );
	void Reset ( );
	bool TriggerDamageModAppliedEvent ( class AActor* causer, struct FYS_DestructibleSubobject* subObj, struct FYS_ObjectDamageModifier* mod );
	void ReplicateDamageMod ( int objIdx, int modIdx, unsigned long bPartial );
	void ReplicatedEvent ( struct FName VarName );
	void DestroyedByWeaponStickingThrough ( class AController* InstigatorController );
	void Touch ( class AActor* Other, class UPrimitiveComponent* OtherComp, struct FVector HitLocation, struct FVector HitNormal );
};

UClass* AYDestructibleObject::pClassPointer = NULL;

// Class SRGame.YDestructibleObjectDelayed
// 0x0010 (0x03B0 - 0x03A0)
class AYDestructibleObjectDelayed : public AYDestructibleObject
{
public:
	TArray< struct FYS_DamageToApply >                 m_damageToApply;                                  		// 0x03A0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      m_delayedDmgFuncRunning : 1;                      		// 0x03AC (0x0004) [0x0000000000000000] [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1443 ];

		return pClassPointer;
	};

	void TakeDamage ( int Damage, class AController* EventInstigator, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
	void AddDamageToDamageArray ( int subObjIdx, int modToApplyIdx, int Damage, unsigned long bPartial, class AController* EventInstigator, class UClass* DamageType, float Delay );
	void DamageSubObject ( int objIdx, int Damage, class AController* EventInstigator, class UClass* damType, float Delay );
	void DelayedDamageFunc ( );
	void TriggerDelayedDamageFunc ( );
};

UClass* AYDestructibleObjectDelayed::pClassPointer = NULL;

// Class SRGame.YDO_RadioManSpeaker
// 0x0040 (0x03E0 - 0x03A0)
class AYDO_RadioManSpeaker : public AYDestructibleObject
{
public:
	float                                              m_distanceScaleStepsize;                          		// 0x03A0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_speakerHealth;                                  		// 0x03A4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_speakerDestroyMeshOnDestruction : 1;            		// 0x03A8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_isDisabled : 1;                                 		// 0x03A8 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_isMuted : 1;                                    		// 0x03A8 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	int                                                m_collectibleID;                                  		// 0x03AC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAudioComponent*                             m_speakerAmbientSoundComponent;                   		// 0x03B0 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UStaticMesh*                                 m_speakerMesh;                                    		// 0x03B4 (0x0004) [0x0000000000000000]              
	TArray< class USoundCue* >                         m_speakerDestructionSounds;                       		// 0x03B8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UStaticMesh*                                 m_speakerDestructionMesh;                         		// 0x03C4 (0x0004) [0x0000000000000000]              
	TArray< struct FYS_MaterialReplaceMod >            m_speakerDestructoinMaterials;                    		// 0x03C8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FYS_ParticleEffectParams >          m_speakerDestructionParticleEffects;              		// 0x03D4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1444 ];

		return pClassPointer;
	};

	bool IsSpeakerEnabled ( );
	void FadeVolume ( float Time, float vol );
	void FadeIn ( float Time );
	void FadeOut ( float Time );
	void TakeDamage ( int Damage, class AController* EventInstigator, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
	void PostBeginPlay ( );
	void PreBeginPlay ( );
	void OnDestroyedEvent ( );
};

UClass* AYDO_RadioManSpeaker::pClassPointer = NULL;

// Class SRGame.YDuneActor
// 0x0030 (0x0230 - 0x0200)
class AYDuneActor : public AStaticMeshActor
{
public:
	class UStaticMesh*                                 OriginalStaticMesh;                               		// 0x0200 (0x0004) [0x0000000000000000]              
	class UStaticMesh*                                 ModifiedStaticMesh;                               		// 0x0204 (0x0004) [0x0000000000000000]              
	float                                              YCurveMaxEdgeDistance;                            		// 0x0208 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              YCurvePower;                                      		// 0x020C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              YTesselationFactor;                               		// 0x0210 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      YUseVertexColorAlignmentMask : 1;                 		// 0x0214 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      YInvertVertexColorAlignmentMask : 1;              		// 0x0214 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      YProjectOnBSP : 1;                                		// 0x0214 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      YProjectOnStaticMeshes : 1;                       		// 0x0214 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      YProjectOnTerrain : 1;                            		// 0x0214 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	float                                              YCurveMaxEdgeDistanceVertexAlpha;                 		// 0x0218 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              YCurvePowerVertexAlpha;                           		// 0x021C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      YFilterMode;                                      		// 0x0220 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	TArray< class AActor* >                            YFilter;                                          		// 0x0224 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1445 ];

		return pClassPointer;
	};

	void PreBeginPlay ( );
};

UClass* AYDuneActor::pClassPointer = NULL;

// Class SRGame.YDynamicFireLinksVolume
// 0x0004 (0x0238 - 0x0234)
class AYDynamicFireLinksVolume : public AVolume
{
public:
	unsigned long                                      m_isEnabled : 1;                                  		// 0x0234 (0x0004) [0x0000000000000000] [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1446 ];

		return pClassPointer;
	};

	void OnToggle ( class USeqAct_Toggle* Action );
};

UClass* AYDynamicFireLinksVolume::pClassPointer = NULL;

// Class SRGame.YDynamicSceneCaptureActor
// 0x0000 (0x0200 - 0x0200)
class AYDynamicSceneCaptureActor : public ASceneCapture2DActor
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1447 ];

		return pClassPointer;
	};

	class UTexture* GetTexture ( );
	bool Init ( int Width, int Height );
	bool InitComponentTexture ( );
};

UClass* AYDynamicSceneCaptureActor::pClassPointer = NULL;

// Class SRGame.YEmitter
// 0x0004 (0x0208 - 0x0204)
class AYEmitter : public AEmitter
{
public:
	class UPrimitiveComponent*                         m_belongsToComponent;                             		// 0x0204 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1448 ];

		return pClassPointer;
	};

};

UClass* AYEmitter::pClassPointer = NULL;

// Class SRGame.YGrenadeThrow
// 0x0030 (0x0238 - 0x0208)
class AYGrenadeThrow : public AYEmitter
{
public:
	unsigned char                                      m_grenadeType;                                    		// 0x0208 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_grenadeThrowMode;                               		// 0x0209 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	class AActor*                                      m_destination;                                    		// 0x020C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class AYProj_Physical*                             m_simulatedGrenade;                               		// 0x0210 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< class UClass* >                            m_grenadeTypeClasses;                             		// 0x0214 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< class UClass* >                            m_grenadeTypeClassesNoCollision;                  		// 0x0220 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< unsigned char >                            m_grenadeTypeEnums;                               		// 0x022C (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1449 ];

		return pClassPointer;
	};

	void SpawnGrenade ( class AActor* callActorMethodsHere, class UClass* grenadeClass, unsigned char throwMode, struct FVector Start, struct FVector End, float aimZ, unsigned long notifyAI, class AYProj_Physical** spawnedGrenade );
	void SpawnTrail ( class AActor* callActorMethodsHere, class UClass* grenadeClass, unsigned char throwMode, struct FVector Start, struct FVector End, float aimZ, class AYProj_Physical** spawnedGrenade );
	bool IsPIE ( );
};

UClass* AYGrenadeThrow::pClassPointer = NULL;

// Class SRGame.YErrorMarker
// 0x001C (0x0214 - 0x01F8)
class AYErrorMarker : public AActor
{
public:
	unsigned char                                      m_markerType;                                     		// 0x01F8 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     m_shortErrorDesc;                                 		// 0x01FC (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FYS_ErrorInfo >                     m_errorInfos;                                     		// 0x0208 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1450 ];

		return pClassPointer;
	};

	void SpawnNewErrorMarker ( struct FString shortErrorDesc, struct FString detailedErrorDesc, struct FVector SpawnLocation, unsigned char markerType );
	void HideAllErrorMarkers ( unsigned char markerType );
	void ShowAllErrorMarkers ( unsigned char markerType );
};

UClass* AYErrorMarker::pClassPointer = NULL;

// Class SRGame.YExplosionTriggerVolume
// 0x0000 (0x0234 - 0x0234)
class AYExplosionTriggerVolume : public AVolume
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1451 ];

		return pClassPointer;
	};

	bool StopsProjectile ( class AProjectile* P );
};

UClass* AYExplosionTriggerVolume::pClassPointer = NULL;

// Class SRGame.YFightArea
// 0x002C (0x0260 - 0x0234)
class AYFightArea : public AVolume
{
public:
	TArray< class AYAICombatPosSet* >                  m_modifiedCombatPosSets;                          		// 0x0234 (0x000C) [0x0000000000502000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< struct FYOctreeDataHndl >                  m_octreePositions;                                		// 0x0240 (0x000C) [0x0000000000502000]              ( CPF_Transient | CPF_NeedCtorLink )
	unsigned char                                      m_FightAreaId;                                    		// 0x024C (0x0001) [0x0000000000002000]              ( CPF_Transient )
	struct FVector                                     m_center;                                         		// 0x0250 (0x000C) [0x0000000000000000]              
	unsigned long                                      m_useForSquadCommands : 1;                        		// 0x025C (0x0004) [0x0000000000000000] [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1452 ];

		return pClassPointer;
	};

};

UClass* AYFightArea::pClassPointer = NULL;

// Class SRGame.YFracturedSMActorMovable
// 0x0000 (0x0260 - 0x0260)
class AYFracturedSMActorMovable : public AFracturedStaticMeshActor
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1453 ];

		return pClassPointer;
	};

	void TakeDamage ( int Damage, class AController* EventInstigator, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
	bool IsFracturedByDamageType ( class UClass* dmgType );
};

UClass* AYFracturedSMActorMovable::pClassPointer = NULL;

// Class SRGame.YGameDump
// 0x003C (0x0078 - 0x003C)
class UYGameDump : public UObject
{
public:
	struct FYS_GameDumpNode                            m_rootNode;                                       		// 0x003C (0x003C) [0x0000000000001001]              ( CPF_Edit | CPF_Native )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1454 ];

		return pClassPointer;
	};

	void AttachToRoot ( );
	void DumpToLog ( unsigned long dumpObjects );
};

UClass* UYGameDump::pClassPointer = NULL;

// Class SRGame.YGameplayEventsWriter
// 0x0000 (0x0130 - 0x0130)
class UYGameplayEventsWriter : public UGameplayEventsWriter
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1455 ];

		return pClassPointer;
	};

	void Poll ( );
	void LogControllerPositionsByClass ( );
};

UClass* UYGameplayEventsWriter::pClassPointer = NULL;

// Class SRGame.YGameplayMultiSpotComponent
// 0x0000 (0x0274 - 0x0274)
class UYGameplayMultiSpotComponent : public UStaticMeshComponent
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1456 ];

		return pClassPointer;
	};

};

UClass* UYGameplayMultiSpotComponent::pClassPointer = NULL;

// Class SRGame.YGameplayMultiSpotEditorData
// 0x0020 (0x005C - 0x003C)
class UYGameplayMultiSpotEditorData : public UObject
{
public:
	TArray< struct FYS_SubspotEditState >              m_subspotEditStates;                              		// 0x003C (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	int                                                m_curPlacedSubspotIndex;                          		// 0x0048 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      m_shallRedrawViewports : 1;                       		// 0x004C (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      m_isEditingSubspot : 1;                           		// 0x004C (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	struct FRotator                                    m_RotationHelper;                                 		// 0x0050 (0x000C) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1457 ];

		return pClassPointer;
	};

};

UClass* UYGameplayMultiSpotEditorData::pClassPointer = NULL;

// Class SRGame.YAISpawnPointEditorData
// 0x0004 (0x0060 - 0x005C)
class UYAISpawnPointEditorData : public UYGameplayMultiSpotEditorData
{
public:
	class UYAssetReference*                            m_spawnLocMesh;                                   		// 0x005C (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1458 ];

		return pClassPointer;
	};

};

UClass* UYAISpawnPointEditorData::pClassPointer = NULL;

// Class SRGame.YGameplaySpot
// 0x0010 (0x0208 - 0x01F8)
class AYGameplaySpot : public AActor
{
public:
	unsigned long                                      yEnabled : 1;                                     		// 0x01F8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	struct FVector                                     m_lastClickPos;                                   		// 0x01FC (0x000C) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1459 ];

		return pClassPointer;
	};

	void OnToggle ( class USeqAct_Toggle* Action );
};

UClass* AYGameplaySpot::pClassPointer = NULL;

// Class SRGame.YGameplayMultiSpot
// 0x0008 (0x0210 - 0x0208)
class AYGameplayMultiSpot : public AYGameplaySpot
{
public:
	class UYGameplayMultiSpotEditorData*               m_editorData;                                     		// 0x0208 (0x0004) [0x0000000004402008]              ( CPF_ExportObject | CPF_Transient | CPF_NeedCtorLink | CPF_EditInline )
	class UYGameplayMultiSpotComponent*                m_multispotComponent;                             		// 0x020C (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1460 ];

		return pClassPointer;
	};

};

UClass* AYGameplayMultiSpot::pClassPointer = NULL;

// Class SRGame.YAISpawnPoint
// 0x0014 (0x0224 - 0x0210)
class AYAISpawnPoint : public AYGameplayMultiSpot
{
public:
	TArray< struct FYS_SpawnPoint >                    m_spawnPoints;                                    		// 0x0210 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	float                                              m_minPlayerDistance;                              		// 0x021C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_minPlayerHeightDistance;                        		// 0x0220 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1461 ];

		return pClassPointer;
	};

	void SetWorldRot ( int Idx, struct FRotator Rot );
	void SetWorldPos ( int Idx, struct FVector pos );
	struct FRotator GetSpawnWorldRot ( int Idx );
	struct FVector GetSpawnWorldPos ( int Idx );
};

UClass* AYAISpawnPoint::pClassPointer = NULL;

// Class SRGame.YGameSettingsCommon
// 0x0008 (0x00CC - 0x00C4)
class UYGameSettingsCommon : public UOnlineGameSettings
{
public:
	int                                                MaxPlayers;                                       		// 0x00C4 (0x0004) [0x0000000040000000]              ( CPF_EditInlineNotify )
	int                                                MinNetPlayers;                                    		// 0x00C8 (0x0004) [0x0000000040000000]              ( CPF_EditInlineNotify )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1462 ];

		return pClassPointer;
	};

	void UpdateFromURL ( class AGameInfo* Game, struct FString* URL );
	void BuildURL ( struct FString* OutURL );
	void SetCustomMapName ( struct FString MapName );
	struct FString BlobToString ( struct FString* InBlob );
	bool StringToBlob ( struct FString* InString, struct FString* OutBlob );
};

UClass* UYGameSettingsCommon::pClassPointer = NULL;

// Class SRGame.YGameSettingsMultiplayer
// 0x0014 (0x00D8 - 0x00C4)
class UYGameSettingsMultiplayer : public UOnlineGameSettings
{
public:
	int                                                m_SpecopsMaxPlayers;                              		// 0x00C4 (0x0004) [0x0000000000000000]              
	int                                                m_KonradsMaxPlayers;                              		// 0x00C8 (0x0004) [0x0000000000000000]              
	int                                                m_KonradsMaxBots;                                 		// 0x00CC (0x0004) [0x0000000000000000]              
	int                                                m_MaxPlayers;                                     		// 0x00D0 (0x0004) [0x0000000000000000]              
