/*
#############################################################################################
# Spec Ops The Line (idk) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: SRGame_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct SRGame.GameNoteRenderComponent.NoteProperties
// 0x0018
struct FNoteProperties
{
	struct FString                                     m_text;                                           		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UFont*                                       m_font;                                           		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              m_scale;                                          		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FColor                                      m_color;                                          		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SRGame.YProfileSettings.YS_EquipmentDefault
// 0x002C
struct FYS_EquipmentDefault
{
	struct FString                                     m_name;                                           		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      m_eFactionPerk;                                   		// 0x000C (0x0001) [0x0000000000000000]              
	unsigned char                                      m_eMinorPerk1;                                    		// 0x000D (0x0001) [0x0000000000000000]              
	unsigned char                                      m_eMinorPerk2;                                    		// 0x000E (0x0001) [0x0000000000000000]              
	unsigned char                                      m_eMinorPerk3;                                    		// 0x000F (0x0001) [0x0000000000000000]              
	unsigned char                                      m_ePrimaryWeapon;                                 		// 0x0010 (0x0001) [0x0000000000000000]              
	unsigned char                                      m_eSecondaryWeapon;                               		// 0x0011 (0x0001) [0x0000000000000000]              
	unsigned char                                      m_eExplosivesWeapon;                              		// 0x0012 (0x0001) [0x0000000000000000]              
	struct FString                                     m_HeadMesh_Handle;                                		// 0x0014 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_TorsoMesh_Handle;                               		// 0x0020 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SRGame.YProfileSettings.YS_ProfileStat
// 0x0014
struct FYS_ProfileStat
{
	unsigned char                                      m_type;                                           		// 0x0000 (0x0001) [0x0000000000000000]              
	unsigned char                                      m_updateMethod;                                   		// 0x0001 (0x0001) [0x0000000000000000]              
	unsigned char                                      m_updateCondition;                                		// 0x0002 (0x0001) [0x0000000000000000]              
	unsigned long                                      m_bDoubleData : 1;                                		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                m_defaultValue;                                   		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                m_value[ 0x2 ];                                   		// 0x000C (0x0008) [0x0000000000000002]              ( CPF_Const )
};

// ScriptStruct SRGame.YProfileSettings.YS_ChallengeUnlockCondition
// 0x0010
struct FYS_ChallengeUnlockCondition
{
	TArray< int >                                      m_profileStatIDs;                                 		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_targetValue;                                    		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SRGame.YProfileSettings.YS_Challenge
// 0x0030
struct FYS_Challenge
{
	struct FString                                     m_name;                                           		// 0x0000 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_description;                                    		// 0x000C (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	int                                                m_descriptionVariable;                            		// 0x0018 (0x0004) [0x0000000000000000]              
	unsigned char                                      m_targetTeam;                                     		// 0x001C (0x0001) [0x0000000000000000]              
	unsigned char                                      m_conditionOperator;                              		// 0x001D (0x0001) [0x0000000000000000]              
	TArray< struct FYS_ChallengeUnlockCondition >      m_unlockConditions;                               		// 0x0020 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_earnedXP;                                       		// 0x002C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SRGame.YProfileSettings.YS_UnlockedCollectable
// 0x0008
struct FYS_UnlockedCollectable
{
	unsigned char                                      m_ItemType;                                       		// 0x0000 (0x0001) [0x0000000000000000]              
	int                                                m_index;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SRGame.YProfileSettings.YS_ExperienceData
// 0x00FC
struct FYS_ExperienceData
{
	int                                                m_rankLevel;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                m_xp;                                             		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                m_prestigeLevel;                                  		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                m_perkUseTimes[ 0x3C ];                           		// 0x000C (0x00F0) [0x0000000000000000]              
};

// ScriptStruct SRGame.YProfileSettings.YS_EquipmentClass
// 0x001C
struct FYS_EquipmentClass
{
	class UClass*                                      m_PrimaryWeapon;                                  		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UClass*                                      m_SecondaryWeapon;                                		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UClass*                                      m_Explosives;                                     		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UClass*                                      m_MajorPerk;                                      		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UClass*                                      m_MinorPerk1;                                     		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UClass*                                      m_MinorPerk2;                                     		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UClass*                                      m_MinorPerk3;                                     		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SRGame.YProfileSettings.YS_CharacterMeshList
// 0x0015
struct FYS_CharacterMeshList
{
	struct FName                                       m_HeadMesh_Handle;                                		// 0x0000 (0x0008) [0x0000000000000000]              
	unsigned char                                      m_HeadMesh_MaterialNum;                           		// 0x0008 (0x0001) [0x0000000000000000]              
	struct FName                                       m_TorsoMesh_Handle;                               		// 0x000C (0x0008) [0x0000000000000000]              
	unsigned char                                      m_TorsoMesh_MaterialNum;                          		// 0x0014 (0x0001) [0x0000000000000000]              
};

// ScriptStruct SRGame.YProfileSettings.YS_CharacterEquipmentList
// 0x0050
struct FYS_CharacterEquipmentList
{
	struct FString                                     CharacterName;                                    		// 0x0000 (0x000C) [0x0000000000500001]              ( CPF_Edit | CPF_NeedCtorLink )
	float                                              AiSelectionWeight;                                		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                RestrictionCount;                                 		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      MustBeSelectedByOnePlayer : 1;                    		// 0x0014 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	struct FYS_EquipmentClass                          CharacterEquipment;                               		// 0x0018 (0x001C) [0x0000000000000001]              ( CPF_Edit )
	struct FYS_CharacterMeshList                       CharacterMeshes;                                  		// 0x0034 (0x0018) [0x0000000000000001]              ( CPF_Edit )
	int                                                MajorPerkLevel;                                   		// 0x004C (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SRGame.YProfileSettings.YS_MissionProgress
// 0x0005
struct FYS_MissionProgress
{
	unsigned long                                      m_missionCompleted : 1;                           		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned char                                      m_highestDifficulty;                              		// 0x0004 (0x0001) [0x0000000000000000]              
};

// ScriptStruct SRGame.YProfileSettings.CheckpointTime
// 0x0010
struct FCheckpointTime
{
	int                                                SecondsSinceMidnight;                             		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                Day;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                Month;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                Year;                                             		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SRGame.YProfileSettings.YS_CharacterMeshAssetList
// 0x0014
struct FYS_CharacterMeshAssetList
{
	class USkeletalMesh*                               m_HeadMesh;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	class UMaterialInterface*                          m_HeadMaterial;                                   		// 0x0004 (0x0004) [0x0000000000000000]              
	class USkeletalMesh*                               m_TorsoMesh;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
	class UMaterialInterface*                          m_TorsoMaterial;                                  		// 0x000C (0x0004) [0x0000000000000000]              
	class UMaterialInterface*                          m_TorsoHandsMaterial;                             		// 0x0010 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SRGame.YProfileSettings.CheckpointEnumerationResult
// 0x0068
struct FCheckpointEnumerationResult
{
	unsigned char                                      m_checkpointFileExists[ 0x4 ];                    		// 0x0000 (0x0004) [0x0000000000100000]              
	unsigned char                                      m_checkpointFileContainsData[ 0x4 ];              		// 0x0004 (0x0004) [0x0000000000100000]              
	unsigned char                                      m_checkpointFileCorrupted[ 0x4 ];                 		// 0x0008 (0x0004) [0x0000000000100000]              
	struct FCheckpointTime                             m_checkpointTimestamp[ 0x4 ];                     		// 0x000C (0x0040) [0x0000000000100000]              
	unsigned char                                      m_checkpointDifficulty[ 0x4 ];                    		// 0x004C (0x0004) [0x0000000000100000]              
	unsigned char                                      m_chapter[ 0x4 ];                                 		// 0x0050 (0x0004) [0x0000000000100000]              
	unsigned char                                      m_mission[ 0x4 ];                                 		// 0x0054 (0x0004) [0x0000000000100000]              
	float                                              m_timePlayed[ 0x4 ];                              		// 0x0058 (0x0010) [0x0000000000100000]              
};

// ScriptStruct SRGame.YUICharacterCustomPanel.YS_ContentPackInfoItem
// 0x0010
struct UYUICharacterCustomPanel_FYS_ContentPackInfoItem
{
	unsigned long                                      m_Unlocked : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_Prefix;                                         		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SRGame.YUICharacterCustomKitPanel.YS_ResourceListItem
// 0x002C
struct FYS_ResourceListItem
{
	struct FName                                       m_AssetHandle;                                    		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FName                                       m_ResourcePath;                                   		// 0x0008 (0x0008) [0x0000000000000000]              
	struct FName                                       m_MaterialPath;                                   		// 0x0010 (0x0008) [0x0000000000000000]              
	unsigned long                                      m_RequiresReenlistment : 1;                       		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                m_UnlockLevel;                                    		// 0x001C (0x0004) [0x0000000000000000]              
	struct FString                                     m_FriendlyName;                                   		// 0x0020 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SRGame.YMPMeshLookupTable.YMP_AssetSet
// 0x02C4
struct FYMP_AssetSet
{
	class UClass*                                      m_assetClass;                                     		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FName                                       m_referencePath;                                  		// 0x0004 (0x0008) [0x0000000000000000]              
	unsigned char                                      m_usableByTeam;                                   		// 0x000C (0x0001) [0x0000000000000000]              
	struct FString                                     m_usableByClass;                                  		// 0x0010 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_UnlockLevel;                                    		// 0x001C (0x0004) [0x0000000000000000]              
	struct FName                                       m_locOnCharacter;                                 		// 0x0020 (0x0008) [0x0000000000000000]              
	struct FString                                     m_ArmorPath;                                      		// 0x0028 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                m_ArmorUnlockLevel;                               		// 0x0034 (0x0004) [0x0000000000000000]              
	struct FString                                     m_ContentPack;                                    		// 0x0038 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass;                             		// 0x0044 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath;                              		// 0x0048 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel;                            		// 0x0050 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel : 1;                		// 0x0054 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack;                            		// 0x0058 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass01;                           		// 0x0064 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath01;                            		// 0x0068 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel01;                          		// 0x0070 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel01 : 1;              		// 0x0074 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack01;                          		// 0x0078 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass02;                           		// 0x0084 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath02;                            		// 0x0088 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel02;                          		// 0x0090 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel02 : 1;              		// 0x0094 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack02;                          		// 0x0098 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass03;                           		// 0x00A4 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath03;                            		// 0x00A8 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel03;                          		// 0x00B0 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel03 : 1;              		// 0x00B4 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack03;                          		// 0x00B8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass04;                           		// 0x00C4 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath04;                            		// 0x00C8 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel04;                          		// 0x00D0 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel04 : 1;              		// 0x00D4 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack04;                          		// 0x00D8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass05;                           		// 0x00E4 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath05;                            		// 0x00E8 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel05;                          		// 0x00F0 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel05 : 1;              		// 0x00F4 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack05;                          		// 0x00F8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass06;                           		// 0x0104 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath06;                            		// 0x0108 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel06;                          		// 0x0110 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel06 : 1;              		// 0x0114 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack06;                          		// 0x0118 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass07;                           		// 0x0124 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath07;                            		// 0x0128 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel07;                          		// 0x0130 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel07 : 1;              		// 0x0134 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack07;                          		// 0x0138 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass08;                           		// 0x0144 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath08;                            		// 0x0148 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel08;                          		// 0x0150 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel08 : 1;              		// 0x0154 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack08;                          		// 0x0158 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass09;                           		// 0x0164 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath09;                            		// 0x0168 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel09;                          		// 0x0170 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel09 : 1;              		// 0x0174 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack09;                          		// 0x0178 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass10;                           		// 0x0184 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath10;                            		// 0x0188 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel10;                          		// 0x0190 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel10 : 1;              		// 0x0194 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack10;                          		// 0x0198 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass11;                           		// 0x01A4 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath11;                            		// 0x01A8 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel11;                          		// 0x01B0 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel11 : 1;              		// 0x01B4 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack11;                          		// 0x01B8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass12;                           		// 0x01C4 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath12;                            		// 0x01C8 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel12;                          		// 0x01D0 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel12 : 1;              		// 0x01D4 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack12;                          		// 0x01D8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass13;                           		// 0x01E4 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath13;                            		// 0x01E8 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel13;                          		// 0x01F0 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel13 : 1;              		// 0x01F4 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack13;                          		// 0x01F8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass14;                           		// 0x0204 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath14;                            		// 0x0208 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel14;                          		// 0x0210 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel14 : 1;              		// 0x0214 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack14;                          		// 0x0218 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass15;                           		// 0x0224 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath15;                            		// 0x0228 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel15;                          		// 0x0230 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel15 : 1;              		// 0x0234 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack15;                          		// 0x0238 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass16;                           		// 0x0244 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath16;                            		// 0x0248 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel16;                          		// 0x0250 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel16 : 1;              		// 0x0254 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack16;                          		// 0x0258 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass17;                           		// 0x0264 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath17;                            		// 0x0268 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel17;                          		// 0x0270 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel17 : 1;              		// 0x0274 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack17;                          		// 0x0278 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass18;                           		// 0x0284 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath18;                            		// 0x0288 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel18;                          		// 0x0290 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel18 : 1;              		// 0x0294 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack18;                          		// 0x0298 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      m_materialAssetClass19;                           		// 0x02A4 (0x0004) [0x0000000000000000]              
	struct FName                                       m_materialAssetPath19;                            		// 0x02A8 (0x0008) [0x0000000000000000]              
	int                                                m_materialUnlockLevel19;                          		// 0x02B0 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_materialPrestigeUnlockLevel19 : 1;              		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     m_materialContentPack19;                          		// 0x02B8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SRGame.YMPMeshLookupTable.YMP_HandleAssetPair
// 0x02CC
struct FYMP_HandleAssetPair
{
	struct FName                                       AssetHandle;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FYMP_AssetSet                               Asset;                                            		// 0x0008 (0x02C4) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SRGame.YUIFrontEnd.Kit_Data
// 0x0019
struct FKit_Data
{
	struct FString                                     m_SName;                                          		// 0x0000 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct FString                                     FriendlyName;                                     		// 0x000C (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	unsigned char                                      kitType;                                          		// 0x0018 (0x0001) [0x0000000000002000]              ( CPF_Transient )
};

// ScriptStruct SRGame.UTDataStore_GameSearchDM.PersistentLocalizedSettingValue
// 0x0008
struct FPersistentLocalizedSettingValue
{
	int                                                SettingId;                                        		// 0x0000 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                ValueId;                                          		// 0x0004 (0x0004) [0x0000000000004000]              ( CPF_Config )
};

// ScriptStruct SRGame.UTDataStore_GameSearchDM.GameSearchSettingsStorage
// 0x0014
struct FGameSearchSettingsStorage
{
	struct FName                                       GameSearchName;                                   		// 0x0000 (0x0008) [0x0000000000004000]              ( CPF_Config )
	TArray< struct FPersistentLocalizedSettingValue >  StoredValues;                                     		// 0x0008 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
};

// ScriptStruct SRGame.UTUIDataStore_StringList.EStringListData
// 0x0034
struct FEStringListData
{
	struct FName                                       Tag;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FString                                     ColumnHeaderText;                                 		// 0x0008 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     CurrentValue;                                     		// 0x0014 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                DefaultValueIndex;                                		// 0x0020 (0x0004) [0x0000000000000000]              
	TArray< struct FString >                           Strings;                                          		// 0x0024 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	class UUTUIDataProvider_StringArray*               DataProvider;                                     		// 0x0030 (0x0004) [0x0000000000002000]              ( CPF_Transient )
};

// ScriptStruct SRGame.YDataProvider_Objectives.YS_ObjectiveItem
// 0x001C
struct FYS_ObjectiveItem
{
	struct FString                                     m_objective;                                      		// 0x0000 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_detailInfo;                                     		// 0x000C (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	int                                                m_orderID;                                        		// 0x0018 (0x0004) [0x0000000000004000]              ( CPF_Config )
};

// ScriptStruct SRGame.YCoverInfo.YS_CoverFlags
// 0x0004
struct FYS_CoverFlags
{
	unsigned long                                      m_canMoveLeft : 1;                                		// 0x0000 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_canMoveRight : 1;                               		// 0x0000 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      m_canLeanLeft : 1;                                		// 0x0000 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      m_canLeanRight : 1;                               		// 0x0000 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      m_canSlipLeft : 1;                                		// 0x0000 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	unsigned long                                      m_canSlipRight : 1;                               		// 0x0000 (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
	unsigned long                                      m_canSwatLeft : 1;                                		// 0x0000 (0x0004) [0x0000000000000001] [0x00000040] ( CPF_Edit )
	unsigned long                                      m_canSwatRight : 1;                               		// 0x0000 (0x0004) [0x0000000000000001] [0x00000080] ( CPF_Edit )
	unsigned long                                      m_canMantle : 1;                                  		// 0x0000 (0x0004) [0x0000000000000001] [0x00000100] ( CPF_Edit )
	unsigned long                                      m_canLeanOver : 1;                                		// 0x0000 (0x0004) [0x0000000000000001] [0x00000200] ( CPF_Edit )
	unsigned long                                      m_canClimb : 1;                                   		// 0x0000 (0x0004) [0x0000000000000001] [0x00000400] ( CPF_Edit )
	unsigned long                                      m_canDropDown : 1;                                		// 0x0000 (0x0004) [0x0000000000000001] [0x00000800] ( CPF_Edit )
	unsigned long                                      m_canPopup : 1;                                   		// 0x0000 (0x0004) [0x0000000000000001] [0x00001000] ( CPF_Edit )
	unsigned long                                      m_canLeanAroundLeft : 1;                          		// 0x0000 (0x0004) [0x0000000000000001] [0x00002000] ( CPF_Edit )
	unsigned long                                      m_canLeanAroundRight : 1;                         		// 0x0000 (0x0004) [0x0000000000000001] [0x00004000] ( CPF_Edit )
	unsigned long                                      m_canVaultAndDropDown : 1;                        		// 0x0000 (0x0004) [0x0000000000000001] [0x00008000] ( CPF_Edit )
};

// ScriptStruct SRGame.YAICombatPosSet.YOctreeDataHndl
// 0x0004
struct FYOctreeDataHndl
{
	int                                                m_dummy;                                          		// 0x0000 (0x0004) [0x0000000000001002]              ( CPF_Const | CPF_Native )
};

// ScriptStruct SRGame.YStaticCover.YS_CoverPosInfo
// 0x0028
struct FYS_CoverPosInfo
{
	struct FYOctreeDataHndl                            m_leftCoverSlot;                                  		// 0x0000 (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FYOctreeDataHndl                            m_rightCoverSlot;                                 		// 0x0004 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              m_leftToRightPct;                                 		// 0x0008 (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FVector                                     m_location;                                       		// 0x000C (0x000C) [0x0000000000000002]              ( CPF_Const )
	struct FRotator                                    m_rotation;                                       		// 0x0018 (0x000C) [0x0000000000000002]              ( CPF_Const )
	float                                              m_height;                                         		// 0x0024 (0x0004) [0x0000000000000002]              ( CPF_Const )
};

// ScriptStruct SRGame.YStaticCover.YS_CoverData
// 0x0084
struct FYS_CoverData
{
	struct FYS_CoverPosInfo                            m_coverPosInfo;                                   		// 0x0000 (0x0028) [0x0000000000000002]              ( CPF_Const )
	unsigned long                                      m_valid : 1;                                      		// 0x0028 (0x0004) [0x0000000000000002] [0x00000001] ( CPF_Const )
	struct FVector                                     m_location;                                       		// 0x002C (0x000C) [0x0000000000000002]              ( CPF_Const )
	struct FRotator                                    m_rotation;                                       		// 0x0038 (0x000C) [0x0000000000000002]              ( CPF_Const )
	struct FVector                                     m_normal;                                         		// 0x0044 (0x000C) [0x0000000000000002]              ( CPF_Const )
	struct FVector                                     m_tangent;                                        		// 0x0050 (0x000C) [0x0000000000000002]              ( CPF_Const )
	unsigned char                                      m_type;                                           		// 0x005C (0x0001) [0x0000000000000002]              ( CPF_Const )
	struct FYS_CoverFlags                              m_flags;                                          		// 0x0060 (0x0004) [0x0000000000000002]              ( CPF_Const )
	unsigned char                                      m_leftCoverSlotAction;                            		// 0x0064 (0x0001) [0x0000000000000002]              ( CPF_Const )
	unsigned char                                      m_rightCoverSlotAction;                           		// 0x0065 (0x0001) [0x0000000000000002]              ( CPF_Const )
	float                                              m_height;                                         		// 0x0068 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              m_thickness;                                      		// 0x006C (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FYOctreeDataHndl                            m_leftCoverEnd;                                   		// 0x0070 (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FYOctreeDataHndl                            m_rightCoverEnd;                                  		// 0x0074 (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FYOctreeDataHndl                            m_adjacentCoverSlotLeft;                          		// 0x0078 (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FYOctreeDataHndl                            m_adjacentCoverSlotRight;                         		// 0x007C (0x0004) [0x0000000000000002]              ( CPF_Const )
	unsigned long                                      m_closeToLeftEdge : 1;                            		// 0x0080 (0x0004) [0x0000000000000002] [0x00000001] ( CPF_Const )
	unsigned long                                      m_closeToRightEdge : 1;                           		// 0x0080 (0x0004) [0x0000000000000002] [0x00000002] ( CPF_Const )
	unsigned long                                      m_singleSlotCover : 1;                            		// 0x0080 (0x0004) [0x0000000000000002] [0x00000004] ( CPF_Const )
};

// ScriptStruct SRGame.YStaticCover.YS_CoverSlotInfo
// 0x001C
struct FYS_CoverSlotInfo
{
	struct FVector                                     m_location;                                       		// 0x0000 (0x000C) [0x0000000000000002]              ( CPF_Const )
	struct FRotator                                    m_rotation;                                       		// 0x000C (0x000C) [0x0000000000000002]              ( CPF_Const )
	unsigned long                                      m_valid : 1;                                      		// 0x0018 (0x0004) [0x0000000000000002] [0x00000001] ( CPF_Const )
};

// ScriptStruct SRGame.YControlRestrictions.YS_ControlRestrictions
// 0x0004
struct FYS_ControlRestrictions
{
	unsigned long                                      m_look : 1;                                       		// 0x0000 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      m_pawnRotation : 1;                               		// 0x0000 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      m_walk : 1;                                       		// 0x0000 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      m_run : 1;                                        		// 0x0000 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      m_sprint : 1;                                     		// 0x0000 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	unsigned long                                      m_melee : 1;                                      		// 0x0000 (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
	unsigned long                                      m_specialMoves : 1;                               		// 0x0000 (0x0004) [0x0000000000000001] [0x00000040] ( CPF_Edit )
	unsigned long                                      m_crouch : 1;                                     		// 0x0000 (0x0004) [0x0000000000000001] [0x00000080] ( CPF_Edit )
	unsigned long                                      m_cover : 1;                                      		// 0x0000 (0x0004) [0x0000000000000001] [0x00000100] ( CPF_Edit )
	unsigned long                                      m_weaponSwitch : 1;                               		// 0x0000 (0x0004) [0x0000000000000001] [0x00000200] ( CPF_Edit )
	unsigned long                                      m_weaponSwitchFireMode : 1;                       		// 0x0000 (0x0004) [0x0000000000000001] [0x00000400] ( CPF_Edit )
	unsigned long                                      m_fire : 1;                                       		// 0x0000 (0x0004) [0x0000000000000001] [0x00000800] ( CPF_Edit )
	unsigned long                                      m_fireGrenade : 1;                                		// 0x0000 (0x0004) [0x0000000000000001] [0x00001000] ( CPF_Edit )
	unsigned long                                      m_aim : 1;                                        		// 0x0000 (0x0004) [0x0000000000000001] [0x00002000] ( CPF_Edit )
	unsigned long                                      m_reload : 1;                                     		// 0x0000 (0x0004) [0x0000000000000001] [0x00004000] ( CPF_Edit )
	unsigned long                                      m_squadControl : 1;                               		// 0x0000 (0x0004) [0x0000000000000001] [0x00008000] ( CPF_Edit )
	unsigned long                                      m_showSquadCommandIcons : 1;                      		// 0x0000 (0x0004) [0x0000000000000001] [0x00010000] ( CPF_Edit )
	unsigned long                                      m_squadCommandGoto : 1;                           		// 0x0000 (0x0004) [0x0000000000000001] [0x00020000] ( CPF_Edit )
	unsigned long                                      m_squadCommandRegroup : 1;                        		// 0x0000 (0x0004) [0x0000000000000001] [0x00040000] ( CPF_Edit )
	unsigned long                                      m_squadCommandScanning : 1;                       		// 0x0000 (0x0004) [0x0000000000000001] [0x00080000] ( CPF_Edit )
	unsigned long                                      m_squadCommandMortar : 1;                         		// 0x0000 (0x0004) [0x0000000000000001] [0x00100000] ( CPF_Edit )
	unsigned long                                      m_squadCommandAttack : 1;                         		// 0x0000 (0x0004) [0x0000000000000001] [0x00200000] ( CPF_Edit )
	unsigned long                                      m_squadCommandHold : 1;                           		// 0x0000 (0x0004) [0x0000000000000001] [0x00400000] ( CPF_Edit )
	unsigned long                                      m_squadCommandHeal : 1;                           		// 0x0000 (0x0004) [0x0000000000000001] [0x00800000] ( CPF_Edit )
	unsigned long                                      m_squadCommandOpenFire : 1;                       		// 0x0000 (0x0004) [0x0000000000000001] [0x01000000] ( CPF_Edit )
	unsigned long                                      m_squadCommandStunEnemies : 1;                    		// 0x0000 (0x0004) [0x0000000000000001] [0x02000000] ( CPF_Edit )
	unsigned long                                      m_squadCommandSuppressiveFire : 1;                		// 0x0000 (0x0004) [0x0000000000000001] [0x04000000] ( CPF_Edit )
	unsigned long                                      m_pickups : 1;                                    		// 0x0000 (0x0004) [0x0000000000000001] [0x08000000] ( CPF_Edit )
	unsigned long                                      m_execution : 1;                                  		// 0x0000 (0x0004) [0x0000000000000001] [0x10000000] ( CPF_Edit )
	unsigned long                                      m_contextCommands : 1;                            		// 0x0000 (0x0004) [0x0000000000000001] [0x20000000] ( CPF_Edit )
	unsigned long                                      m_aiReceivesCommands : 1;                         		// 0x0000 (0x0004) [0x0000000000000001] [0x40000000] ( CPF_Edit )
};

// ScriptStruct SRGame.YContextCommands.YS_ContextCommandInfo
// 0x00D8
struct FYS_ContextCommandInfo
{
	struct FString                                     m_text;                                           		// 0x0000 (0x000C) [0x0000000000408003]              ( CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     m_longText;                                       		// 0x000C (0x000C) [0x0000000000408003]              ( CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FS_MaterialInstanceConstantInfo             m_cmdIcon;                                        		// 0x0018 (0x0094) [0x0000000000404001]              ( CPF_Edit | CPF_Config | CPF_NeedCtorLink )
	unsigned char                                      m_contextCommand;                                 		// 0x00AC (0x0001) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	TArray< class AActor* >                            m_relatedActors;                                  		// 0x00B0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FVector                                     m_relatedLocation;                                		// 0x00BC (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	class UYTacticalMarkerConnector*                   m_tacticalMarkerConnector;                        		// 0x00C8 (0x0004) [0x0000000000000000]              
	unsigned char                                      m_specialAction;                                  		// 0x00CC (0x0001) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              m_delayTime;                                      		// 0x00D0 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	unsigned long                                      m_silent : 1;                                     		// 0x00D4 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_executeCommand : 1;                             		// 0x00D4 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct SRGame.YContextCommands.VisibilityFlags
// 0x0004
struct FVisibilityFlags
{
	unsigned long                                      hasSquad : 1;                                     		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      alive : 1;                                        		// 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      dbnoVisible : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      portraitVisible : 1;                              		// 0x0000 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      commandVisible : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      accessButtonVisible : 1;                          		// 0x0000 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      commandIndicatorVisible : 1;                      		// 0x0000 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      commandsRebuilt : 1;                              		// 0x0000 (0x0004) [0x0000000000000000] [0x00000080] 
};

// ScriptStruct SRGame.YSpecialActionSetTypes.YS_SpecialActionData
// 0x000C
struct FYS_SpecialActionData
{
	struct FVector                                     m_position;                                       		// 0x0000 (0x000C) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SRGame.YAISquad.YS_AttractionPointInfo
// 0x0026
struct FYS_AttractionPointInfo
{
	unsigned long                                      m_isSet : 1;                                      		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FVector                                     m_location;                                       		// 0x0004 (0x000C) [0x0000000000000000]              
	float                                              m_radius;                                         		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              m_height;                                         		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              m_minTimeAtSubstep;                               		// 0x0018 (0x0004) [0x0000000000000000]              
	unsigned char                                      m_advanceType;                                    		// 0x001C (0x0001) [0x0000000000000000]              
	unsigned char                                      m_enemyReaction;                                  		// 0x001D (0x0001) [0x0000000000000000]              
	unsigned long                                      m_reached : 1;                                    		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned char                                      m_overrideCloak;                                  		// 0x0024 (0x0001) [0x0000000000000000]              
	unsigned char                                      m_overrideMovement;                               		// 0x0025 (0x0001) [0x0000000000000000]              
};

// ScriptStruct SRGame.YAIAbstractBehaviorManager.YAIAbstractBehaviorManager_BehaviorInfo
// 0x0008
struct FYAIAbstractBehaviorManager_BehaviorInfo
{
	unsigned long                                      isStarted : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      isSuccesfull : 1;                                 		// 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      isFinished : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
	struct FUObjectHandle                              entityHandle;                                     		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SRGame.YAIPlayerSquad.YAIHandle
// 0x0004
struct AYAIPlayerSquad_FYAIHandle
{
	int                                                m_dummy;                                          		// 0x0000 (0x0004) [0x0000000000001002]              ( CPF_Const | CPF_Native )
};

// ScriptStruct SRGame.YAI_ABM_Heal.YAIHandle
// 0x0004
struct UYAI_ABM_Heal_FYAIHandle
{
	int                                                m_dummy;                                          		// 0x0000 (0x0004) [0x0000000000001002]              ( CPF_Const | CPF_Native )
};

// ScriptStruct SRGame.YAIPlayerSquad.YS_ScanReportPriority
// 0x000C
struct FYS_ScanReportPriority
{
	unsigned char                                      m_scanType;                                       		// 0x0000 (0x0001) [0x0000000000000000]              
	int                                                m_priority;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_neverFirst : 1;                                 		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_neverSecond : 1;                                		// 0x0008 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_ratherFirst : 1;                                		// 0x0008 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      m_ratherSecond : 1;                               		// 0x0008 (0x0004) [0x0000000000000000] [0x00000008] 
};

// ScriptStruct SRGame.YAIPlayerSquad.YS_SitRepOverrideData
// 0x0014
struct FYS_SitRepOverrideData
{
	int                                                m_UID;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	class AYGamePawn*                                  m_speaker;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
