/*
#############################################################################################
# Ravaged Beta (Beta) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: RavagedGame_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_MAX_DELTA_TIME                                     0.5
#define CONST_ASPECT_RATIO_ERR                                   0.0001
#define CONST_FakePlayerIndex                                    0
#define CONST_MarkupForNoMapImage                                "UDKFrontEnd.gm_map_none"
#define CONST_SERVERTYPE_LAN                                     0
#define CONST_SERVERTYPE_UNRANKED                                1
#define CONST_SERVERTYPE_RANKED                                  2

	ERS_TIME_PLAYED                                    = 6,
	ERS_VEHICLE_KILLS                                  = 7,
	ERS_BASES_CAPTURED                                 = 8,
	ERS_RESOURCES_CAPTURED                             = 9,
	ERS_MAX                                            = 10
};*/

// Enum RavagedGame.R_Resource_Depot.EDepotTeam
/*enum EDepotTeam
{
	EDT_SCAVENGERS                                     = 0,
	EDT_RESISTANCE                                     = 1,
	EDT_NEITHER_TEAM                                   = 2,
	EDT_MAX                                            = 3
};*/

// Enum RavagedGame.R_ThrustMapInfo.ClockAction
/*enum ClockAction
{
	STOP_COUNTING                                      = 0,
	KEEP_COUNTING                                      = 1,
	COUNT_BACK_UP                                      = 2,
	ClockAction_MAX                                    = 3
};*/

// Enum RavagedGame.R_Vehicle.EArmorType
/*enum EArmorType
{
	EAT_ExtraLight                                     = 0,
	EAT_Light                                          = 1,
	EAT_Medium                                         = 2,
	EAT_Heavy                                          = 3,
	EAT_MAX                                            = 4
};*/

// Enum RavagedGame.R_VehicleWeapon.EWeaponMagState
/*enum EWeaponMagState
{
	EWMS_Reloading                                     = 0,
	EWMS_None                                          = 1,
	EWMS_MAX                                           = 2
};*/

// Enum RavagedGame.R_Weapon.E_RZoomState
/*enum E_RZoomState
{
	R_ZST_NotZoomed                                    = 0,
	R_ZST_ZoomingInAnim                                = 1,
	R_ZST_ZoomingInFOV                                 = 2,
	R_ZST_ZoomingOutFOV                                = 3,
	R_ZST_ZoomingOutAnim                               = 4,
	R_ZST_Zoomed                                       = 5,
	R_ZST_MAX                                          = 6
};*/

// Enum RavagedGame.R_Weapon.EAmmoDisplayType
/*enum EAmmoDisplayType
{
	Ammo_MagWeapon                                     = 0,
	Ammo_FusedWeapon                                   = 1,
	Ammo_ThrowingKnife                                 = 2,
	Ammo_Melee                                         = 3,
	Ammo_MAX                                           = 4
};*/

// Enum RavagedGame.R_Weapon.ELoadoutType
/*enum ELoadoutType
{
	LO_Primary                                         = 0,
	LO_Secondary                                       = 1,
	LO_Melee                                           = 2,
	LO_Throwable                                       = 3,
	LO_MAX                                             = 4
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class RavagedGame.R_AlienFX
// 0x000C (0x0048 - 0x003C)
class UR_AlienFX : public UObject
{
public:
	int                                                NumDevices;                                       		// 0x003C (0x0004) [0x0000000000000000]              
	struct FColor                                      LastColor;                                        		// 0x0040 (0x0004) [0x0000000000000000]              
	unsigned long                                      EnableAlienFX : 1;                                		// 0x0044 (0x0004) [0x0000000000004000] [0x00000001] ( CPF_Config )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1526 ];

		return pClassPointer;
	};

	void SetColor ( struct FColor newColor );
	int PackColor ( struct FColor Col );
	bool SameColor ( struct FColor A, struct FColor B );
	void UpdateLights ( );
	void SetDeviceLightColorNoUpdate ( int Dev, int Light, int R, int G, int B, int A );
	int GetNumLights ( int DeviceNum );
	void NativeSetAllLight ( int packedCol );
	int GetNumDevicesDoNotCall ( );
	void SetColorDoNotCall ( int R, int G, int B, int A );
};

UClass* UR_AlienFX::pClassPointer = NULL;

// Class RavagedGame.R_CombatVolume
// 0x000C (0x020C - 0x0200)
class AR_CombatVolume : public AEnvironmentVolume
{
public:
	unsigned long                                      bLandVolume : 1;                                  		// 0x0200 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bAirVolume : 1;                                   		// 0x0200 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	int                                                OutOfBoundsTimeLand;                              		// 0x0204 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                OutOfBoundsTimeAir;                               		// 0x0208 (0x0004) [0x0000000000004000]              ( CPF_Config )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1527 ];

		return pClassPointer;
	};

	bool GetReEntryPoint ( struct FVector Position, struct FVector* ReEntryPosition );
};

UClass* AR_CombatVolume::pClassPointer = NULL;

// Class RavagedGame.R_DisplayHandler
// 0x0028 (0x0064 - 0x003C)
class UR_DisplayHandler : public UObject
{
public:
	TArray< struct FAspectRatioInfo >                  PossibleAspectRatios;                             		// 0x003C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FMonitorResolutionInfo >            DisplayResolutions;                               		// 0x0048 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      CurrentSortMode;                                  		// 0x0054 (0x0001) [0x0000000000000000]              
	struct FScriptDelegate                             __ResolutionSort__Delegate;                       		// 0x0058 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1528 ];

		return pClassPointer;
	};

	int ResolutionSort ( struct FMonitorResolutionInfo A, struct FMonitorResolutionInfo B );
	void Resort ( unsigned char NewSortMode );
	struct FString GetAspectRatioString ( int Idx );
	void CalculateAspectRatios ( );
	bool PopulateResolutions ( unsigned long bAutoSort );
	void VerifyPossibleAspectRatios ( );
	bool Equals ( float A, float B );
	void SetMaxSmoothedFrameRate ( int maxFPS );
	int GetMaxSmoothedFrameRate ( );
	void SetDefaultGamma ( );
	void SetGamma ( float decimalValue );
	void SetDynamicDecals ( unsigned long B );
	void SetPostprocess ( unsigned long B );
	void SetFullscreenMode ( int Mode );
	void SetVSync ( unsigned long B );
	void SetShadowDetail ( int Level );
	void SetTextureDetail ( int Level );
	void SetAFLevel ( int Level );
	void SetPostProcessingAALevel ( int Level );
	void SetMSAAEnabled ( int Level );
	void SetOverallQualityLevel ( int Level );
	bool GetNativeResolutions ( TArray< struct FMonitorResolutionInfo >* RezArray );
	void SetResolution ( int ResX, int ResY );
	float GetGamma ( );
	bool GetDynamicDecals ( );
	int GetPostprocessEffectsEnabled ( );
	int GetFullscreenMode ( );
	bool GetVSync ( );
	void GetDesktopResolution ( int* ResX, int* ResY );
	void GetResolution ( int* ResX, int* ResY );
	int GetAFLevel ( );
	int GetPostProcessingAALevel ( );
	int GetMSAALevel ( );
	int GetShadowDetail ( );
	int GetTextureDetail ( );
	int GetOverallQuality ( );
	void SetDefaultOverallQuality ( );
	void RevertSystemSettings ( );
	void ApplyCurrentSystemSettings ( unsigned long writeToIni );
	void InitCurrentSystemSettings ( );
};

UClass* UR_DisplayHandler::pClassPointer = NULL;

// Class RavagedGame.R_LadderVolume
// 0x0014 (0x027C - 0x0268)
class AR_LadderVolume : public ALadderVolume
{
public:
	float                                              HideWeaponAnimTime;                               		// 0x0268 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bPlayArmsPutDownAnim : 1;                         		// 0x026C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	float                                              RungDistance;                                     		// 0x0270 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BottomRungOffset;                                 		// 0x0274 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              VolumeBottom;                                     		// 0x0278 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1529 ];

		return pClassPointer;
	};

	void eventPawnLeavingVolume ( class APawn* P );
	void eventPawnEnteredVolume ( class APawn* P );
	void eventPostBeginPlay ( );
};

UClass* AR_LadderVolume::pClassPointer = NULL;

// Class RavagedGame.R_Minimap
// 0x0124 (0x0160 - 0x003C)
class UR_Minimap : public UObject
{
public:
	class UFont*                                       NumericFont;                                      		// 0x003C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class AR_HUD*                                      OwnerHUD;                                         		// 0x0040 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class APlayerController*                           LocalPC;                                          		// 0x0044 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UR_MapInfo*                                  rMapInfo;                                         		// 0x0048 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FVector                                     MapCenterWorld;                                   		// 0x004C (0x000C) [0x0000000000000000]              
	float                                              MapExtentWorld;                                   		// 0x0058 (0x0004) [0x0000000000000000]              
	float                                              ViewScale;                                        		// 0x005C (0x0004) [0x0000000000000000]              
	float                                              FlashValue;                                       		// 0x0060 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              ControlPointFlashFactor;                          		// 0x0064 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              ResourceFlashFactor;                              		// 0x0068 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              VehicleResourceFlashFactor;                       		// 0x006C (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              MapSizeScaleAmount;                               		// 0x0070 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FVector                                     MapOffsetWorld;                                   		// 0x0074 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	float                                              MapExpandToFullSpeed;                             		// 0x0080 (0x0004) [0x0000000000000000]              
	float                                              MapShrinkToNormalSpeed;                           		// 0x0084 (0x0004) [0x0000000000000000]              
	float                                              FullSizeInset;                                    		// 0x0088 (0x0004) [0x0000000000000000]              
	unsigned char                                      MapSizeState;                                     		// 0x008C (0x0001) [0x0000000000000000]              
	struct FVector2D                                   MapWindowLocation;                                		// 0x0090 (0x0008) [0x0000000000000000]              
	struct FVector2D                                   MapWindowBottomRight;                             		// 0x0098 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	struct FVector2D                                   MapWindowCenterLocation;                          		// 0x00A0 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	float                                              MapWindowSize;                                    		// 0x00A8 (0x0004) [0x0000000000000000]              
	struct FVector2D                                   MapLocationScreen;                                		// 0x00AC (0x0008) [0x0000000000002000]              ( CPF_Transient )
	struct FVector2D                                   MapCenterScreen;                                  		// 0x00B4 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	float                                              MapSizeScreen;                                    		// 0x00BC (0x0004) [0x0000000000000000]              
	class UTexture2D*                                  MapBorder;                                        		// 0x00C0 (0x0004) [0x0000000000000000]              
	class UTexture2D*                                  MapTexture;                                       		// 0x00C4 (0x0004) [0x0000000000000000]              
	struct FLinearColor                                MapBorderDrawColor;                               		// 0x00C8 (0x0010) [0x0000000000000000]              
	struct FLinearColor                                EmptyVehicleColor;                                		// 0x00D8 (0x0010) [0x0000000000000000]              
	struct FLinearColor                                LocalPlayerColor;                                 		// 0x00E8 (0x0010) [0x0000000000000000]              
	float                                              CurZoomf;                                         		// 0x00F8 (0x0004) [0x0000000000000000]              
	float                                              NormalZoomf;                                      		// 0x00FC (0x0004) [0x0000000000000000]              
	float                                              MaxZoomf;                                         		// 0x0100 (0x0004) [0x0000000000000000]              
	float                                              MinZoomf;                                         		// 0x0104 (0x0004) [0x0000000000000000]              
	float                                              NewZoomf;                                         		// 0x0108 (0x0004) [0x0000000000000000]              
	float                                              OldZoomf;                                         		// 0x010C (0x0004) [0x0000000000000000]              
	float                                              ZoomSpeed;                                        		// 0x0110 (0x0004) [0x0000000000000000]              
	struct FVector2D                                   OffEdgeTexCoordsTopLeft;                          		// 0x0114 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	struct FVector2D                                   OffEdgeTexCoordsBottomRight;                      		// 0x011C (0x0008) [0x0000000000002000]              ( CPF_Transient )
	TArray< class AR_Objective* >                      ControlPoints;                                    		// 0x0124 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< class AR_Object_CTR* >                     Resources;                                        		// 0x0130 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	unsigned long                                      bClampControlPoints : 1;                          		// 0x013C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bClampResources : 1;                              		// 0x013C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bClampVehicles : 1;                               		// 0x013C (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bClampPawns : 1;                                  		// 0x013C (0x0004) [0x0000000000000000] [0x00000008] 
	class UMaterialInstanceConstant*                   MapMaterialInstance;                              		// 0x0140 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UMaterial*                                   MapMaterialReference;                             		// 0x0144 (0x0004) [0x0000000000000000]              
	class UTexture2D*                                  PlayerIcon;                                       		// 0x0148 (0x0004) [0x0000000000000000]              
	struct FVector2D                                   PlayerIconSize;                                   		// 0x014C (0x0008) [0x0000000000000000]              
	class UTexture2D*                                  PawnIcon;                                         		// 0x0154 (0x0004) [0x0000000000000000]              
	struct FVector2D                                   PawnIconIconSize;                                 		// 0x0158 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1530 ];

		return pClassPointer;
	};

	void ToggleFullMap ( );
	void eventResizeFinished ( );
	void SetZoom ( float Amount );
	void GetFullMapSizeAndLoc ( float ClipX, float ClipY, float* Size, struct FVector2D* Loc );
	void GetSmallMapSizeAndLoc ( float ClipY, float* Size, struct FVector2D* Loc );
	bool IsOnMap ( struct FVector Location );
	struct FVector GetHUDLocationNative ( struct FVector InLocation );
	void DrawResources ( class UCanvas* Canvas );
	void DrawControlPoints ( class UCanvas* Canvas );
	void DrawPawnsNative ( class UCanvas* Canvas );
	void RenderNative ( class UCanvas* Canvas );
	void Cleanup ( );
	void Initialize ( class APlayerController* rPC, class AR_HUD* rHUD );
};

UClass* UR_Minimap::pClassPointer = NULL;

// Class RavagedGame.R_NoProneVolume
// 0x0000 (0x0234 - 0x0234)
class AR_NoProneVolume : public APhysicsVolume
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1531 ];

		return pClassPointer;
	};

	void eventPawnLeavingVolume ( class APawn* Other );
	void eventPawnEnteredVolume ( class APawn* Other );
};

UClass* AR_NoProneVolume::pClassPointer = NULL;

// Class RavagedGame.R_Object_CTR
// 0x00D0 (0x03BC - 0x02EC)
class AR_Object_CTR : public AUTCarriedObject
{
public:
	float                                              PointsCaptureTeam;                                		// 0x02EC (0x0004) [0x0000000000000000]              
	float                                              PointsCapturer;                                   		// 0x02F0 (0x0004) [0x0000000000000000]              
	float                                              PointsFirstCarrier;                               		// 0x02F4 (0x0004) [0x0000000000000000]              
	float                                              PointsVehicleAssist;                              		// 0x02F8 (0x0004) [0x0000000000000000]              
	float                                              PointsReturn;                                     		// 0x02FC (0x0004) [0x0000000000000000]              
	class UStaticMeshComponent*                        StatMesh;                                         		// 0x0300 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UParticleSystem*                             RespawnEffect;                                    		// 0x0304 (0x0004) [0x0000000000000000]              
	unsigned long                                      bBringUpBright : 1;                               		// 0x0308 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bBringDownFromBright : 1;                         		// 0x0308 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bFadingOut : 1;                                   		// 0x0308 (0x0004) [0x0000000000000020] [0x00000004] ( CPF_Net )
	unsigned long                                      bRespawning : 1;                                  		// 0x0308 (0x0004) [0x0000000000000020] [0x00000008] ( CPF_Net )
	unsigned long                                      bWasClothEnabled : 1;                             		// 0x0308 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bIsBlinkVis : 1;                                  		// 0x0308 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bNoTeam : 1;                                      		// 0x0308 (0x0004) [0x0000000000000000] [0x00000040] 
	TArray< class UMaterialInstanceConstant* >         MICArray;                                         		// 0x030C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FVector                                     RunningClothVelClamp;                             		// 0x0318 (0x000C) [0x0000000000000000]              
	struct FVector                                     HoverboardingClothVelClamp;                       		// 0x0324 (0x000C) [0x0000000000000000]              
	class UParticleSystemComponent*                    SuccessfulCaptureSystem;                          		// 0x0330 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                 		// 0x0334 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	float                                              LastLocationPingTime;                             		// 0x0338 (0x0004) [0x0000000000000000]              
	class UTexture2D*                                  FriendlyHomeHUDTexture;                           		// 0x033C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   FriendlyHomeHUDTextureSize;                       		// 0x0340 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              FriendlyHomeHUDTextureScaling;                    		// 0x0348 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UTexture2D*                                  FriendlyTakenHUDTexture;                          		// 0x034C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   FriendlyTakenHUDTextureSize;                      		// 0x0350 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              FriendlyTakenHUDTextureScaling;                   		// 0x0358 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UTexture2D*                                  EnemyHUDHomeTexture;                              		// 0x035C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   EnemyHUDHomeTextureSize;                          		// 0x0360 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              EnemyHUDHomeTextureScaling;                       		// 0x0368 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UTexture2D*                                  EnemyHUDTakenTexture;                             		// 0x036C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   EnemyHUDTakenTextureSize;                         		// 0x0370 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              EnemyHUDTakenTextureScaling;                      		// 0x0378 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UTexture2D*                                  FriendlyHomeMiniMapTexture;                       		// 0x037C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   FriendlyHomeMiniMapIconSize;                      		// 0x0380 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UTexture2D*                                  FriendlyTakenMiniMapTexture;                      		// 0x0388 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   FriendlyTakenMiniMapIconSize;                     		// 0x038C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UTexture2D*                                  EnemyMiniMapHomeTexture;                          		// 0x0394 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   EnemyMiniMapHomeIconSize;                         		// 0x0398 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UTexture2D*                                  EnemyMiniMapTakenTexture;                         		// 0x03A0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   EnemyMiniMapTakenIconSize;                        		// 0x03A4 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              HUD1PZOffset;                                     		// 0x03AC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FColor                                      CTR_DrawColor;                                    		// 0x03B0 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              BlinkPeriod;                                      		// 0x03B4 (0x0004) [0x0000000000000000]              
	float                                              DistanceFromViewer;                               		// 0x03B8 (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1533 ];

		return pClassPointer;
	};

	void BroadcastTakenDroppedMessage ( class AController* EventInstigator );
	void BroadcastTakenFromBaseMessage ( class AController* EventInstigator );
	void BroadcastDroppedMessage ( class AController* EventInstigator );
	void BroadcastReturnedMessage ( );
	void SetFlagDynamicLightToNotBeDynamic ( );
	void SetFlagPropertiesToStationaryFlagState ( );
	void Drop ( class AController* Killer );
	void CustomFadeOutEffects ( );
	void bringUpBrightOff ( );
	void CustomRespawnEffects ( );
	void SameTeamTouch ( class AController* C );
	bool ValidHolder ( class AActor* Other );
	void SetHolder ( class AController* C );
	void ClientReturnedHome ( );
	bool ShouldMinimapRenderFor ( class APlayerController* PC );
	void eventOnBaseChainChanged ( );
	void Tick ( float DeltaTime );
	void RegisterWithGRI ( );
	void PostBeginPlay ( );
	void eventReplicatedEvent ( struct FName VarName );
	void BlinkHUD ( );
};

UClass* AR_Object_CTR::pClassPointer = NULL;

// Class RavagedGame.R_Objective
// 0x0060 (0x0450 - 0x03F0)
class AR_Objective : public AUTGameObjective
{
public:
	class UTexture2D*                                  IconTexture;                                      		// 0x03F0 (0x0004) [0x0000000000000000]              
	unsigned long                                      bUseTeamColorForIcon : 1;                         		// 0x03F4 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bHudVisible : 1;                                  		// 0x03F4 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	class UTexture*                                    SpawnMenuTexture;                                 		// 0x03F8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UTexture2D*                                  FriendlyHUDTexture;                               		// 0x03FC (0x0004) [0x0000000000000000]              
	class UTexture2D*                                  EnemyHUDTexture;                                  		// 0x0400 (0x0004) [0x0000000000000000]              
	class UTexture2D*                                  NeutralHUDTexture;                                		// 0x0404 (0x0004) [0x0000000000000000]              
	struct FVector2D                                   FriendlyHUDTextureSize;                           		// 0x0408 (0x0008) [0x0000000000000000]              
	struct FVector2D                                   EnemyHUDTextureSize;                              		// 0x0410 (0x0008) [0x0000000000000000]              
	struct FVector2D                                   NeutralHUDTextureSize;                            		// 0x0418 (0x0008) [0x0000000000000000]              
	float                                              FriendlyHUDTextureScaling;                        		// 0x0420 (0x0004) [0x0000000000000000]              
	float                                              EnemyHUDTextureScaling;                           		// 0x0424 (0x0004) [0x0000000000000000]              
	float                                              NeutralHUDTextureScaling;                         		// 0x0428 (0x0004) [0x0000000000000000]              
	class UTexture2D*                                  FriendlyMinimapTexture;                           		// 0x042C (0x0004) [0x0000000000000000]              
	class UTexture2D*                                  EnemyMinimapTexture;                              		// 0x0430 (0x0004) [0x0000000000000000]              
	class UTexture2D*                                  NeutralMinimapTexture;                            		// 0x0434 (0x0004) [0x0000000000000000]              
	struct FVector2D                                   FriendlyMinimapTextureSize;                       		// 0x0438 (0x0008) [0x0000000000000000]              
	struct FVector2D                                   EnemyMinimapTextureSize;                          		// 0x0440 (0x0008) [0x0000000000000000]              
	struct FVector2D                                   NeutralMinimapTextureSize;                        		// 0x0448 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1535 ];

		return pClassPointer;
	};

};

UClass* AR_Objective::pClassPointer = NULL;

// Class RavagedGame.R_Objective_ControlPoint
// 0x00CC (0x051C - 0x0450)
class AR_Objective_ControlPoint : public AR_Objective
{
public:
	unsigned char                                      CapturableBy;                                     		// 0x0450 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      StartingTeam;                                     		// 0x0451 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      CapturingTeamIndex;                               		// 0x0452 (0x0001) [0x0000000000000000]              
	TArray< class AR_PlayerStart* >                    PlayerSpawnLocations;                             		// 0x0454 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< class AR_Objective_VehicleFactory* >       ObjectiveVehicleFactories;                        		// 0x0460 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	float                                              CapPerSecond;                                     		// 0x046C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              CapAdditionalMod;                                 		// 0x0470 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              CapPerSecMax;                                     		// 0x0474 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              CurrentCaptureRate;                               		// 0x0478 (0x0004) [0x0000000000002021]              ( CPF_Edit | CPF_Net | CPF_Transient )
	float                                              FlagVirtualPosition;                              		// 0x047C (0x0004) [0x0000000000002020]              ( CPF_Net | CPF_Transient )
	float                                              FlagPhysicalPosition;                             		// 0x0480 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              FullMastReturnRate;                               		// 0x0484 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bUpdateVirtualPos : 1;                            		// 0x0488 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      bIsUsingActiveTimePeriod : 1;                     		// 0x0488 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bUseHemisphericalRadius : 1;                      		// 0x0488 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bCapturerMustHaveLineOfSight : 1;                 		// 0x0488 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	float                                              PointsNeutralize;                                 		// 0x048C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              PointsNeutralizeAssist;                           		// 0x0490 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              PointsCapture;                                    		// 0x0494 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              PointsCaptureTeam;                                		// 0x0498 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              PointsCaptureAssist;                              		// 0x049C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              LargeTriggerRadiusSq;                             		// 0x04A0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              InactiveTimePeriod;                               		// 0x04A4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              ActiveTimePeriod;                                 		// 0x04A8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              HemisphereZDelta;                                 		// 0x04AC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              LastAwardedPoints;                                		// 0x04B0 (0x0004) [0x0000000000000000]              
	class AController*                                 PlayerScorer;                                     		// 0x04B4 (0x0004) [0x0000000000000000]              
	TArray< struct FCapturingController >              T0CapControllers;                                 		// 0x04B8 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< struct FCapturingController >              T1CapControllers;                                 		// 0x04C4 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	class USkeletalMeshComponent*                      PoleSkel;                                         		// 0x04D0 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class USkeletalMeshComponent*                      FlagSkel;                                         		// 0x04D4 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UMaterialInterface*                          FlagMats[ 0x3 ];                                  		// 0x04D8 (0x000C) [0x0000000000000000]              
	float                                              FlagWindVaryPercent;                              		// 0x04E4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              LastAlarmTime;                                    		// 0x04E8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              MinTimeBetweenAlarms;                             		// 0x04EC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     FlagFullStaffTranslation;                         		// 0x04F0 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     FlagFullMastTranslation;                          		// 0x04FC (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     FlagLowMastTranslation;                           		// 0x0508 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   AmbientSoundCue;                                  		// 0x0514 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAudioComponent*                             AmbientSoundComponent;                            		// 0x0518 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1536 ];

		return pClassPointer;
	};

	void eventUpdateFlag ( float DT );
	void UpdateFlagNative ( float DT );
	void eventCaptured ( class AR_PlayerController* Scorer, unsigned long bNeutralized );
	void BaseTimer ( );
	bool NearObjective ( class APawn* P );
	void ResetObjectiveStatus ( );
	bool IsCaptured ( );
	bool eventIsActive ( );
	void UpdateWindFromMap ( );
	void ActivateTeamMesh ( );
	void ActivateFactories ( );
	void PostBeginPlay ( );
	void eventReplicatedEvent ( struct FName VarName );
};

UClass* AR_Objective_ControlPoint::pClassPointer = NULL;

// Class RavagedGame.R_Pawn_Native
// 0x0010 (0x0934 - 0x0924)
class AR_Pawn_Native : public AUTPawn
{
public:
	class AVolume*                                     CombatVolume;                                     		// 0x0924 (0x0004) [0x0000000000002020]              ( CPF_Net | CPF_Transient )
	int                                                OutOfCombatTime;                                  		// 0x0928 (0x0004) [0x0000000000000020]              ( CPF_Net )
	unsigned long                                      bOutOfBounds : 1;                                 		// 0x092C (0x0004) [0x0000000000000020] [0x00000001] ( CPF_Net )
	float                                              MaxStepHeightCrouched;                            		// 0x0930 (0x0004) [0x0000000000000002]              ( CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1538 ];

		return pClassPointer;
	};

	void OutOfCombatTimer ( );
	void eventExitCombatVolume ( );
	void eventEnterCombatVolume ( );
	void eventStartCrouch ( float HeightAdjust );
	void eventEndCrouch ( float HeightAdjust );
	void SetMaxStepHeight ( float NewMaxStepHeight );
	void NativePostRenderFor ( class APlayerController* PC, class UCanvas* Canvas, struct FVector CameraPosition, struct FVector CameraDir );
};

UClass* AR_Pawn_Native::pClassPointer = NULL;

// Class RavagedGame.R_SoundNodePerspectiveSwitch
// 0x0004 (0x0050 - 0x004C)
class UR_SoundNodePerspectiveSwitch : public USoundNode
{
public:
	unsigned long                                      bPreviewInThirdPerson : 1;                        		// 0x004C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bTickPositionUpdate : 1;                          		// 0x004C (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1539 ];

		return pClassPointer;
	};

	void eventStartUpNode ( class UAudioComponent* AC, int NodeIndex );
};

UClass* UR_SoundNodePerspectiveSwitch::pClassPointer = NULL;

// Class RavagedGame.R_SoundNodeWeapDistXFade
// 0x0008 (0x0060 - 0x0058)
class UR_SoundNodeWeapDistXFade : public USoundNodeDistanceCrossFade
{
public:
	float                                              PreviewDistance;                                  		// 0x0058 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bTickPositionUpdate : 1;                          		// 0x005C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1540 ];

		return pClassPointer;
	};

	void eventStartUpNode ( class UAudioComponent* AC, float Dist, unsigned char ActiveChildMask, float Vol1, float Vol2 );
	void eventShowOwner ( class UAudioComponent* act1, class AActor* act2 );
};

UClass* UR_SoundNodeWeapDistXFade::pClassPointer = NULL;

// Class RavagedGame.R_Vehicle_Engine
// 0x0098 (0x00E0 - 0x0048)
class UR_Vehicle_Engine : public UComponent
{
public:
	float                                              RPMMax;                                           		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              CurrentThrottle;                                  		// 0x004C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              ThrottleGoverning;                                		// 0x0050 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              CurrentEngineOutput;                              		// 0x0054 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              ThrottleIdle;                                     		// 0x0058 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              ThrottleAccelRate;                                		// 0x005C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              ThrottleDeccelRate;                               		// 0x0060 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   CurrentEngineRotation;                            		// 0x0064 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	struct FVector2D                                   CurrentEngineRotationTarget;                      		// 0x006C (0x0008) [0x0000000000002000]              ( CPF_Transient )
	float                                              TorqueFactor;                                     		// 0x0074 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   RotInputFactor;                                   		// 0x0078 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   RotMin;                                           		// 0x0080 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   RotMax;                                           		// 0x0088 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   RotChaseSpeed;                                    		// 0x0090 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     PositionRelative;                                 		// 0x0098 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     DirectionRelative;                                		// 0x00A4 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     Input1RotAxis;                                    		// 0x00B0 (0x000C) [0x0000000000000000]              
	struct FVector                                     Input2RotAxis;                                    		// 0x00BC (0x000C) [0x0000000000000000]              
	struct FVector                                     CurrentDirection;                                 		// 0x00C8 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bIdledUp : 1;                                     		// 0x00D4 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	float                                              EngineStartTime;                                  		// 0x00D8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              MinInput;                                         		// 0x00DC (0x0004) [0x0000000000000002]              ( CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1541 ];

		return pClassPointer;
	};

	struct FVector GetLocalForce ( );
	struct FVector GetLocalTorque ( );
	struct FVector NativeGetLocalTorque ( );
	void NativeUpdateEngine ( );
	void NativeApplyInputs ( float InThrottle, float InX, float InY, float DT );
	void InitEngine ( );
};

UClass* UR_Vehicle_Engine::pClassPointer = NULL;

// Class RavagedGame.R_VehicleSim_Heli
// 0x0028 (0x00B8 - 0x0090)
class UR_VehicleSim_Heli : public USVehicleSimBase
{
public:
	TArray< class UR_Vehicle_Engine* >                 HeliEngines;                                      		// 0x0090 (0x000C) [0x0000000004480009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_NeedCtorLink | CPF_EditInline )
	struct FVector                                     DragLinear;                                       		// 0x009C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              Drag;                                             		// 0x00A8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bUseMouseInputCurve : 1;                          		// 0x00AC (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              MouseInputCurveYawPoint;                          		// 0x00B0 (0x0004) [0x0000000000000000]              
	float                                              MouseInputCurvePitchPoint;                        		// 0x00B4 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1542 ];

		return pClassPointer;
	};

	void SetEnginesIdled ( unsigned long bIdledState );
	void InitEngines ( );
};

UClass* UR_VehicleSim_Heli::pClassPointer = NULL;

// Class RavagedGame.R_VehicleSimCar
// 0x013C (0x0288 - 0x014C)
class UR_VehicleSimCar : public UUDKVehicleSimCar
{
public:
	unsigned long                                      bIdledUp : 1;                                     		// 0x014C (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      bEngineWindupFourWheelsOffGround : 1;             		// 0x014C (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bAutoCenterLean : 1;                              		// 0x014C (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bAutoEjectWhenUpsideDown : 1;                     		// 0x014C (0x0004) [0x0000000000002000] [0x00000008] ( CPF_Transient )
	unsigned long                                      bTrackChassisTouching : 1;                        		// 0x014C (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bTrackChassisTouchingStarted : 1;                 		// 0x014C (0x0004) [0x0000000000002000] [0x00000020] ( CPF_Transient )
	unsigned long                                      bTrackChassisTouchingResult : 1;                  		// 0x014C (0x0004) [0x0000000000002000] [0x00000040] ( CPF_Transient )
	unsigned long                                      bAWheelWasOnGround : 1;                           		// 0x014C (0x0004) [0x0000000000000000] [0x00000080] 
	float                                              WheelLatExtremumSlipSlow;                         		// 0x0150 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              WheelLatExtremumValueSlow;                        		// 0x0154 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              WheelLatAsymptoteSlipSlow;                        		// 0x0158 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              WheelLatAsymptoteValueSlow;                       		// 0x015C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              WheelLatExtremumSlipFast;                         		// 0x0160 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              WheelLatExtremumValueFast;                        		// 0x0164 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              WheelLatAsymptoteSlipFast;                        		// 0x0168 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              WheelLatAsymptoteValueFast;                       		// 0x016C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              WheelLatLerpSpeedStart;                           		// 0x0170 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              WheelLatLerpSpeedEnd;                             		// 0x0174 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      WheelLatState;                                    		// 0x0178 (0x0001) [0x0000000000002000]              ( CPF_Transient )
	unsigned char                                      RearSlipState;                                    		// 0x0179 (0x0001) [0x0000000000002000]              ( CPF_Transient )
	float                                              RearSlipMinIn;                                    		// 0x017C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              RearSlipMinOut;                                   		// 0x0180 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              RearSlipMaxIn;                                    		// 0x0184 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              RearSlipMaxOut;                                   		// 0x0188 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              RearSlip;                                         		// 0x018C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FInterpCurveFloat                           SteerSpeedCurve;                                  		// 0x0190 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FName                                       VehicleSpeedParamName;                            		// 0x01A0 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       DriveTrainRPMParamName;                           		// 0x01A8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              EngineWindUpFactor;                               		// 0x01B0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FInterpCurveFloat                           EngineWindupCurve;                                		// 0x01B4 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	float                                              EngineWindUpSpeed;                                		// 0x01C4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              EngineWindDownSpeed;                              		// 0x01C8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              EngineWindUpMin;                                  		// 0x01CC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              EngineWindUpMax;                                  		// 0x01D0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              EngineSnapDownSpeed;                              		// 0x01D4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              EngineSnapUpSpeed;                                		// 0x01D8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     LeanRightTorquePos;                               		// 0x01DC (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     LeanLeftTorquePos;                                		// 0x01E8 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     LeanForwardTorquePos;                             		// 0x01F4 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     LeanBackwardTorquePos;                            		// 0x0200 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              LeanTorqueMax;                                    		// 0x020C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              LeanTorqueCurrentMag;                             		// 0x0210 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              AutoCenterLeanFactor;                             		// 0x0214 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   RotInputFactor;                                   		// 0x0218 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     NetTorqueVectPos;                                 		// 0x0220 (0x000C) [0x0000000000000000]              
	struct FVector                                     NetTorqueVectDir;                                 		// 0x022C (0x000C) [0x0000000000000000]              
	float                                              JumpAmount;                                       		// 0x0238 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              JumpAnimLerpUpTime;                               		// 0x023C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              JumpAnimLerpUpTimes[ 0x5 ];                       		// 0x0240 (0x0014) [0x0000000000000001]              ( CPF_Edit )
	float                                              JumpAnimLerpDownTime;                             		// 0x0254 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              JumpAnimAmounts[ 0x5 ];                           		// 0x0258 (0x0014) [0x0000000000000001]              ( CPF_Edit )
	float                                              AutoEjectMinZ;                                    		// 0x026C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              ChassisTrackStartTime;                            		// 0x0270 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              ChassisTrackActivateTime;                         		// 0x0274 (0x0004) [0x0000000000000000]              
	struct FVector                                     LastWheelOnGroundLocation;                        		// 0x0278 (0x000C) [0x0000000000000000]              
	float                                              TakeOffTime;                                      		// 0x0284 (0x0004) [0x0000000000000000]              

