/*
#############################################################################################
# Sanctum (Unknown) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: Sanctum_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_MINTIMEBETWEENPAINSOUNDS                           0.35
#define CONST_MINTIMEBETWEENPAINEFFECTS                          0.35
#define CONST_DYING_SOUND_TIMEOUT                                1.0f
#define CONST_TAKEHIT_SOUND_TIMEOUT                              1.0f
#define CONST_GIB_SOUND_TIMEOUT                                  0.33f
#define CONST_IMMUNE_SOUND_TIMEOUT                               0.1f
#define CONST_MORTAR_EXPLOTION_SOUND_TIMEOUT                     0.25f

	Build_NotEnoughCash                                = 2,
	Upgrade_Valid                                      = 3,
	Upgrade_MaxUpgraded                                = 4,
	Upgrade_NotEnoughCash                              = 5,
	NoTarget                                           = 6,
	BuildUpgradeAction_MAX                             = 7
};*/

// Enum Sanctum.SanctumWeaponBuildGun.SellAction
/*enum SellAction
{
	Sell_Valid                                         = 0,
	Sell_Invalid                                       = 1,
	NoTarget                                           = 2,
	SellAction_MAX                                     = 3
};*/

// Enum Sanctum.SanctumWeaponBuildGun.ButtonClick
/*enum ButtonClick
{
	Right                                              = 0,
	Left                                               = 1,
	Potential_Build                                    = 2,
	Any                                                = 3,
	ButtonClick_MAX                                    = 4
};*/

// Enum Sanctum.SanctumSystemSettings.ETextureLevel
/*enum ETextureLevel
{
	TL_Custom                                          = 0,
	TL_Crap                                            = 1,
	TL_Medium                                          = 2,
	TL_High                                            = 3,
	TL_Ultra                                           = 4,
	TL_MAX                                             = 5
};*/

// Enum Sanctum.SanctumSystemSettings.EQualityMode
/*enum EQualityMode
{
	QM_Low                                             = 0,
	QM_Medium                                          = 1,
	QM_High                                            = 2,
	QM_MAX                                             = 3
};*/

// Enum Sanctum.SanctumSeqAct_TogglePathNode.EOutputLinks
/*enum EOutputLinks
{
	OL_SUCCESS                                         = 0,
	OL_FAILED                                          = 1,
	OL_MAX                                             = 2
};*/

// Enum Sanctum.SanctumSystemSettingsHelper.ESoundMode
/*enum ESoundMode
{
	SM_Slow                                            = 0,
	SM_Normal                                          = 1,
	SM_MAX                                             = 2
};*/

// Enum Sanctum.SanctumSystemSettingsHelper.EDetailLevel
/*enum EDetailLevel
{
	DL_VeryLow                                         = 0,
	DL_Low                                             = 1,
	DL_Medium                                          = 2,
	DL_High                                            = 3,
	DL_VeryHigh                                        = 4,
	DL_MAX                                             = 5
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class Sanctum.SanctumAudioManagerBase
// 0x0004 (0x0044 - 0x0040)
class USanctumAudioManagerBase : public USubsystem
{
public:
	unsigned long                                      mShowDebug : 1;                                   		// 0x0040 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      mShowBoundingSphere : 1;                          		// 0x0040 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      mShowDetailedVolumeInfo : 1;                      		// 0x0040 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      mShowPriority : 1;                                		// 0x0040 (0x0004) [0x0000000000000000] [0x00000008] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1939 ];

		return pClassPointer;
	};

	void DisplayDebug ( class AHUD* HUD, float* out_YL, float* out_YPos );
	void PlayGibSound ( class USoundCue* Sound, struct FVector SoundLocation );
	void PlayDyingSound ( class USoundCue* Sound, struct FVector SoundLocation );
	void PlayTakeHitSound ( class USoundCue* Sound, struct FVector SoundLocation );
	void PlayMortarExplotionSound ( class USoundCue* Sound, struct FVector SoundLocation );
	void PlayImmuneSound ( class USoundCue* Sound, struct FVector SoundLocation, class AActor* InstigatedBy );
	void eventTick ( float DeltaTime );
};

UClass* USanctumAudioManagerBase::pClassPointer = NULL;

// Class Sanctum.SanctumEngineBase
// 0x0004 (0x07A0 - 0x079C)
class USanctumEngineBase : public UGameEngine
{
public:
	class USanctumAudioManagerBase*                    mAudioManager;                                    		// 0x079C (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1940 ];

		return pClassPointer;
	};

	void eventInitializeEngine ( );
};

UClass* USanctumEngineBase::pClassPointer = NULL;

// Class Sanctum.SanctumPawnBase
// 0x000C (0x0630 - 0x0624)
class ASanctumPawnBase : public AUDKPawn
{
public:
	struct FVector                                     mNetRelevancyLocationOffset;                      		// 0x0624 (0x000C) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1941 ];

		return pClassPointer;
	};

	bool eventIsInOverviewMode ( );
};

UClass* ASanctumPawnBase::pClassPointer = NULL;

// Class Sanctum.SanctumSteamHelper
// 0x0000 (0x003C - 0x003C)
class USanctumSteamHelper : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1942 ];

		return pClassPointer;
	};

	struct FString GetCountryCode ( );
	bool IsVACBanned ( );
	bool IsValidUrl ( struct FString URLString );
	struct FString SteamIDToString ( struct FUniqueNetId Id );
	bool HasDLCWithAppID ( int AppID );
	bool HasAcceleratorDLC ( );
	bool HasChristmasDLC ( );
	bool HasCavernDLC ( );
	bool HasViolatorDLC ( );
	bool HasSlumsDLC ( );
	bool HasBelowDLC ( );
	bool HasMine2DLC ( );
	bool HasPenetratorDLC ( );
	bool HasKillingFloorDLC ( );
	bool HasBridge2DLC ( );
	bool HasMonkeyCageDLC ( );
	bool HasFirstMapPack ( );
	bool HasJournalistDLC ( );
	void OpenStoreOverlayForDLC ( int AppID );
	void OpenWebURL ( struct FString URL );
};

UClass* USanctumSteamHelper::pClassPointer = NULL;

// Class Sanctum.SanctumSystemSettings
// 0x0000 (0x003C - 0x003C)
class USanctumSystemSettings : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1943 ];

		return pClassPointer;
	};

	bool IsChristmas ( );
	void GetAvailableResolutions ( TArray< struct FString >* resolutionArray );
	struct FString GetCurrentLanguage ( );
	void SetLanguage ( struct FString lang, unsigned long reloadObjects );
	int GetPurgedObjectCount ( );
	int GetObjectCount ( );
	void GetSupportedLanguages ( TArray< struct FString >* langArray, int* SelectedIndex );
	void getSelectedResolutionIndex ( int ResX, int ResY, int* SelectedIndex );
	void getSettingValuesNumber ( int Value, int Min, int Max, TArray< struct FString >* Settings, int* SelectedIndex );
	void getSettingValuesBool ( unsigned long Value, TArray< struct FString >* outRendererDataProvider, int* SelectedIndex );
	unsigned char GetWorldTextureLevel ( );
	void SetWorldTextureLevel ( unsigned char TextureLevel );
	void GetGraphicsSettings ( struct FGraphicsSettings* out_GraphicsSettings );
	struct FString MD5Hash ( struct FString ToHash );
	unsigned char GetShadowQuality ( struct FGraphicsSettings* out_GraphicsSettings );
	void SetShadowQuality ( unsigned char Quality, struct FGraphicsSettings* out_GraphicsSettings );
};

UClass* USanctumSystemSettings::pClassPointer = NULL;

// Class Sanctum.SanctumAchievements
// 0x0028 (0x0064 - 0x003C)
class USanctumAchievements : public UObject
{
public:
	unsigned long                                      mCollateralDamage : 1;                            		// 0x003C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      mBoomHeadshot : 1;                                		// 0x003C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      mFullyCovered : 1;                                		// 0x003C (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      mChillMan : 1;                                    		// 0x003C (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      mUSDollars : 1;                                   		// 0x003C (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      mSeeIveGotThis : 1;                               		// 0x003C (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      mBombingRaid : 1;                                 		// 0x003C (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      mBrutus : 1;                                      		// 0x003C (0x0004) [0x0000000000000000] [0x00000080] 
	unsigned long                                      mAchievementsEnabled : 1;                         		// 0x003C (0x0004) [0x0000000000000000] [0x00000100] 
	unsigned long                                      mShotsFired : 1;                                  		// 0x003C (0x0004) [0x0000000000000000] [0x00000200] 
	unsigned long                                      mOnlyGrenade : 1;                                 		// 0x003C (0x0004) [0x0000000000000000] [0x00000400] 
	unsigned long                                      mGrenadeWasFired : 1;                             		// 0x003C (0x0004) [0x0000000000000000] [0x00000800] 
	unsigned long                                      mReadWasSuccessfull : 1;                          		// 0x003C (0x0004) [0x0000000000000000] [0x00001000] 
	unsigned long                                      mParasolUp : 1;                                   		// 0x003C (0x0004) [0x0000000000000000] [0x00002000] 
	unsigned long                                      mRadioOn : 1;                                     		// 0x003C (0x0004) [0x0000000000000000] [0x00004000] 
	unsigned long                                      mGrillLit : 1;                                    		// 0x003C (0x0004) [0x0000000000000000] [0x00008000] 
	unsigned long                                      mEligibleForPickingUpThePieces : 1;               		// 0x003C (0x0004) [0x0000000000000000] [0x00010000] 
	int                                                mBlockTowers;                                     		// 0x0040 (0x0004) [0x0000000000000000]              
	int                                                mSpentMoneyBeforeLastWave;                        		// 0x0044 (0x0004) [0x0000000000000000]              
	int                                                mLifeBeforeLastWave;                              		// 0x0048 (0x0004) [0x0000000000000000]              
	int                                                mStrawBerryFish;                                  		// 0x004C (0x0004) [0x0000000000000000]              
	int                                                mStrawBerryCount;                                 		// 0x0050 (0x0004) [0x0000000000000000]              
	int                                                mSentToMonkeyCageOnWave;                          		// 0x0054 (0x0004) [0x0000000000000000]              
	int                                                mNumberOfRecievedStats;                           		// 0x0058 (0x0004) [0x0000000000000000]              
	class USanctumOnlineAchievementsStatsRead*         mAchievementsStatsRead;                           		// 0x005C (0x0004) [0x0000000000000000]              
	class USanctumOnlineAchievementsStatsWrite*        mAchievementsStatsWrite;                          		// 0x0060 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 44778 ];

		return pClassPointer;
	};

	void ReadAchievementsStatsComplete ( unsigned long bWasSuccessful );
	void ReadAllOnlineStats ( );
	void FlushAllStats ( );
	void WriteStatToViewID ( unsigned char ViewId, int StatValueDiff, unsigned char NumberOfStats );
	void UnlockAchievement ( int Index );
	bool AchievementsEnabled ( );
	void UnlockLevelComplete ( int Level, float Diff, int GameMode, float RemainingCoreLife );
	void GameEnded ( );
	void CheckNoTeleports ( );
	void NumberOfRunnersKilledWithOneGrenade ( int Number );
	void EnemyKilledWithGrenade ( );
	void SniperStraightWeakSpotKills ( int Number );
	void SniperOneClipKills ( int Number );
	void CheckForTowerDiversityOnArc ( );
	void CheckForSlowUpgrades ( );
	void CheckForTowerUpgrades ( );
	void CheckForExclusiveTowers ( );
	void NewActionPhaseAchievements ( );
	void NewBuildPhaseAchievements ( );
	void NewBlockWasBuilt ( );
	void BlockWasSold ( );
	void BombingRaid ( );
	void Brutus ( );
	void NoTowersShot ( float Difficulty );
	void shotsFired ( );
	void NoneAssaulGrenadeFired ( );
	void AssaultGrenadeFired ( );
	void CheckIfInMaxSlowFieldAndFreeze ( class ASanctumEnemy* E );
	void WeaponUpgrade ( );
	void MVP ( );
	void WaveCompleted ( class UClass* GameInfo, int Wave, int MaxPlayers, float Difficulty );
	void ToggleRadio ( unsigned long On );
	void ExpandParasol ( );
	void LightTheGrill ( );
	void CheckSummerAchievement ( );
	void ChristmasPresentCollected ( );
	void StrawberryFishHit ( int Id );
	void CleanUpAchievements ( );
};

UClass* USanctumAchievements::pClassPointer = NULL;

// Class Sanctum.SanctumOnlineAchievementsStatsWrite
// 0x0000 (0x0088 - 0x0088)
class USanctumOnlineAchievementsStatsWrite : public UOnlineStatsWrite
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 44780 ];

		return pClassPointer;
	};

};

UClass* USanctumOnlineAchievementsStatsWrite::pClassPointer = NULL;

// Class Sanctum.SanctumOnlineAchievementsStatsRead
// 0x0000 (0x0088 - 0x0088)
class USanctumOnlineAchievementsStatsRead : public UOnlineStatsRead
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 44782 ];

		return pClassPointer;
	};

};

UClass* USanctumOnlineAchievementsStatsRead::pClassPointer = NULL;

// Class Sanctum.SanctumGameInfo
// 0x00AC (0x042C - 0x0380)
class ASanctumGameInfo : public AUDKGame
{
public:
	class UClass*                                      mStartGameEvent;                                  		// 0x0380 (0x0004) [0x0000000000000000]              
	unsigned long                                      mDebug : 1;                                       		// 0x0384 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      mGameWasLoaded : 1;                               		// 0x0384 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      mTurboMode : 1;                                   		// 0x0384 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      mIsSingleplayer : 1;                              		// 0x0384 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      mIsClassicMode : 1;                               		// 0x0384 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      mFirstWave : 1;                                   		// 0x0384 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      mIsOnslaughtMode : 1;                             		// 0x0384 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      mIsRandomMode : 1;                                		// 0x0384 (0x0004) [0x0000000000000000] [0x00000080] 
	class ASanctumEnemy*                               mMarkedEnemyFirst;                                		// 0x0388 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class ASanctumEnemy*                               mMarkedEnemySecond;                               		// 0x038C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FString                                     mDifficultyName;                                  		// 0x0390 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     mOptionsString;                                   		// 0x039C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class ASanctumSpawner*                             mWaveSpawner;                                     		// 0x03A8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< class ASanctumEnemy* >                     mAllEnemies;                                      		// 0x03AC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                mLeaderboardDifficulty;                           		// 0x03B8 (0x0004) [0x0000000000000002]              ( CPF_Const )
	int                                                mLeaderboardLevel;                                		// 0x03BC (0x0004) [0x0000000000000002]              ( CPF_Const )
	int                                                mLeaderboardGamemode;                             		// 0x03C0 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              mBuildphaseDelay;                                 		// 0x03C4 (0x0004) [0x0000000000000000]              
	struct FString                                     mGameTypeName;                                    		// 0x03C8 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     mTurboString;                                     		// 0x03D4 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	int                                                mActionPhaseStartTime;                            		// 0x03E0 (0x0004) [0x0000000000000000]              
	int                                                mActionPhaseTime;                                 		// 0x03E4 (0x0004) [0x0000000000000000]              
	int                                                mHeavyWaveInterval;                               		// 0x03E8 (0x0004) [0x0000000000000000]              
	float                                              mHeavyWaveDelay;                                  		// 0x03EC (0x0004) [0x0000000000000000]              
	int                                                mRubelAccumulated;                                		// 0x03F0 (0x0004) [0x0000000000000000]              
	int                                                mDifficultyRubelAccumulated;                      		// 0x03F4 (0x0004) [0x0000000000000000]              
	int                                                mRubelGain;                                       		// 0x03F8 (0x0004) [0x0000000000000000]              
	int                                                mMaxRubel;                                        		// 0x03FC (0x0004) [0x0000000000000000]              
	int                                                mLastRubelGiven;                                  		// 0x0400 (0x0004) [0x0000000000000000]              
	float                                              mBuildphaseTime;                                  		// 0x0404 (0x0004) [0x0000000000000000]              
	int                                                mGainedRubelDuringPhase;                          		// 0x0408 (0x0004) [0x0000000000000000]              
	int                                                mDifficultyRubelsGainedDuringPhase;               		// 0x040C (0x0004) [0x0000000000000000]              
	class UClass*                                      mRubelAlgorithmClass;                             		// 0x0410 (0x0004) [0x0000000000000000]              
	int                                                mGameAddonIndex;                                  		// 0x0414 (0x0004) [0x0000000000000000]              
	class USanctumRubelAlgorithm*                      mRubelAlgorithm;                                  		// 0x0418 (0x0004) [0x0000000000000000]              
	int                                                mNumberOfWaves;                                   		// 0x041C (0x0004) [0x0000000000000000]              
	struct FString                                     NextLevel;                                        		// 0x0420 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 44822 ];

		return pClassPointer;
	};

	void collectActionEndInfo ( );
	void StopDPSTimer ( );
	void StartDPSTimer ( );
	void ForceStartWave ( );
	void DisplayCheatMessage ( );
	void setNextEnemyInfo ( int nextWave );
	void ToggleReady ( );
	void startWave ( int waveNr );
	bool isWavesLeft ( );
	int GetGameModeInt ( );
	int CreateViewIDForLeaderboard ( );
	void Pause ( class ULocalPlayer* ownedByLocalPlayer );
	void Logout ( class AController* Exiting );
	void eventPostLogin ( class APlayerController* NewPlayer );
	bool IsTrainingMode ( );
	void DisableAchievements ( class APlayerController* PC );
	bool FindInactivePRI ( class APlayerController* PC );
	void Killed ( class AController* Killer, class AController* KilledPlayer, class APawn* KilledPawn, class UClass* DamageType );
	class APawn* SpawnDefaultPawnFor ( class AController* NewPlayer, class ANavigationPoint* StartSpot );
	float RatePlayerStart ( class APlayerStart* P, unsigned char Team, class AController* Player );
	void SendToMonkeyCage ( class ASanctumPlayerController* PC );
	void ReleaseFromMonkeyCage ( class ASanctumPlayerController* PC );
	bool isFirstPlayer ( class ASanctumController* SC );
	void CheckMapDLC ( );
	class APlayerController* eventLogin ( struct FString Portal, struct FString Options, struct FUniqueNetId UniqueId, struct FString* ErrorMessage );
	void eventPreLogin ( struct FString Options, struct FString Address, struct FUniqueNetId UniqueId, unsigned long bSupportsAuth, struct FString* ErrorMessage );
	void WriteOnlineStats ( );
	void PerformEndGameHandling ( );
	void UpdateGameSettings ( );
	void OnUpdateOnlineGameComplete ( struct FName SessionName, unsigned long bWasSuccessful );
	void UpdateGameSettingsCounts ( );
	void GameOver ( class ASanctumEnemy* Killer );
	void OnStartOnlineGameComplete ( struct FName SessionName, unsigned long bWasSuccessful );
	void enemyReachedCore ( class ASanctumEnemy* Enemy );
	bool AllowCheats ( class APlayerController* P );
	void BroadCastHeavyWaveIncoming ( );
	void ToggleBuildPhase ( );
	void ScheduleBuildPhase ( );
	void eventAddDefaultInventory ( class APawn* P );
	bool AllowMutator ( struct FString MutatorClassName );
	void writeSlot ( int SlotNumber, struct FPlayerSlot* Slot );
	int findPlayerSlot ( class ASanctumController* Controller, struct FPlayerSlot* Slot );
	int findFreeSlot ( struct FPlayerSlot* Slot );
	void enemySpawned ( class ASanctumEnemy* Enemy );
	void ShowRubelGain ( );
	void AddRubelToAll ( int rubelAmount, unsigned long showReward );
	void eventToggleLevelCompleteEvent ( );
	void EnemyKilled ( class ASanctumEnemy* Enemy, class AActor* Killer );
	void KillAllEnemies ( );
	void CalculateAccumulatedRubel ( );
	struct FString difficultyToString ( unsigned char Difficulty );
	void InitGameReplicationName ( class ASanctumGameReplicationInfo* SGRI );
	void InitGameReplicationInfo ( );
	void eventInitGame ( struct FString Options, struct FString* ErrorMessage );
	void InitializeGameAddon ( struct FString* Options );
	unsigned char GetGameMode ( );
	void eventPostBeginPlay ( );
	void eventPreBeginPlay ( );
};

UClass* ASanctumGameInfo::pClassPointer = NULL;

// Class Sanctum.SanctumGameInfoEndless
// 0x0004 (0x0430 - 0x042C)
class ASanctumGameInfoEndless : public ASanctumGameInfo
{
public:
	unsigned long                                      mOnlineGameStarted : 1;                           		// 0x042C (0x0004) [0x0000000000000000] [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 44823 ];

		return pClassPointer;
	};

	void startWave ( int waveNr );
	void eventPostLogin ( class APlayerController* NewPlayer );
	class APlayerController* eventLogin ( struct FString Portal, struct FString Options, struct FUniqueNetId UniqueId, struct FString* ErrorMessage );
	void StartOnlineGame ( );
	void OnEndOnlineGameComplete ( struct FName SessionName, unsigned long bWasSuccessful );
	void OnStartOnlineGameComplete ( struct FName SessionName, unsigned long bWasSuccessful );
	void OnServerCreateComplete ( struct FName SessionName, unsigned long bWasSuccessful );
	void OnRegisterPlayerComplete ( struct FName SessionName, struct FUniqueNetId PlayerID, unsigned long bWasSuccessful );
	void OnUnregisterPlayerComplete ( struct FName SessionName, struct FUniqueNetId PlayerID, unsigned long bWasSuccessful );
	void Logout ( class AController* Exiting );
	void eventGameEnding ( );
	void eventPreExit ( );
	void DestroyOnlineGame ( );
	void CleanUpDelegates ( );
	struct FString difficultyToString ( unsigned char Difficulty );
	int GetGameModeInt ( );
	void OnDestroyOnlineGameComplete ( struct FName SessionName, unsigned long bWasSuccessful );
	void eventPostBeginPlay ( );
};

UClass* ASanctumGameInfoEndless::pClassPointer = NULL;

// Class Sanctum.SanctumController
// 0x009C (0x0910 - 0x0874)
class ASanctumController : public AUDKPlayerController
{
public:
	unsigned long                                      mTempBlockerBool : 1;                             		// 0x0874 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      mDebug : 1;                                       		// 0x0874 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      mReturnTutorialToMain : 1;                        		// 0x0874 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      mSplash : 1;                                      		// 0x0874 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      mDisconnected : 1;                                		// 0x0874 (0x0004) [0x0000000000000000] [0x00000010] 
	float                                              ConfigurableFOV;                                  		// 0x0878 (0x0004) [0x0000000000004000]              ( CPF_Config )
	class USanctumSapitu*                              mSAP;                                             		// 0x087C (0x0004) [0x0000000000000000]              
	class USanctumSapituGame*                          mGame;                                            		// 0x0880 (0x0004) [0x0000000000000000]              
	class USanctumOnlineLeaderboardRead*               mLeaderboardStatsRead;                            		// 0x0884 (0x0004) [0x0000000000000000]              
	struct FString                                     mNextLevelName;                                   		// 0x0888 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     mWebUpdateString;                                 		// 0x0894 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      mLevelsLocked;                                    		// 0x08A0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FLobbyFilters                               mLobbyFilters;                                    		// 0x08AC (0x002C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UOnlineLobbyInterfaceSteamworks*             mLobbyInterface;                                  		// 0x08D8 (0x0004) [0x0000000000000000]              
	class USanctumDataStore_OnlineGameSearch*          mSearchDataStore;                                 		// 0x08DC (0x0004) [0x0000000000000000]              
	struct FString                                     mLobbyIsFull;                                     		// 0x08E0 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     mCantConnectToLobby;                              		// 0x08EC (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     mConnectingToHostString;                          		// 0x08F8 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FScriptDelegate                             __RandomSort__Delegate;                           		// 0x0904 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 44825 ];

		return pClassPointer;
	};

	void OnLobbyInvite ( struct FUniqueNetId LobbyId, struct FUniqueNetId FriendID, unsigned long bAccepted );
	void OnLobbyJoinGame ( int LobbyIndex, struct FUniqueNetId ServerID, struct FString ServerIP, TArray< struct FActiveLobbyInfo >* LobbyList );
	void OnLobbyReceiveBinaryData ( int LobbyIndex, int MemberIndex, TArray< struct FActiveLobbyInfo >* LobbyList, TArray< unsigned char >* Data );
	void OnLobbyReceiveMessage ( int LobbyIndex, int MemberIndex, struct FString Type, struct FString Message, TArray< struct FActiveLobbyInfo >* LobbyList );
	void OnLobbyMemberStatusUpdate ( int LobbyIndex, int MemberIndex, int InstigatorIndex, struct FString Status, TArray< struct FActiveLobbyInfo >* LobbyList );
	void OnLobbyMemberSettingsUpdate ( int LobbyIndex, int MemberIndex, TArray< struct FActiveLobbyInfo >* LobbyList );
	void OnLobbySettingsUpdate ( int LobbyIndex, TArray< struct FActiveLobbyInfo >* LobbyList );
	void OnFindLobbiesComplete ( unsigned long bWasSuccessful, TArray< struct FBasicLobbyInfo >* LobbyList );
	bool HasSameVersion ( TArray< struct FLobbyMetaData > LobbySettings );
	bool HasHostname ( TArray< struct FLobbyMetaData > LobbySettings );
	void OnPingUpdated ( struct FUniqueNetId LobbyId, int Ping );
	void OnJoinLobbyComplete ( unsigned long bWasSuccessful, int LobbyIndex, struct FUniqueNetId LobbyUID, struct FString Error, TArray< struct FActiveLobbyInfo >* LobbyList );
	void JoinLobby ( struct FString LobbyId );
	void OnCreateLobbyComplete ( unsigned long bWasSuccessful, struct FUniqueNetId LobbyId, struct FString Error );
	struct FString IPToString ( int IP );
	void updateGameLobbySettings ( );
	bool getMetadataForGame ( TArray< struct FLobbyMetaData >* MetaData );
	bool isLobbyAdmin ( int* adminOfIndex );
	void findFriendsLobbies ( int mapIndex, int difficultyIndex, int playersIdx, unsigned long hideFullGames, int addonIdx );
	void FindLobbies ( int mapIndex, int difficultyIndex, int playersIdx, unsigned long hideFullGames, unsigned char lobbyDistance, int addonIdx );
	void appendDifficultyFilter ( int Difficulty, TArray< struct FLobbyFilter >* Filters );
	void appendLevelFilter ( struct FString Level, TArray< struct FLobbyFilter >* Filters );
	void leaveAllLobbies ( );
	void clearLobbyDelegates ( );
	void addLobbyDelegates ( );
	void joinedGame ( class UClass* SGI );
	void fetchLobbyInterface ( );
	void kickLobbyMember ( class ASanctumController* LobbyMember );
	void setupLobby ( );
	void OnAuthReady ( );
	void hostedGame ( class UClass* SGI );
	void ReceivedGameClass ( class UClass* GameClass );
	void SetPlayerSlot ( int SlotNumber );
	void ControlLoop ( );
	void StartControlLoop ( );
	class UClass* stringToHologram ( struct FString hologramString );
	class UClass* stringToTower ( struct FString towerString );
	class UClass* stringToWeapon ( struct FString weaponString );
	void showGame ( );
	void printGames ( );
	bool DoesSaveExist ( );
	void SaveLastEquipment ( TArray< class UClass* > Weapons, TArray< class UClass* > Holograms );
	bool GetLastEquipment ( TArray< class UClass* >* Weapons, TArray< class UClass* >* TowerHolograms );
	void AddNewEncounteredEnemy ( struct FString NewEnemy );
	bool NewEncounteredEnemy ( struct FString CheckEnemy );
	void SetLevelHasBeenStarted ( struct FString Level );
	bool HasLevelBeenStarted ( struct FString Level );
	bool isLevelUnlocked ( struct FString Level );
	void UnlockLevel ( struct FString Level );
	void loadGameToSanctum ( );
	void UpgradeAttachments ( int lvl, int numTowers, TArray< class ASanctumTowerBaseAttachment* >* spawnedAttachments, int* upgradedAttachments, int* totalAttachments, int* totalCost );
	void UpgradeSpawnedAttachments ( int A, int B, int C, int D, int E, TArray< class ASanctumTowerBaseAttachment* >* spawnedAttachments, int* totalCost );
	void SpawnRandomMaze ( int numLevelSix, int numLevelFive, int numLevelFour, int numLevelThree, int numLevelTwo, int numLevelOne );
	void SpawnRandomBlocks ( int numBlocksToSpawn, TArray< class ASanctumTowerBase* >* towerBases, TArray< int >* basesWithBlockIndex, int* totalCost );
	void ShuffleIntArray ( TArray< int >* indexes );
	int RandomSort ( int A, int B );
	void loadWeaponsToSanctum ( );
	class ASanctumWeapon* GetWeaponArchetypeFromClass ( class UClass* Weapon );
	class USanctumSapituGame* loadGame ( struct FString GameID, unsigned long onlyParseInfo );
	bool saveGame ( struct FString GameName );
	void loadCheckpoint ( );
	void resumeGameFromMainMenu ( );
	void ShowAchievementsOverlay ( );
	void ShowChatOverlay ( );
	void ShowFacebookOverlay ( );
	void ShowForumOverlay ( );
	void ShowLeaderboardOverlay ( );
	void DisplayDebug ( class AHUD* HUD, float* out_YL, float* out_YPos );
	void ShowAudioDebug ( unsigned long audioDebug, unsigned long detailedVolumeInfo, unsigned long showAudioBoundingBox, unsigned long showPriority );
	void updateWebData ( );
	void MapCompleted ( struct FString NextMap, unsigned long MapUnlocked );
	bool IsTutorialLevel ( );
	void ClientGameEnded ( class AActor* EndGameFocus, unsigned long bIsWinner );
	void GameHasEnded ( class AActor* EndGameFocus, unsigned long bIsWinner );
	void CheckLevelsLockInts ( );
	void OnReadAchievementsComplete ( int TitleId );
	void GetAllAchievements ( );
	void ReInitMainMenu ( );
	void OnLoginFailed ( unsigned char LocalUserNum, unsigned char ErrorCode );
	void OnLoginChange ( unsigned char LocalUserNum );
	void Login ( struct FString UserName, struct FString Password );
	void FixFOV ( );
	void SetFOV ( float NewFOV );
	void Save ( );
	void FixTheFov ( );
	void eventDestroyed ( );
	void eventPostBeginPlay ( );
	void eventPreBeginPlay ( );
};

UClass* ASanctumController::pClassPointer = NULL;

// Class Sanctum.SanctumPlayerController
// 0x00A0 (0x09B0 - 0x0910)
class ASanctumPlayerController : public ASanctumController
{
public:
	int                                                mCurrentElevatorIndex;                            		// 0x0910 (0x0004) [0x0000000000000000]              
	class ASanctumTowerHologram*                       mTowerHologram;                                   		// 0x0914 (0x0004) [0x0000000000000000]              
	class ASanctumTowerBase*                           mTowerBase;                                       		// 0x0918 (0x0004) [0x0000000000000000]              
	class ASanctumHUD*                                 mHUD;                                             		// 0x091C (0x0004) [0x0000000000000000]              
	struct FName                                       mPrev;                                            		// 0x0920 (0x0008) [0x0000000000000000]              
	unsigned long                                      mShowReward : 1;                                  		// 0x0928 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      localIsReady : 1;                                 		// 0x0928 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      mOnlineStatsWasRead : 1;                          		// 0x0928 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      mInMonkeyCage : 1;                                		// 0x0928 (0x0004) [0x0000000000000020] [0x00000008] ( CPF_Net )
	unsigned long                                      mInEQCameraTransition : 1;                        		// 0x0928 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      mOverviewMode : 1;                                		// 0x0928 (0x0004) [0x0000000000000020] [0x00000020] ( CPF_Net )
	unsigned long                                      mForceOverviewMode : 1;                           		// 0x0928 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      mOverviewDisabled : 1;                            		// 0x0928 (0x0004) [0x0000000000000000] [0x00000080] 
	unsigned long                                      mNextWaveDisabled : 1;                            		// 0x0928 (0x0004) [0x0000000000000000] [0x00000100] 
	unsigned long                                      mStefansSecret : 1;                               		// 0x0928 (0x0004) [0x0000000000000000] [0x00000200] 
	unsigned long                                      mPausedGame : 1;                                  		// 0x0928 (0x0004) [0x0000000000000000] [0x00000400] 
	unsigned long                                      mPumpiHUDHidden : 1;                              		// 0x0928 (0x0004) [0x0000000000000000] [0x00000800] 
	unsigned long                                      mEquipmentInitialized : 1;                        		// 0x0928 (0x0004) [0x0000000000000000] [0x00001000] 
	unsigned long                                      mWeakspotKillSoundAllowed : 1;                    		// 0x0928 (0x0004) [0x0000000000000000] [0x00002000] 
	unsigned long                                      mReadyTextSwitch : 1;                             		// 0x0928 (0x0004) [0x0000000000000000] [0x00004000] 
	unsigned long                                      mWeaponStore : 1;                                 		// 0x0928 (0x0004) [0x0000000000000000] [0x00008000] 
	unsigned long                                      mCheated : 1;                                     		// 0x0928 (0x0004) [0x0000000000000000] [0x00010000] 
	unsigned long                                      mDidWin : 1;                                      		// 0x0928 (0x0004) [0x0000000000000000] [0x00020000] 
	unsigned long                                      mGotNewRecord : 1;                                		// 0x0928 (0x0004) [0x0000000000000000] [0x00040000] 
	struct FVector                                     mPlayerMouse;                                     		// 0x092C (0x000C) [0x0000000000000000]              
	float                                              mFOVLinearZoomRate;                               		// 0x0938 (0x0004) [0x0000000000000000]              
	class UForceFeedbackWaveform*                      mCameraShakeShortWaveForm;                        		// 0x093C (0x0004) [0x0000000000000000]              
	class UForceFeedbackWaveform*                      mCameraShakeLongWaveForm;                         		// 0x0940 (0x0004) [0x0000000000000000]              
	class UAudioComponent*                             mAudioComponent;                                  		// 0x0944 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	TArray< int >                                      mTowersLocked;                                    		// 0x0948 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      mWeaponsLocked;                                   		// 0x0954 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class USanctumAchievements*                        mAchievements;                                    		// 0x0960 (0x0004) [0x0000000000000000]              
	class UClass*                                      MatineeCameraClass;                               		// 0x0964 (0x0004) [0x0000000000000000]              
	float                                              mWeakspotKillSoundChance;                         		// 0x0968 (0x0004) [0x0000000000000000]              
	float                                              mWeakspotKillSoundCooldownTime;                   		// 0x096C (0x0004) [0x0000000000000000]              
	class USoundCue*                                   mWeakspotKillSound;                               		// 0x0970 (0x0004) [0x0000000000000000]              
	unsigned char                                      mShouldEnterEquipSelect;                          		// 0x0974 (0x0001) [0x0000000000000020]              ( CPF_Net )
	struct FWaveHashData                               mCompletedWaveData;                               		// 0x0978 (0x0010) [0x0000000000400020]              ( CPF_Net | CPF_NeedCtorLink )
	TArray< class USoundCue* >                         mReadySounds;                                     		// 0x0988 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UCameraAnimInst*                             mCameraAnimInst;                                  		// 0x0994 (0x0004) [0x0000000000000000]              
	struct FScriptDelegate                             __SortElevators__Delegate;                        		// 0x0998 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __CanUnpause__Delegate;                           		// 0x09A4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 44824 ];

		return pClassPointer;
	};

	void showNextEnemies ( unsigned long show );
	void showResource ( unsigned long show );
	void showLife ( unsigned long show );
	void showBuildList ( unsigned long show );
	void HUDVisibility ( unsigned long show );
	void WeaponVisibility ( unsigned long Visible );
	bool CanUnpause ( );
	struct FVector findFreeSpotOnTeleporter ( class USanctumTeleportInterface* Teleporter );
	void ToggleReady ( unsigned long Toggle );
	void loopNotifierText ( );
	void eventInitInputSystem ( );
	void StoreSwitch ( );
	void SwitchWeapon ( unsigned char T );
	bool LandingShake ( );
	void DrawHUD ( class AHUD* H );
	void Use ( );
	void showRoundEnded ( );
	void endActionPhase ( );
	void startActionPhase ( );
	void startTeleport ( );
	void activatePartyTimer ( unsigned long Force );
	void BeginFire_Gamepad ( unsigned long gamepad );
	void BeginFire ( unsigned char FireModeNum );
	void StartAltFire ( unsigned char FireModeNum );
	void SaveAndNotifyPlayerOfRecord ( );
	void SaveEndGameRecord ( );
	int GetWavesLeftForRecord ( );
	void clientStartBuildPhase ( );
	void clientStartActionPhase ( );
	void SetWaveCompleted ( int WaveCompleted );
	void CheckIfCheated ( );
	struct FRotator GetAdjustedAimFor ( class AWeapon* W, struct FVector StartFireLoc );
	void eventGetPlayerViewPoint ( struct FVector* out_Location, struct FRotator* out_Rotation );
	void SetCameraMode ( struct FName NewCamMode );
	void CheckFPS ( );
	void ServerStartActionPhase ( );
	void startBuildPhase ( );
	void EnterStartState ( );
	void ClientEndEquipmentScreen ( );
	void GotoOverviewAndSelectWeapons ( );
	void DoneSelectingEquipment ( );
	void serverGotoState ( struct FName NewState );
	void CalculateNewPlayerStats ( );
	void notifyWaveStarted ( );
	void ProcessMove ( float DeltaTime, struct FVector newAccel, unsigned char DoubleClickMove, struct FRotator DeltaRot );
	void PlayCameraAnim ( class UCameraAnim* AnimToPlay, float Scale, float Rate, float BlendInTime, float BlendOutTime, unsigned long bLoop, unsigned long bIsDamageShake );
	void ViewShake ( float DeltaTime );
	void CheckJumpOrDuck ( );
	void StartOverviewMode ( unsigned long Force );
	void ClientStartOverviewMode ( unsigned long Force );
	void NotifyAllEventsOfClass ( class UClass* EventClass );
	void EndOverviewMode ( unsigned long transition );
	void ClientRemoveOverview ( unsigned long UnForce );
	void Save ( );
	void showGameOver ( );
	void showReward ( int rubelsToReward, int WaveNumber, int MaxWaveNumber );
	void characterProcessingComplete ( );
	void TogglePause ( );
	void NextWeapon ( );
	void PrevWeapon ( );
	void ServerEndedOverview ( );
	void ServerEnteredOverview ( unsigned long Force );
	void ToggleOverview ( );
	void ServerTeleportPlayer ( struct FVector TeleportLocation );
	void actuallyTeleportPlayer ( struct FVector TeleportLocation );
	void TeleportPlayer ( struct FVector TeleportLocation );
	void StopZoom ( );
	void StartZoom ( float NewDesiredFOV, float NewZoomRate );
	void AdjustFOV ( float DeltaTime );
	void eventDestroyed ( );
	void eventPossess ( class APawn* aPawn, unsigned long bVehicleTransition );
	void ClientSetHUD ( class UClass* newHUDType );
	void KickPlayer ( struct FString PlayerName );
	void eventClientWasKicked ( );
	void OnFriendMessageReceived ( unsigned char LocalUserNum, struct FUniqueNetId SendingPlayer, struct FString SendingNick, struct FString Message );
	void OnFriendInviteReceived ( unsigned char LocalUserNum, struct FUniqueNetId RequestingPlayer, struct FString RequestingNick, struct FString Message );
	void OnGameInviteReceived ( unsigned char LocalUserNum, struct FString RequestingNick );
	void OnReadProfileSettingsComplete ( unsigned char LocalUserNum, unsigned long bWasSuccessful );
	void ClientSetOnlineStatus ( );
	void OnLinkStatusChanged ( unsigned long bConnected );
	void OnConnectionStatusChange ( unsigned char ConnectionStatus );
	void eventClearOnlineDelegates ( );
	void ReceivedGameClass ( class UClass* GameClass );
	void AddOnlineDelegates ( unsigned long bRegisterVoice );
	void UpdateParty ( );
	void ShowSteamFriends ( );
	void WeakspotSoundCooldown ( );
	void DidWeakspotKill ( class ASanctumEnemy* Victim );
	void ClientToggleRadio ( unsigned long On );
	void ClientExpandParasol ( );
	void ClientPickedUpChristmasPresent ( );
	void ClientLightTheGrill ( );
	void ClientShotFish ( int Id );
	void ClientUnlockAchievement ( int Index );
	void ClientReadAllOnlineStats ( );
	void ClientDisableAchievements ( );
	void ClientSetStatToViewID ( unsigned char ViewId, int StatValueDiff, unsigned char NumberOfStats );
	void Cleanup ( );
	void OnJoinGameComplete ( struct FName SessionName, unsigned long bSuccessful );
	void JoinGame ( int ServerIndex );
	void DestroyCurrentOnlineGame ( );
	void PrevElevator ( );
	void NextElevator ( );
	int SortElevators ( class USanctumTeleportInterface* A, class USanctumTeleportInterface* B );
	void ClientStartOnlineGame ( );
	void OnFlushLeaderboardStatsComplete ( struct FName SessionName, unsigned long bWasSuccessful );
	void ClientWriteLeaderboardStats ( class UClass* OnlineStatsWriteClass, unsigned long bIsIncomplete );
	void NewActionPhase ( );
	void NewBuildPhase ( );
	void DrawTowerStats ( unsigned long draw );
	void registerListenersToHud ( class ASanctumGameReplicationInfo* GRI, class AHUD* HUD );
	void unregisterListenersToHud ( class ASanctumGameReplicationInfo* GRI, class AHUD* HUD );
	void ShowStatScreen ( );
	void SetTimeLabelForStatScreen ( );
	void ShowGameEndedScreen ( unsigned long won );
	void RewardStars ( );
	void ClientGameEnded ( class AActor* EndGameFocus, unsigned long bIsWinner );
	void GameHasEnded ( class AActor* EndGameFocus, unsigned long bIsWinner );
	void MapCompleted ( struct FString NextMap, unsigned long MapUnlocked );
	bool AllowTextMessage ( struct FString msg );
	void NotifyKismetEscapeMenu ( );
	void NotifyKismetGameResume ( );
	void hide ( struct FString Path );
	bool AllowTTSMessageFrom ( class APlayerReplicationInfo* PRI );
	bool IsBuildPhase ( );
	void ClientRegisterBuildListeners ( );
	void BuildPhaseChanged ( unsigned long buildPhase, unsigned long isViaReplication );
	void updateNotifierText ( unsigned long IsReady );
	void SetTextureLevel ( unsigned char TextureLevel );
	void GetTextureLevel ( );
	void OpenStoreOverlayForDLC ( int AppID );
	void eventPostBeginPlay ( );
	void eventPreBeginPlay ( );
	void eventReplicatedEvent ( struct FName VarName );
};

UClass* ASanctumPlayerController::pClassPointer = NULL;

// Class Sanctum.SanctumPlayerReplicationInfo
// 0x01A4 (0x041C - 0x0278)
class ASanctumPlayerReplicationInfo : public APlayerReplicationInfo
{
public:
	class UClass*                                      mFamilyInfo;                                      		// 0x0278 (0x0004) [0x0000000000000020]              ( CPF_Net )
	struct FWeaponData                                 mWeapons[ 0x3 ];                                  		// 0x027C (0x0018) [0x0000000000000020]              ( CPF_Net )
	unsigned long                                      mWeaponsInitialized : 1;                          		// 0x0294 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      mIsReady : 1;                                     		// 0x0294 (0x0004) [0x0000000000000020] [0x00000002] ( CPF_Net )
	unsigned long                                      mReceivedInactivePRI : 1;                         		// 0x0294 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      mNeedsHelp : 1;                                   		// 0x0294 (0x0004) [0x0000000000000020] [0x00000008] ( CPF_Net )
	class UClass*                                      mChosenTowersHologram[ 0x8 ];                     		// 0x0298 (0x0020) [0x0000000000000020]              ( CPF_Net )
	class UClass*                                      mSelectedWeaponsInEQScreen[ 0x3 ];                		// 0x02B8 (0x000C) [0x0000000000000020]              ( CPF_Net )
	class UClass*                                      mSelectedTowersInEQScreen[ 0x8 ];                 		// 0x02C4 (0x0020) [0x0000000000000020]              ( CPF_Net )
	TArray< struct FTowerCountStruct >                 mFavouriteTowerArray;                             		// 0x02E4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                SlotNumber;                                       		// 0x02F0 (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                mFrags;                                           		// 0x02F4 (0x0004) [0x0000000000000020]              ( CPF_Net )
	class UClass*                                      mFavouriteWeaponClass;                            		// 0x02F8 (0x0004) [0x0000000000000020]              ( CPF_Net )
	class UClass*                                      mFavouriteTowerClass;                             		// 0x02FC (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                mDamageCaused;                                    		// 0x0300 (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                mWeakSpotHits;                                    		// 0x0304 (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                mGibs;                                            		// 0x0308 (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                mTeleports;                                       		// 0x030C (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                mShotsFired;                                      		// 0x0310 (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                mShotHits;                                        		// 0x0314 (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                mSniperKills;                                     		// 0x0318 (0x0004) [0x0000000000000000]              
	int                                                mAssaultKills;                                    		// 0x031C (0x0004) [0x0000000000000000]              
	int                                                mShotgunKills;                                    		// 0x0320 (0x0004) [0x0000000000000000]              
	int                                                mFullyChargedShotgunShots;                        		// 0x0324 (0x0004) [0x0000000000000000]              
	int                                                mInAirKills;                                      		// 0x0328 (0x0004) [0x0000000000000000]              
	int                                                mTowerUpgrades;                                   		// 0x032C (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                mTowersBuiltCount;                                		// 0x0330 (0x0004) [0x0000000000000020]              ( CPF_Net )
	float                                              mDamageCausedSinceActionStart;                    		// 0x0334 (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                mSpentOnWeapon;                                   		// 0x0338 (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                mSpentOnTower;                                    		// 0x033C (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                mSpentOnOther;                                    		// 0x0340 (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                mJumpCount;                                       		// 0x0344 (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                mKnockbackCount;                                  		// 0x0348 (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                mOverviewCount;                                   		// 0x034C (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                mAverageDPS;                                      		// 0x0350 (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                mDPS;                                             		// 0x0354 (0x0004) [0x0000000000000020]              ( CPF_Net )
	int                                                mPreviousGibs;                                    		// 0x0358 (0x0004) [0x0000000000000000]              
	int                                                mPreviousSniperKills;                             		// 0x035C (0x0004) [0x0000000000000000]              
	int                                                mPreviousAssaultKills;                            		// 0x0360 (0x0004) [0x0000000000000000]              
	int                                                mPreviousShotgunKills;                            		// 0x0364 (0x0004) [0x0000000000000000]              
	int                                                mPreviousFullyChargedShotgunShots;                		// 0x0368 (0x0004) [0x0000000000000000]              
	int                                                mPreviousWeakSpotHits;                            		// 0x036C (0x0004) [0x0000000000000000]              
	int                                                mPreviousTeleports;                               		// 0x0370 (0x0004) [0x0000000000000000]              
	int                                                mPreviousInAirKills;                              		// 0x0374 (0x0004) [0x0000000000000000]              
	int                                                mPreviousTowerUpgrades;                           		// 0x0378 (0x0004) [0x0000000000000000]              
	struct FVector                                     mLocationHUDArrow;                                		// 0x037C (0x000C) [0x0000000000000020]              ( CPF_Net )
	unsigned char                                      mRotationHUDArrowByte;                            		// 0x0388 (0x0001) [0x0000000000000020]              ( CPF_Net )
	int                                                mRunnerKills;                                     		// 0x038C (0x0004) [0x0000000000000000]              
	int                                                mHovererKills;                                    		// 0x0390 (0x0004) [0x0000000000000000]              
	int                                                mWalkerKills;                                     		// 0x0394 (0x0004) [0x0000000000000000]              
