/*
#############################################################################################
# Bullet Run (Unknown) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: PBItemShop_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function PBItemShop.PBCachedOffersMap.ClearCachedCategory
// [0x00020400] ( FUNC_Native )
struct UPBCachedOffersMap_execClearCachedCategory_Parms
{
	struct FString                                     cached_category;                                  		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PBItemShop.PBCachedOffersMap.ClearCache
// [0x00020400] ( FUNC_Native )
struct UPBCachedOffersMap_execClearCache_Parms
{
};

// Function PBItemShop.PBCachedOffersMap.GetItemOffers
// [0x00424400] ( FUNC_Native )
struct UPBCachedOffersMap_execGetItemOffers_Parms
{
	struct FGuid                                       itemId;                                           		// 0x0000 (0x0010) [0x0000000000000080]              ( CPF_Parm )
	TArray< struct FPBOffer >                          offers;                                           		// 0x0010 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                nMarketCategory;                                  		// 0x001C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBCachedOffersMap.GetUniqueOffers
// [0x00424400] ( FUNC_Native )
struct UPBCachedOffersMap_execGetUniqueOffers_Parms
{
	TArray< struct FString >                           categories;                                       		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	TArray< struct FPBUniqueOffer >                    offers;                                           		// 0x000C (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                nMarketCategory;                                  		// 0x0018 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x001C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBCachedOffersMap.GetOffers
// [0x00424400] ( FUNC_Native )
struct UPBCachedOffersMap_execGetOffers_Parms
{
	TArray< struct FString >                           categories;                                       		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	TArray< struct FPBOffer >                          offers;                                           		// 0x000C (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                nMarketCategory;                                  		// 0x0018 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x001C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBCachedOffersMap.AddItemOffers
// [0x00424400] ( FUNC_Native )
struct UPBCachedOffersMap_execAddItemOffers_Parms
{
	TArray< struct FPBOffer >                          offers;                                           		// 0x0000 (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                nMarketCategory;                                  		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function PBItemShop.PBCachedOffersMap.AddOffers
// [0x00424400] ( FUNC_Native )
struct UPBCachedOffersMap_execAddOffers_Parms
{
	TArray< struct FPBOffer >                          offers;                                           		// 0x0000 (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                nMarketCategory;                                  		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function PBItemShop.PBCachedOffersMap.AddUniqueOffers
// [0x00424400] ( FUNC_Native )
struct UPBCachedOffersMap_execAddUniqueOffers_Parms
{
	TArray< struct FPBUniqueOffer >                    offers;                                           		// 0x0000 (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                nMarketCategory;                                  		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function PBItemShop.PBItemShopClient.RemoveDelegate_OnGetCasTicketDone
// [0x00020002] 
struct UPBItemShopClient_execRemoveDelegate_OnGetCasTicketDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.AddDelegate_OnGetCasTicketDone
// [0x00020002] 
struct UPBItemShopClient_execAddDelegate_OnGetCasTicketDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.OnGetCasTicketDone
// [0x00120000] 
struct UPBItemShopClient_execOnGetCasTicketDone_Parms
{
	int                                                RequestID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ErrorCode;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     casTicket;                                        		// 0x0008 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     subscriptionURL;                                  		// 0x0014 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PBItemShop.PBItemShopClient.GetCasTicket
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBItemShopClient_eventGetCasTicket_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.RemoveDelegate_OnFinalizeSteamTransactionDone
// [0x00020002] 
struct UPBItemShopClient_execRemoveDelegate_OnFinalizeSteamTransactionDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.AddDelegate_OnFinalizeSteamTransactionDone
// [0x00020002] 
struct UPBItemShopClient_execAddDelegate_OnFinalizeSteamTransactionDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.OnFinalizeSteamTransactionDone
// [0x00120000] 
struct UPBItemShopClient_execOnFinalizeSteamTransactionDone_Parms
{
	int                                                RequestID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ErrorCode;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ErrorMessage;                                     		// 0x0008 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PBItemShop.PBItemShopClient.FinalizeSteamTransaction
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBItemShopClient_eventFinalizeSteamTransaction_Parms
{
	struct FString                                     orderId;                                          		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bAuthorized : 1;                                  		// 0x000C (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.RemoveDelegate_OnFundWalletDone
// [0x00020002] 
struct UPBItemShopClient_execRemoveDelegate_OnFundWalletDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.AddDelegate_OnFundWalletDone
// [0x00020002] 
struct UPBItemShopClient_execAddDelegate_OnFundWalletDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.OnFundWalletDone
// [0x00120000] 
struct UPBItemShopClient_execOnFundWalletDone_Parms
{
	int                                                RequestID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ErrorCode;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ErrorMessage;                                     		// 0x0008 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                newRmtcAmount;                                    		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     orderId;                                          		// 0x0018 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     tax;                                              		// 0x0024 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     VATTax;                                           		// 0x0030 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     orderTotal;                                       		// 0x003C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FSOEStationCashProductFundWallet            fundWalletProduct;                                		// 0x0048 (0x0040) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PBItemShop.PBItemShopClient.FundWallet
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBItemShopClient_eventFundWallet_Parms
{
	int                                                paymentSourceId;                                  		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     currency;                                         		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     fullSku;                                          		// 0x0010 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     steamId;                                          		// 0x001C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x0028 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.RemoveDelegate_OnGetStationCashProductsDone
// [0x00020002] 
struct UPBItemShopClient_execRemoveDelegate_OnGetStationCashProductsDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.AddDelegate_OnGetStationCashProductsDone
// [0x00020002] 
struct UPBItemShopClient_execAddDelegate_OnGetStationCashProductsDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.OnGetStationCashProductsDone
// [0x00120000] 
struct UPBItemShopClient_execOnGetStationCashProductsDone_Parms
{
	int                                                RequestID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ErrorCode;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ErrorMessage;                                     		// 0x0008 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	TArray< struct FSOEStationCashProduct >            StationCashProducts;                              		// 0x0014 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PBItemShop.PBItemShopClient.GetStationCashProducts
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBItemShopClient_eventGetStationCashProducts_Parms
{
	struct FString                                     currency;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.RemoveDelegate_OnGetPaymentSourcesDone
// [0x00020002] 
struct UPBItemShopClient_execRemoveDelegate_OnGetPaymentSourcesDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.AddDelegate_OnGetPaymentSourcesDone
// [0x00020002] 
struct UPBItemShopClient_execAddDelegate_OnGetPaymentSourcesDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.OnGetPaymentSourcesDone
// [0x00120000] 
struct UPBItemShopClient_execOnGetPaymentSourcesDone_Parms
{
	int                                                RequestID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ErrorCode;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ErrorMessage;                                     		// 0x0008 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     defaultcurrency;                                  		// 0x0014 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      parentPasswordRequired : 1;                       		// 0x0020 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	int                                                walletPaymentSourceID;                            		// 0x0024 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PBItemShop.PBItemShopClient.GetPaymentSources
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBItemShopClient_eventGetPaymentSources_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.RemoveDelegate_OnIsSteamCustomerDone
// [0x00020002] 
struct UPBItemShopClient_execRemoveDelegate_OnIsSteamCustomerDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.AddDelegate_OnIsSteamCustomerDone
// [0x00020002] 
struct UPBItemShopClient_execAddDelegate_OnIsSteamCustomerDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.OnIsSteamCustomerDone
// [0x00120000] 
struct UPBItemShopClient_execOnIsSteamCustomerDone_Parms
{
	int                                                RequestID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ErrorCode;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ErrorMessage;                                     		// 0x0008 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      IsSteamCustomer : 1;                              		// 0x0014 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PBItemShop.PBItemShopClient.IsSteamCustomer
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBItemShopClient_eventIsSteamCustomer_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.RemoveDelegate_OnCreateStationHandleDone
// [0x00020002] 
struct UPBItemShopClient_execRemoveDelegate_OnCreateStationHandleDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.AddDelegate_OnCreateStationHandleDone
// [0x00020002] 
struct UPBItemShopClient_execAddDelegate_OnCreateStationHandleDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.OnCreateStationHandleDone
// [0x00120000] 
struct UPBItemShopClient_execOnCreateStationHandleDone_Parms
{
	int                                                RequestID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ErrorCode;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PBItemShop.PBItemShopClient.CreateStationHandle
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBItemShopClient_eventCreateStationHandle_Parms
{
	struct FString                                     stationHandle;                                    		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.RemoveDelegate_OnCheckStationHandleAvailabilityDone
// [0x00020002] 
struct UPBItemShopClient_execRemoveDelegate_OnCheckStationHandleAvailabilityDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.AddDelegate_OnCheckStationHandleAvailabilityDone
// [0x00020002] 
struct UPBItemShopClient_execAddDelegate_OnCheckStationHandleAvailabilityDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.OnCheckStationHandleAvailabilityDone
// [0x00120000] 
struct UPBItemShopClient_execOnCheckStationHandleAvailabilityDone_Parms
{
	int                                                RequestID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ErrorCode;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      avaialble : 1;                                    		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PBItemShop.PBItemShopClient.CheckStationHandleAvailability
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBItemShopClient_eventCheckStationHandleAvailability_Parms
{
	struct FString                                     stationHandle;                                    		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.RemoveDelegate_OnGetUnlockedOffersAtRankDone
// [0x00020002] 
struct UPBItemShopClient_execRemoveDelegate_OnGetUnlockedOffersAtRankDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.AddDelegate_OnGetUnlockedOffersAtRankDone
// [0x00020002] 
struct UPBItemShopClient_execAddDelegate_OnGetUnlockedOffersAtRankDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.OnGetUnlockedOffersAtRankDone
// [0x00120000] 
struct UPBItemShopClient_execOnGetUnlockedOffersAtRankDone_Parms
{
	int                                                RequestID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ErrorCode;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	TArray< struct FPBOffer >                          offers;                                           		// 0x0008 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PBItemShop.PBItemShopClient.GetUnlockedOffersAtRank
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBItemShopClient_eventGetUnlockedOffersAtRank_Parms
{
	int                                                OldRank;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                NewRank;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.RemoveDelegate_OnGetClientProfileDetails
// [0x00020002] 
struct UPBItemShopClient_execRemoveDelegate_OnGetClientProfileDetails_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.AddDelegate_OnGetClientProfileDetails
// [0x00020002] 
struct UPBItemShopClient_execAddDelegate_OnGetClientProfileDetails_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.OnGetClientProfileDetails
// [0x00120000] 
struct UPBItemShopClient_execOnGetClientProfileDetails_Parms
{
	int                                                RequestID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ErrorCode;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                AmoutClientProfileDetails;                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	TArray< struct FPbmnClientProfileDetail >          ClientProfileDetails;                             		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PBItemShop.PBItemShopClient.GetClientProfileDetails
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBItemShopClient_eventGetClientProfileDetails_Parms
{
	int                                                AmountAccountNick;                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	TArray< struct FString >                           AccountNick;                                      		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.RemoveDelegate_OnGetAccountAndProfilesForName
// [0x00020002] 
struct UPBItemShopClient_execRemoveDelegate_OnGetAccountAndProfilesForName_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.AddDelegate_OnGetAccountAndProfilesForName
// [0x00020002] 
struct UPBItemShopClient_execAddDelegate_OnGetAccountAndProfilesForName_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.OnGetAccountAndProfilesForName
// [0x00120000] 
struct UPBItemShopClient_execOnGetAccountAndProfilesForName_Parms
{
	int                                                RequestID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ErrorCode;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                AmountAccountProfiles;                            		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	TArray< struct FPbmnAccountProfile >               AccountProfiles;                                  		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PBItemShop.PBItemShopClient.GetAccountAndProfilesForName
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBItemShopClient_eventGetAccountAndProfilesForName_Parms
{
	struct FString                                     SearchName;                                       		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.RemoveDelegate_OnGetUniqueCategoriesDone
// [0x00020002] 
struct UPBItemShopClient_execRemoveDelegate_OnGetUniqueCategoriesDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.AddDelegate_OnGetUniqueCategoriesDone
// [0x00020002] 
struct UPBItemShopClient_execAddDelegate_OnGetUniqueCategoriesDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.OnGetUniqueCategoriesDone
// [0x00120000] 
struct UPBItemShopClient_execOnGetUniqueCategoriesDone_Parms
{
	int                                                RequestID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ErrorCode;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	TArray< struct FString >                           categoriesName;                                   		// 0x0008 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PBItemShop.PBItemShopClient.GetUniqueCategories
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBItemShopClient_eventGetUniqueCategories_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.RemoveDelegate_OnReportAbuseDone
// [0x00020002] 
struct UPBItemShopClient_execRemoveDelegate_OnReportAbuseDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.AddDelegate_OnReportAbuseDone
// [0x00020002] 
struct UPBItemShopClient_execAddDelegate_OnReportAbuseDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.OnReportAbuseDone
// [0x00120000] 
struct UPBItemShopClient_execOnReportAbuseDone_Parms
{
	int                                                RequestID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ErrorCode;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PBItemShop.PBItemShopClient.ReportAbuse
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBItemShopClient_eventReportAbuse_Parms
{
	struct FPBReportInfo                               abuseReport;                                      		// 0x0000 (0x0050) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x0050 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.RemoveDelegate_OnCheckoutBasketDone
// [0x00020002] 
struct UPBItemShopClient_execRemoveDelegate_OnCheckoutBasketDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.AddDelegate_OnCheckoutBasketDone
// [0x00020002] 
struct UPBItemShopClient_execAddDelegate_OnCheckoutBasketDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.OnCheckoutBasketDone
// [0x00120000] 
struct UPBItemShopClient_execOnCheckoutBasketDone_Parms
{
	int                                                RequestID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ErrorCode;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PBItemShop.PBItemShopClient.CheckoutBasket
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBItemShopClient_eventCheckoutBasket_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.CheckoutBasketPartial
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBItemShopClient_eventCheckoutBasketPartial_Parms
{
	TArray< struct FGuid >                             basketItems;                                      		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.RemoveDelegate_OnSetPaymentForBasketItemDone
// [0x00020002] 
struct UPBItemShopClient_execRemoveDelegate_OnSetPaymentForBasketItemDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.AddDelegate_OnSetPaymentForBasketItemDone
// [0x00020002] 
struct UPBItemShopClient_execAddDelegate_OnSetPaymentForBasketItemDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.OnSetPaymentForBasketItemDone
// [0x00120000] 
struct UPBItemShopClient_execOnSetPaymentForBasketItemDone_Parms
{
	int                                                RequestID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ErrorCode;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PBItemShop.PBItemShopClient.SetPaymentForBasketItem
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBItemShopClient_eventSetPaymentForBasketItem_Parms
{
	TArray< struct FGuid >                             basketItemId;                                     		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	TArray< int >                                      paymentOption;                                    		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.RemoveDelegate_OnDeleteAllItemsFromBasketDone
// [0x00020002] 
struct UPBItemShopClient_execRemoveDelegate_OnDeleteAllItemsFromBasketDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.AddDelegate_OnDeleteAllItemsFromBasketDone
// [0x00020002] 
struct UPBItemShopClient_execAddDelegate_OnDeleteAllItemsFromBasketDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.OnDeleteAllItemsFromBasketDone
// [0x00120000] 
struct UPBItemShopClient_execOnDeleteAllItemsFromBasketDone_Parms
{
	int                                                RequestID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ErrorCode;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PBItemShop.PBItemShopClient.DeleteAllItemsFromBasket
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBItemShopClient_eventDeleteAllItemsFromBasket_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.RemoveDelegate_OnDeleteItemFromBasketDone
// [0x00020002] 
struct UPBItemShopClient_execRemoveDelegate_OnDeleteItemFromBasketDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.AddDelegate_OnDeleteItemFromBasketDone
// [0x00020002] 
struct UPBItemShopClient_execAddDelegate_OnDeleteItemFromBasketDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.OnDeleteItemFromBasketDone
// [0x00120000] 
struct UPBItemShopClient_execOnDeleteItemFromBasketDone_Parms
{
	int                                                RequestID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ErrorCode;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PBItemShop.PBItemShopClient.DeleteItemFromBasket
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBItemShopClient_eventDeleteItemFromBasket_Parms
{
	int                                                amountBasketItems;                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	TArray< struct FGuid >                             basketItems;                                      		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.RemoveDelegate_OnAddItemToBasketDone
// [0x00020002] 
struct UPBItemShopClient_execRemoveDelegate_OnAddItemToBasketDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.AddDelegate_OnAddItemToBasketDone
// [0x00020002] 
struct UPBItemShopClient_execAddDelegate_OnAddItemToBasketDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.OnAddItemToBasketDone
// [0x00120000] 
struct UPBItemShopClient_execOnAddItemToBasketDone_Parms
{
	int                                                RequestID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ErrorCode;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FPBBasketItem                               basketItemId;                                     		// 0x0008 (0x003C) [0x0000000000000080]              ( CPF_Parm )
};

// Function PBItemShop.PBItemShopClient.AddItemToBasket
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBItemShopClient_eventAddItemToBasket_Parms
{
	struct FGuid                                       OfferId;                                          		// 0x0000 (0x0010) [0x0000000000000080]              ( CPF_Parm )
	int                                                quantity;                                         		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                paymentOption;                                    		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.RemoveDelegate_OnGetBasketDone
// [0x00020002] 
struct UPBItemShopClient_execRemoveDelegate_OnGetBasketDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.AddDelegate_OnGetBasketDone
// [0x00020002] 
struct UPBItemShopClient_execAddDelegate_OnGetBasketDone_Parms
{
	struct FScriptDelegate                             func;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     Parent;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PBItemShop.PBItemShopClient.OnGetBasketDone
// [0x00120000] 
struct UPBItemShopClient_execOnGetBasketDone_Parms
{
	int                                                RequestID;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ErrorCode;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                amountBasketItems;                                		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
