/*
#############################################################################################
# Bullet Run (Unknown) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: PlanBGame_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct PlanBGame.PBAccountLevelCommand.AccountCanCommand
// 0x0014
struct FAccountCanCommand
{
	struct FName                                       CommandName;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	TArray< unsigned long >                            allowed;                                          		// 0x0008 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct PlanBGame.PBAccountTypeList.PBAccountTypeContainer
// 0x0010
struct FPBAccountTypeContainer
{
	int                                                AccountTypeCode;                                  		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     AccountTypeString;                                		// 0x0004 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct PlanBGame.PBAchievement.TAchievementSupportedEvent
// 0x0010
struct FTAchievementSupportedEvent
{
	unsigned char                                      EventType;                                        		// 0x0000 (0x0001) [0x0000000000000000]              
	struct FScriptDelegate                             OnEventFunc;                                      		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct PlanBGame.PBAchievementManager.TAchievementEventArray
// 0x000C
struct FTAchievementEventArray
{
	TArray< class UPBAchievement* >                    m_Array;                                          		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct PlanBGame.PBAchievementManager.TAchievementEventParams
// 0x0020
struct FTAchievementEventParams
{
	class APlayerReplicationInfo*                      Killer;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	class APlayerReplicationInfo*                      Victim;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
	class APawn*                                       VictimPawn;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
	struct FString                                     sWeaponName;                                      		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bPawnReloading : 1;                               		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                nIntegerValue;                                    		// 0x001C (0x0004) [0x0000000000000000]              
};

// ScriptStruct PlanBGame.PBNWeapon.TWeaponCondition
// 0x0024
struct FTWeaponCondition
{
	struct FGuid                                       WeaponSerialNumber;                               		// 0x0000 (0x0010) [0x0000000000000000]              
	float                                              fCurrentCondition;                                		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              fCurrentMaxCondition;                             		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              fLastEquipTime;                                   		// 0x0018 (0x0004) [0x0000000000000000]              
	float                                              fTotalTimeEquipped;                               		// 0x001C (0x0004) [0x0000000000000000]              
	unsigned long                                      bDirtyClient : 1;                                 		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bDirty : 1;                                       		// 0x0020 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct PlanBGame.PBKWeapon.DebugHitInfo
// 0x0040
struct FDebugHitInfo
{
	unsigned long                                      bServerHit : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FVector                                     vStart;                                           		// 0x0004 (0x000C) [0x0000000000000000]              
	struct FString                                     strPlayerName;                                    		// 0x0010 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FVector                                     vHitLoc;                                          		// 0x001C (0x000C) [0x0000000000000000]              
	struct FName                                       BoneName;                                         		// 0x0028 (0x0008) [0x0000000000000000]              
	struct FVector                                     vBoneLoc;                                         		// 0x0030 (0x000C) [0x0000000000000000]              
	unsigned long                                      bHeadPhysMat : 1;                                 		// 0x003C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct PlanBGame.PBHeatSystemArc.HeatCollectorInfo
// 0x0005
struct FHeatCollectorInfo
{
	int                                                iRequiredHeatInBuffer;                            		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      eHeatCollectorHeatEvent;                          		// 0x0004 (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBCommentatorSystem.CommentatorTrackInfo
// 0x002C
struct FCommentatorTrackInfo
{
	struct FString                                     StatlerRef;                                       		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     WaldorfRef;                                       		// 0x000C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned long                                      WaldorfFirst : 1;                                 		// 0x0018 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	struct FString                                     Description;                                      		// 0x001C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	float                                              VODelay;                                          		// 0x0028 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBHeatSystemArc.PrimaryEventInfo
// 0x0040
struct FPrimaryEventInfo
{
	unsigned long                                      bDisplayOnCrosshair : 1;                          		// 0x0000 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned char                                      PrimaryHeatEvent;                                 		// 0x0004 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	int                                                HeatFromEvent;                                    		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                iHeatBufferPenalty;                               		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bAlwaysDisplayDescription : 1;                    		// 0x0010 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bDisplayDescriptionIfItHasAnyBonusEvent : 1;      		// 0x0010 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	float                                              fSoundActivationChancePercent;                    		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     EventDescription;                                 		// 0x0018 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FCommentatorTrackInfo >             CommentatorVOMale;                                		// 0x0024 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FCommentatorTrackInfo >             CommentatorVOFemale;                              		// 0x0030 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class USoundCue*                                   CrowdSound;                                       		// 0x003C (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBHeatSystemArc.BonusEventInfo
// 0x0038
struct FBonusEventInfo
{
	unsigned char                                      BonusHeatEvent;                                   		// 0x0000 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	int                                                HeatFromBonus;                                    		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fSoundActivationChancePercent;                    		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     EventDescription;                                 		// 0x000C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	int                                                Priority;                                         		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FCommentatorTrackInfo >             CommentatorVOMale;                                		// 0x001C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FCommentatorTrackInfo >             CommentatorVOFemale;                              		// 0x0028 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class USoundCue*                                   CrowdSound;                                       		// 0x0034 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBCommentatorSystem.VOLayer
// 0x002C
struct FVOLayer
{
	unsigned char                                      Layer;                                            		// 0x0000 (0x0001) [0x0000000000000000]              
	class UAudioComponent*                             AudioComp;                                        		// 0x0004 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	struct FScriptDelegate                             FirstAudioDelegate;                               		// 0x0008 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct FScriptDelegate                             SecondAudioDelegate;                              		// 0x0014 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	float                                              LoadingTimeA;                                     		// 0x0020 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              LoadingTimeB;                                     		// 0x0024 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bPlaying : 1;                                     		// 0x0028 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
};

// ScriptStruct PlanBGame.PBKWeapon.GeneralCache
// 0x0074
struct FGeneralCache
{
	float                                              fAimPerc;                                         		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      WeaponFireType;                                   		// 0x0004 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      eAimStatus;                                       		// 0x0005 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	float                                              fAimInTime;                                       		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fAimOutTime;                                      		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     vNormalOffsetPos;                                 		// 0x0010 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FRotator                                    rNormalOffsetRot;                                 		// 0x001C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     vAimOffsetPos;                                    		// 0x0028 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FRotator                                    rAimOffsetRot;                                    		// 0x0034 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     vSprintPosOffset;                                 		// 0x0040 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FRotator                                    vSprintRotOffset;                                 		// 0x004C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              fSprintSpeedModifier;                             		// 0x0058 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     vCachedWeaponActorPosition;                       		// 0x005C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FRotator                                    vCachedWeaponActorRotation;                       		// 0x0068 (0x000C) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBKWeapon.SpreadCache
// 0x0068
struct FSpreadCache
{
	unsigned long                                      bSpreadEnabled : 1;                               		// 0x0000 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned char                                      SpreadType;                                       		// 0x0004 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	float                                              fPatternBulletDecaySpeed;                         		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fPatternSpreadCrosshairDecaySpeed;                		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fSpreadDecaySpeed;                                		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fSpreadMinChangeTime;                             		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fCurrentTargetMinimumSpreadRadius;                		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fBaseMinSpreadModifier;                           		// 0x001C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fCurrentMinSpreadModifier;                        		// 0x0020 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fMinSpreadModifier;                               		// 0x0024 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTargetMinAimStill;                               		// 0x0028 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTargetMinAimMoving;                              		// 0x002C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTargetMinJumping;                                		// 0x0030 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTargetMinCrouchStill;                            		// 0x0034 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTargetMinCrouchMoving;                           		// 0x0038 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTargetMinRunning;                                		// 0x003C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fTargetMinStanding;                               		// 0x0040 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fBaseMaxSpreadRadius;                             		// 0x0044 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fCurrentMaxSpreadRadius;                          		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fSpreadMaxJumpModifier;                           		// 0x004C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fSpreadMaxCrouchModifier;                         		// 0x0050 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fBaseSpreadPerBullet;                             		// 0x0054 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fCurrentSpreadPerBullet;                          		// 0x0058 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fSpreadCenterZone;                                		// 0x005C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fSpreadHitsOnCenterZone;                          		// 0x0060 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fSpreadNumberOfZones;                             		// 0x0064 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBKWeapon.RecoilCache
// 0x0008
struct FRecoilCache
{
	float                                              fCurRecoilMaxPitch;                               		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fCurRecoilMaxYaw;                                 		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBNWeaponObject.SWeaponCode
// 0x000A
struct FSWeaponCode
{
	unsigned char                                      iBaseWeaponCode;                                  		// 0x0000 (0x0001) [0x0000000000000000]              
	unsigned char                                      iWeaponMaterialCode;                              		// 0x0001 (0x0001) [0x0000000000000000]              
	int                                                iModsWeaponCode;                                  		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned char                                      iWeaponDecalCode;                                 		// 0x0008 (0x0001) [0x0000000000000000]              
	unsigned char                                      iWeaponGlowCode;                                  		// 0x0009 (0x0001) [0x0000000000000000]              
};

// ScriptStruct PlanBGame.PBKWeapon.DebugWeaponInfo
// 0x001C
struct FDebugWeaponInfo
{
	struct FName                                       OptionName;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FString                                     Description;                                      		// 0x0008 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FName                                       functionName;                                     		// 0x0014 (0x0008) [0x0000000000000000]              
};

// ScriptStruct PlanBGame.PBKWeaponParams.RangeDmgInfo
// 0x000C
struct FRangeDmgInfo
{
	float                                              fStartRange;                                      		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fEndRange;                                        		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                iDmg;                                             		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBCustomChar_Data.PBGameItem_IconCoordsInfo
// 0x001C
struct FPBGameItem_IconCoordsInfo
{
	struct FString                                     IconTextureRef;                                   		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FTextureCoordinates                         Coordinates;                                      		// 0x000C (0x0010) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBNWeaponCustomParams.PBNWeaponMaterialInfo
// 0x0068
struct FPBNWeaponMaterialInfo
{
	struct FString                                     MaterialMenuName;                                 		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     MaterialMenuDescription;                          		// 0x000C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     MaterialMenuCategory;                             		// 0x0018 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     MaterialInstanceRef;                              		// 0x0024 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FGuid                                       GlobalIdentifier;                                 		// 0x0030 (0x0010) [0x0000000000000002]              ( CPF_Const )
	struct FString                                     GlobalIdentifierStr;                              		// 0x0040 (0x000C) [0x0000000000402003]              ( CPF_Edit | CPF_Const | CPF_Transient | CPF_NeedCtorLink )
	struct FPBGameItem_IconCoordsInfo                  MaterialIcon;                                     		// 0x004C (0x001C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct PlanBGame.PBNWeaponCustomParams.PBNWeaponDecalInfo
// 0x0060
struct FPBNWeaponDecalInfo
{
	struct FString                                     DecalMenuName;                                    		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     DecalMenuDescription;                             		// 0x000C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     DecalMenuCategory;                                		// 0x0018 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	int                                                QuadrantIndex;                                    		// 0x0024 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FGuid                                       GlobalIdentifier;                                 		// 0x0028 (0x0010) [0x0000000000000002]              ( CPF_Const )
	struct FString                                     GlobalIdentifierStr;                              		// 0x0038 (0x000C) [0x0000000000402003]              ( CPF_Edit | CPF_Const | CPF_Transient | CPF_NeedCtorLink )
	struct FPBGameItem_IconCoordsInfo                  MaterialIcon;                                     		// 0x0044 (0x001C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct PlanBGame.PBNWeaponCustomParams.WeaponTextureRegion
// 0x0010
struct FWeaponTextureRegion
{
	float                                              OffsetX;                                          		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              OffsetY;                                          		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              SizeX;                                            		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              SizeY;                                            		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBNWeaponCustomParams.PBNWeaponCustomization
// 0x00CC
struct FPBNWeaponCustomization
{
	struct FPBNWeaponMaterialInfo                      DefaultMaterialInstance;                          		// 0x0000 (0x0068) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FPBNWeaponMaterialInfo >            AvailableMaterialInstances;                       		// 0x0068 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FPBNWeaponDecalInfo >               AvailableDecals;                                  		// 0x0074 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FIntPoint                                   TextureSize;                                      		// 0x0080 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FWeaponTextureRegion                        BodyTextureRgn;                                   		// 0x0088 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     BodyMesh1P_Ref;                                   		// 0x0098 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     BodyMesh3P_Ref;                                   		// 0x00A4 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FVector                                     CustomWeaponPreview_Offset;                       		// 0x00B0 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FRotator                                    CustomWeaponPreview_Rotation;                     		// 0x00BC (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              CustomWeaponPreview_Scale;                        		// 0x00C8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBCustomChar_Data.PBGameItem_IconInfo
// 0x0014
struct FPBGameItem_IconInfo
{
	struct FString                                     IconTextureRef;                                   		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	int                                                RowIndex;                                         		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                ColumnIndex;                                      		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBCustomChar_Data.PBItemTagData
// 0x0004
struct FPBItemTagData
{
	unsigned long                                      Headwear : 1;                                     		// 0x0000 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      Scalp : 1;                                        		// 0x0000 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      Ears : 1;                                         		// 0x0000 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      Eyes : 1;                                         		// 0x0000 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      Mouth : 1;                                        		// 0x0000 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	unsigned long                                      Torso1 : 1;                                       		// 0x0000 (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
	unsigned long                                      Torso2 : 1;                                       		// 0x0000 (0x0004) [0x0000000000000001] [0x00000040] ( CPF_Edit )
	unsigned long                                      Shoulders : 1;                                    		// 0x0000 (0x0004) [0x0000000000000001] [0x00000080] ( CPF_Edit )
	unsigned long                                      Elbow : 1;                                        		// 0x0000 (0x0004) [0x0000000000000001] [0x00000100] ( CPF_Edit )
	unsigned long                                      LowerArm : 1;                                     		// 0x0000 (0x0004) [0x0000000000000001] [0x00000200] ( CPF_Edit )
	unsigned long                                      Hands : 1;                                        		// 0x0000 (0x0004) [0x0000000000000001] [0x00000400] ( CPF_Edit )
	unsigned long                                      Legs : 1;                                         		// 0x0000 (0x0004) [0x0000000000000001] [0x00000800] ( CPF_Edit )
	unsigned long                                      Thighs : 1;                                       		// 0x0000 (0x0004) [0x0000000000000001] [0x00001000] ( CPF_Edit )
	unsigned long                                      Knees : 1;                                        		// 0x0000 (0x0004) [0x0000000000000001] [0x00002000] ( CPF_Edit )
	unsigned long                                      LowerLegs : 1;                                    		// 0x0000 (0x0004) [0x0000000000000001] [0x00004000] ( CPF_Edit )
	unsigned long                                      Feet : 1;                                         		// 0x0000 (0x0004) [0x0000000000000001] [0x00008000] ( CPF_Edit )
	unsigned long                                      Forehead : 1;                                     		// 0x0000 (0x0004) [0x0000000000000001] [0x00010000] ( CPF_Edit )
	unsigned long                                      Face_Distant : 1;                                 		// 0x0000 (0x0004) [0x0000000000000001] [0x00020000] ( CPF_Edit )
	unsigned long                                      Chin : 1;                                         		// 0x0000 (0x0004) [0x0000000000000001] [0x00040000] ( CPF_Edit )
	unsigned long                                      Placeholder1 : 1;                                 		// 0x0000 (0x0004) [0x0000000000000001] [0x00080000] ( CPF_Edit )
	unsigned long                                      Placeholder2 : 1;                                 		// 0x0000 (0x0004) [0x0000000000000001] [0x00100000] ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBCustomChar_Data.PBItemBaseData
// 0x0044
struct FPBItemBaseData
{
	struct FString                                     DisplayName;                                      		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FGuid                                       GlobalIdentifier;                                 		// 0x000C (0x0010) [0x0000000000000002]              ( CPF_Const )
	struct FString                                     GlobalIdentifierStr;                              		// 0x001C (0x000C) [0x0000000000402003]              ( CPF_Edit | CPF_Const | CPF_Transient | CPF_NeedCtorLink )
	struct FString                                     Description;                                      		// 0x0028 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     CategoryName;                                     		// 0x0034 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FPBItemTagData                              TagData;                                          		// 0x0040 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBNWeaponCustomParams.CustomWeaponData
// 0x000E
struct FCustomWeaponData
{
	unsigned long                                      bInitialized : 1;                                 		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned char                                      MaterialID;                                       		// 0x0004 (0x0001) [0x0000000000000000]              
	unsigned char                                      Mods[ 0x7 ];                                      		// 0x0005 (0x0007) [0x0000000000000000]              
	unsigned char                                      DecalID;                                          		// 0x000C (0x0001) [0x0000000000000000]              
	unsigned char                                      GlowID;                                           		// 0x000D (0x0001) [0x0000000000000000]              
};

// ScriptStruct PlanBGame.PBKWeaponParams.SpreadPatternNode
// 0x0010
struct FSpreadPatternNode
{
	float                                              X;                                                		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Y;                                                		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                BulletCount;                                      		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fRandomRadius;                                    		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBWeaponStatistics.TPBWeaponHitStruct
// 0x0028
struct FTPBWeaponHitStruct
{
	class APBKWeapon*                                  Weapon;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FSWeaponCode                                WeaponCode;                                       		// 0x0004 (0x000C) [0x0000000000000000]              
	class AController*                                 Victim;                                           		// 0x0010 (0x0004) [0x0000000000000000]              
	class APawn*                                       VictimPawn;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
	unsigned long                                      bVictimPawnReloading : 1;                         		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bKill : 1;                                        		// 0x0018 (0x0004) [0x0000000000000000] [0x00000002] 
	int                                                nDamage;                                          		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                HitZone;                                          		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                hitDistance;                                      		// 0x0024 (0x0004) [0x0000000000000000]              
};

// ScriptStruct PlanBGame.PBWeaponStatistics.TPBWeaponStat
// 0x0058
struct FTPBWeaponStat
{
	int                                                nHitBodyShots;                                    		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                nHitHeadShots;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                nHitLegsShots;                                    		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                nMissedShots;                                     		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                nHeadKills;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                nKills;                                           		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                nDamage;                                          		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                nMaxDamage;                                       		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                nTime;                                            		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                nEquippedTime;                                    		// 0x0024 (0x0004) [0x0000000000000000]              
	struct FString                                     sWeaponName;                                      		// 0x0028 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                nHitDistance;                                     		// 0x0034 (0x0004) [0x0000000000000000]              
	int                                                nKillDistance;                                    		// 0x0038 (0x0004) [0x0000000000000000]              
	struct FSWeaponCode                                pWeaponCode;                                      		// 0x003C (0x000C) [0x0000000000000000]              
	struct FGuid                                       skillGuid;                                        		// 0x0048 (0x0010) [0x0000000000000000]              
};

// ScriptStruct PlanBGame.PBKWeaponParams.RecoilNode
// 0x000C
struct FRecoilNode
{
	float                                              X;                                                		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Y;                                                		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                BulletCount;                                      		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBKWeaponParams.IdleBreak
// 0x0010
struct FIdleBreak
{
	float                                              fProbability;                                     		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fPlayRate;                                        		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       IdleName;                                         		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBKWeaponParams.TFireEffectsInfo
// 0x003C
struct FTFireEffectsInfo
{
	int                                                iWeaponComponentIndex;                            		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FName >                             FireAnim1P;                                       		// 0x0004 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< float >                                    FireAnimTimeScale1P;                              		// 0x0010 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FName >                             CustomFireAnim3P;                                 		// 0x001C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class USoundCue*                                   WeaponFireSnd1P;                                  		// 0x0028 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   WeaponFireSnd3P;                                  		// 0x002C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   WeaponFireAltSnd1P;                               		// 0x0030 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   WeaponFireAltSnd3P;                               		// 0x0034 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bRecoil_UseSecondaryGunNode : 1;                  		// 0x0038 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBKWeaponInfo.TWeaponMeshComp
// 0x0018
struct FTWeaponMeshComp
{
	class USkeletalMeshComponent*                      WeaponMeshComp;                                   		// 0x0000 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UParticleSystemComponent*                    MuzzleFlash;                                      		// 0x0004 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UParticleSystemComponent*                    BarrelSmokeComp;                                  		// 0x0008 (0x0004) [0x0000000004080009]              ( CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline )
	TArray< class UParticleSystemComponent* >          rParticleSystems;                                 		// 0x000C (0x000C) [0x0000000004482009]              ( CPF_Edit | CPF_ExportObject | CPF_Transient | CPF_Component | CPF_NeedCtorLink | CPF_EditInline )
};

// ScriptStruct PlanBGame.PBKWeapon.WRLMiniGameResult
// 0x0005
struct FWRLMiniGameResult
{
	float                                              StartTime;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned char                                      Result;                                           		// 0x0004 (0x0001) [0x0000000000000000]              
};

// ScriptStruct PlanBGame.PBKWeapon.TWeaponInitParams
// 0x0010
struct FTWeaponInitParams
{
	class APBKWeaponParams*                            pNewParams;                                       		// 0x0000 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FSWeaponCode                                WeaponCode;                                       		// 0x0004 (0x000C) [0x0000000000002000]              ( CPF_Transient )
};

// ScriptStruct PlanBGame.PBKWeaponParams.TWeaponParticleComponent
// 0x000C
struct FTWeaponParticleComponent
{
	class UParticleSystem*                             ParticleSystem;                                   		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       SocketName;                                       		// 0x0004 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBKWeaponParams.TWeaponComponents
// 0x0060
struct FTWeaponComponents
{
	struct FName                                       AttachToHandBoneName;                             		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       HolsterSocketName;                                		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       MuzzleFlashSocketName;                            		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       ShellEjectSocketName;                             		// 0x0018 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     vScale3D;                                         		// 0x0020 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     vTranslation;                                     		// 0x002C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FRotator                                    rRotation;                                        		// 0x0038 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bSkipPostprocess1P : 1;                           		// 0x0044 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	TArray< struct FTWeaponParticleComponent >         rParticleSystems;                                 		// 0x0048 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< class UMaterialInterface* >                rMaterialOverrides;                               		// 0x0054 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct PlanBGame.PBNWeaponParams.PBNWeaponModInfo
// 0x0084
struct FPBNWeaponModInfo
{
	struct FString                                     ModMenuName;                                      		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     ModMenuDescription;                               		// 0x000C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     ModMenuCategory;                                  		// 0x0018 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UPBNWeaponMod*                               ModParamRef;                                      		// 0x0024 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FGuid                                       GlobalIdentifier;                                 		// 0x0028 (0x0010) [0x0000000000000002]              ( CPF_Const )
	struct FString                                     GlobalIdentifierStr;                              		// 0x0038 (0x000C) [0x0000000000402003]              ( CPF_Edit | CPF_Const | CPF_Transient | CPF_NeedCtorLink )
	int                                                Price;                                            		// 0x0044 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                RealMoneyPrice;                                   		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                requiredRank;                                     		// 0x004C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FPBGameItem_IconCoordsInfo                  ModIcon;                                          		// 0x0050 (0x001C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     Mesh1P_Ref;                                       		// 0x006C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     Mesh3P_Ref;                                       		// 0x0078 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct PlanBGame.PBNWeaponParams.PBNWeaponModType
// 0x00A8
struct FPBNWeaponModType
{
	unsigned char                                      ModType;                                          		// 0x0000 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	struct FPBNWeaponModInfo                           DefaultMod;                                       		// 0x0004 (0x0084) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FPBNWeaponModInfo >                 AvailableMods;                                    		// 0x0088 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FWeaponTextureRegion                        TextureRgn;                                       		// 0x0094 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	int                                                TextureMergeOrder;                                		// 0x00A4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBKWeaponParams.TFireEffectsPattern
// 0x000C
struct FTFireEffectsPattern
{
	TArray< unsigned char >                            Pattern;                                          		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct PlanBGame.PBSkelControl_Recoil.RecoilParams
// 0x0004
struct FRecoilParams
{
	unsigned char                                      X;                                                		// 0x0000 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      Y;                                                		// 0x0001 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      Z;                                                		// 0x0002 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      Padding;                                          		// 0x0003 (0x0001) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
};

// ScriptStruct PlanBGame.PBSkelControl_Recoil.RecoilDef
// 0x0070
struct FRecoilDef
{
	float                                              TimeToGo;                                         		// 0x0000 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              TimeDuration;                                     		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     RotAmplitude;                                     		// 0x0008 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     RotFrequency;                                     		// 0x0014 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     RotSinOffset;                                     		// 0x0020 (0x000C) [0x0000000000000000]              
	struct FRecoilParams                               RotParams;                                        		// 0x002C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FRotator                                    RotOffset;                                        		// 0x0030 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FVector                                     LocAmplitude;                                     		// 0x003C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     LocFrequency;                                     		// 0x0048 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     LocSinOffset;                                     		// 0x0054 (0x000C) [0x0000000000000000]              
	struct FRecoilParams                               LocParams;                                        		// 0x0060 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     LocOffset;                                        		// 0x0064 (0x000C) [0x0000000000002000]              ( CPF_Transient )
};

// ScriptStruct PlanBGame.PBSkill.PBSkillImprovementInfo
// 0x0004
struct FPBSkillImprovementInfo
{
	unsigned long                                      bIsMasterUpgrade : 1;                             		// 0x0000 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBPawn.BodyStance
// 0x000C
struct FBodyStance
{
	TArray< struct FName >                             AnimName;                                         		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct PlanBGame.PBPawn.PBDamagePerPlayer
// 0x0008
struct FPBDamagePerPlayer
{
	class AController*                                 Instigator;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                Damage;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct PlanBGame.PBPawn.AttentionIndicator
// 0x000C
struct FAttentionIndicator
{
	int                                                Damage;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              DeactivationDate;                                 		// 0x0004 (0x0004) [0x0000000000000000]              
	class UClass*                                      DamageType;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct PlanBGame.PBPawn.DamageIndicator
// 0x0018
struct FDamageIndicator
{
	struct FVector                                     WorldDirection;                                   		// 0x0000 (0x000C) [0x0000000000000000]              
	int                                                Damage;                                           		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              DeactivationDate;                                 		// 0x0010 (0x0004) [0x0000000000000000]              
	class UClass*                                      DamageType;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
};

// ScriptStruct PlanBGame.PBWeaponStatistics.TDeathMessageStruct
// 0x0040
struct FTDeathMessageStruct
{
	class AController*                                 Killer;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	class AController*                                 Victim;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned char                                      SpecialDeath;                                     		// 0x0008 (0x0001) [0x0000000000000000]              
	int                                                nCausedDamage;                                    		// 0x000C (0x0004) [0x0000000000000000]              
	struct FSWeaponCode                                WeaponCode;                                       		// 0x0010 (0x000C) [0x0000000000000000]              
	class APBKWeapon*                                  Weapon;                                           		// 0x001C (0x0004) [0x0000000000000000]              
	class UClass*                                      dmgType;                                          		// 0x0020 (0x0004) [0x0000000000000000]              
	class AActor*                                      DamageCauser;                                     		// 0x0024 (0x0004) [0x0000000000000000]              
	class APawn*                                       VictimPawn;                                       		// 0x0028 (0x0004) [0x0000000000000000]              
	unsigned long                                      bVictimPawnReloading : 1;                         		// 0x002C (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     sSkillWeaponCode;                                 		// 0x0030 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                HitZone;                                          		// 0x003C (0x0004) [0x0000000000000000]              
};

// ScriptStruct PlanBGame.PBPawn.ViewShakeInfo
// 0x0040
struct FViewShakeInfo
{
	struct FVector                                     OffsetMag;                                        		// 0x0000 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     OffsetRate;                                       		// 0x000C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              OffsetTime;                                       		// 0x0018 (0x0004) [0x0000000000000000]              
	struct FVector                                     RotMag;                                           		// 0x001C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     RotRateIn;                                        		// 0x0028 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     RotRateOut;                                       		// 0x0034 (0x000C) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct PlanBGame.PBMapList.GameSetupOptionValue
// 0x0018
struct FGameSetupOptionValue
{
	struct FString                                     LocalizedSetupOptionValue;                        		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     Value;                                            		// 0x000C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct PlanBGame.PBMapList.GameSetupOption
// 0x0020
struct FGameSetupOption
{
	unsigned char                                      GameSetupOptionType;                              		// 0x0000 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     LocalizedSetupOptionName;                         		// 0x0004 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	int                                                iDefaultOptionValueIndex;                         		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
