/*
#############################################################################################
# Bullet Run (Unknown) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: PlanBFramework_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function PlanBFramework.PBBaseFlock.HearNoise
// [0x00024900] ( FUNC_Event )
struct APBBaseFlock_eventHearNoise_Parms
{
	float                                              Loudness;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      NoiseMaker;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       NoiseType;                                        		// 0x0008 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function PlanBFramework.PBBaseGameReplicationInfo.SetNoStreamWorldTextureForFrames
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct APBBaseGameReplicationInfo_execSetNoStreamWorldTextureForFrames_Parms
{
	int                                                NumFrames;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBFramework.PBBaseGameReplicationInfo.PostBeginPlay
// [0x00020102] 
struct APBBaseGameReplicationInfo_execPostBeginPlay_Parms
{
};

// Function PlanBFramework.PBBasePawn.IsFullBodyAnimPlaying
// [0x00020100] 
struct APBBasePawn_execIsFullBodyAnimPlaying_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePawn.PlayFullBodyAnim
// [0x00024100] 
struct APBBasePawn_execPlayFullBodyAnim_Parms
{
	struct FName                                       AnimName;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      Cycle : 1;                                        		// 0x0008 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	float                                              AnimRate;                                         		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bPauseAtEnd : 1;                                  		// 0x0010 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePawn.PlayFullRagDoll
// [0x00020100] 
struct APBBasePawn_execPlayFullRagDoll_Parms
{
};

// Function PlanBFramework.PBBasePawn.RigidBodyCollision
// [0x00420902] ( FUNC_Event )
struct APBBasePawn_eventRigidBodyCollision_Parms
{
	class UPrimitiveComponent*                         HitComponent;                                     		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	class UPrimitiveComponent*                         OtherComponent;                                   		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FCollisionImpactData                        RigidCollisionData;                               		// 0x0008 (0x0024) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                ContactIndex;                                     		// 0x002C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBFramework.PBBasePawn.OnTimer_SwitchOffMotors
// [0x00020100] 
struct APBBasePawn_execOnTimer_SwitchOffMotors_Parms
{
};

// Function PlanBFramework.PBBasePawn.OnPhysicsChanged
// [0x00020802] ( FUNC_Event )
struct APBBasePawn_eventOnPhysicsChanged_Parms
{
	unsigned char                                      oldPhysics;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBFramework.PBBasePawn.IsUpperBoneName
// [0x00020103] ( FUNC_Final )
struct APBBasePawn_execIsUpperBoneName_Parms
{
	struct FName                                       InName;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePawn.IsLowerBoneName
// [0x00020103] ( FUNC_Final )
struct APBBasePawn_execIsLowerBoneName_Parms
{
	struct FName                                       InName;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// TArray< struct FName >                          lowerBodyBoneNames;                               		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             I;                                                		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.SetUpperBonesFixed
// [0x00020102] 
struct APBBasePawn_execSetUpperBonesFixed_Parms
{
	unsigned long                                      bFixed : 1;                                       		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// class URB_BodyInstance*                         BodyInst;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
	// class URB_BodySetup*                            BodySetup;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.SetLowerBonesFixed
// [0x00020102] 
struct APBBasePawn_execSetLowerBonesFixed_Parms
{
	unsigned long                                      bFixed : 1;                                       		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// class URB_BodyInstance*                         BodyInst;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
	// class URB_BodySetup*                            BodySetup;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.SetAllBonesFixed
// [0x00020102] 
struct APBBasePawn_execSetAllBonesFixed_Parms
{
	unsigned long                                      bFixed : 1;                                       		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// class URB_BodyInstance*                         BodyInst;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.HasFixedBones
// [0x00020102] 
struct APBBasePawn_execHasFixedBones_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// unsigned long                                   bFixed : 1;                                       		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// class URB_BodyInstance*                         BodyInst;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.TerminateCustomRagdoll
// [0x00020102] 
struct APBBasePawn_execTerminateCustomRagdoll_Parms
{
};

// Function PlanBFramework.PBBasePawn.InitCustomRagdoll
// [0x00020100] 
struct APBBasePawn_execInitCustomRagdoll_Parms
{
	unsigned char                                      targetPhysics;                                    		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBFramework.PBBasePawn.TerminateRagdoll
// [0x00020103] ( FUNC_Final )
struct APBBasePawn_execTerminateRagdoll_Parms
{
};

// Function PlanBFramework.PBBasePawn.IsNetworkAuthorityPawn
// [0x00020103] ( FUNC_Final )
struct APBBasePawn_execIsNetworkAuthorityPawn_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// unsigned long                                   bIsNetworkAuthorityPawn : 1;                      		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function PlanBFramework.PBBasePawn.CanRender
// [0x00020103] ( FUNC_Final )
struct APBBasePawn_execCanRender_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// unsigned long                                   bCanRender : 1;                                   		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function PlanBFramework.PBBasePawn.RecoverFromRagdoll
// [0x00020102] 
struct APBBasePawn_execRecoverFromRagdoll_Parms
{
};

// Function PlanBFramework.PBBasePawn.TakeHitBlendedOut
// [0x00020902] ( FUNC_Event )
struct APBBasePawn_eventTakeHitBlendedOut_Parms
{
};

// Function PlanBFramework.PBBasePawn.PlayTakeHitEffects
// [0x00020102] 
struct APBBasePawn_execPlayTakeHitEffects_Parms
{
	// class UClass*                                   PBDamage;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.PlayHit
// [0x00024002] 
struct APBBasePawn_execPlayHit_Parms
{
	float                                              Damage;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AController*                                 InstigatedBy;                                     		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Momentum;                                         		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FTraceHitInfo                               HitInfo;                                          		// 0x0024 (0x001C) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      DamageCauser;                                     		// 0x0040 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	// class APBBasePlayerController*                  Listener;                                         		// 0x0044 (0x0004) [0x0000000000000000]              
	// class UClass*                                   PBDamageType;                                     		// 0x0048 (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.OnVirtualPhysicsWeightChanged
// [0x00020900] ( FUNC_Event )
struct APBBasePawn_eventOnVirtualPhysicsWeightChanged_Parms
{
};

// Function PlanBFramework.PBBasePawn.OnPhysicsWeightChanged
// [0x00020902] ( FUNC_Event )
struct APBBasePawn_eventOnPhysicsWeightChanged_Parms
{
};

// Function PlanBFramework.PBBasePawn.OnPawnCommand
// [0x00022002] 
struct APBBasePawn_execOnPawnCommand_Parms
{
	class APBBasePlayerController*                     playerCtrl;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     strCommand;                                       		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// class APBBasePawn*                              PBBasePawn;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	// unsigned long                                   bIsKinematicCommand : 1;                          		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function PlanBFramework.PBBasePawn.OnBlendRagdollChildAnimEnd
// [0x00020902] ( FUNC_Event )
struct APBBasePawn_eventOnBlendRagdollChildAnimEnd_Parms
{
	unsigned char                                      eChild;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBFramework.PBBasePawn.ServerSlideDown
// [0x002200C2] 
struct APBBasePawn_execServerSlideDown_Parms
{
	unsigned long                                      bSlide : 1;                                       		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PlanBFramework.PBBasePawn.OnDuck
// [0x00020103] ( FUNC_Final )
struct APBBasePawn_execOnDuck_Parms
{
	unsigned long                                      bDucked : 1;                                      		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PlanBFramework.PBBasePawn.TeleportToSpot
// [0x00020102] 
struct APBBasePawn_execTeleportToSpot_Parms
{
	class ANavigationPoint*                            Spot;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bUpdateRotation : 1;                              		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PlanBFramework.PBBasePawn.StopWeaponFiring
// [0x00020000] 
struct APBBasePawn_execStopWeaponFiring_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePawn.PostRenderFor
// [0x00020100] 
struct APBBasePawn_execPostRenderFor_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UCanvas*                                     Canvas;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CameraPosition;                                   		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CameraDir;                                        		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBFramework.PBBasePawn.GetLowerBoneNames
// [0x00420102] 
struct APBBasePawn_execGetLowerBoneNames_Parms
{
	TArray< struct FName >                             lowerBodyBoneNames;                               		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function PlanBFramework.PBBasePawn.IsFirstPerson
// [0x00020102] 
struct APBBasePawn_execIsFirstPerson_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class APBBasePlayerController*                  PlayerController;                                 		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.GetHeadLocAndRot
// [0x00C20103] ( FUNC_Final )
struct APBBasePawn_execGetHeadLocAndRot_Parms
{
	struct FVector                                     HeadLoc;                                          		// 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FRotator                                    headRot;                                          		// 0x000C (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  vHeadLoc;                                         		// 0x001C (0x000C) [0x0000000000000000]              
	// struct FQuat                                    qHeadRot;                                         		// 0x0030 (0x0010) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.GetHeadLocation
// [0x00C20903] ( FUNC_Final | FUNC_Event )
struct APBBasePawn_eventGetHeadLocation_Parms
{
	struct FVector                                     out_vHeadLocation;                                		// 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  HeadLoc;                                          		// 0x0010 (0x000C) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.TickCameraEyeHeight_Smoothing
// [0x00020903] ( FUNC_Final | FUNC_Event )
struct APBBasePawn_eventTickCameraEyeHeight_Smoothing_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           fSmoothingFactor;                                 		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.TickCameraEyePlane_Smoothing
// [0x00020903] ( FUNC_Final | FUNC_Event )
struct APBBasePawn_eventTickCameraEyePlane_Smoothing_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// float                                           fSmoothingFactor;                                 		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.Tick_SmoothValue
// [0x00020103] ( FUNC_Final )
struct APBBasePawn_execTick_SmoothValue_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fSmoothingFactor;                                 		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fCurrentValue;                                    		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fTargetValue;                                     		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           fTargetDistance;                                  		// 0x0014 (0x0004) [0x0000000000000000]              
	// float                                           fSmoothDelta;                                     		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.IsAlive
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct APBBasePawn_execIsAlive_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePawn.TraceTest
// [0x00820102] 
struct APBBasePawn_execTraceTest_Parms
{
	// struct FVector                                  HitLocation;                                      		// 0x0000 (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitNormal;                                        		// 0x000C (0x000C) [0x0000000000000000]              
	// struct FVector                                  TraceStart;                                       		// 0x0018 (0x000C) [0x0000000000000000]              
	// struct FVector                                  TraceEnd;                                         		// 0x0024 (0x000C) [0x0000000000000000]              
	// struct FVector                                  Direction;                                        		// 0x0030 (0x000C) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.GetHitInfo
// [0x00020103] ( FUNC_Final )
struct APBBasePawn_execGetHitInfo_Parms
{
	struct FTakeHitInfo                                ReturnValue;                                      		// 0x0000 (0x0040) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePawn.UpdatePawnViewLocation
// [0x00820102] 
struct APBBasePawn_execUpdatePawnViewLocation_Parms
{
	// struct FVector                                  vPivot;                                           		// 0x0000 (0x000C) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.GetPawnViewLocation
// [0x00020102] 
struct APBBasePawn_execGetPawnViewLocation_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePawn.SetUpdateSkelWhenNotRendered
// [0x00024100] 
struct APBBasePawn_execSetUpdateSkelWhenNotRendered_Parms
{
	unsigned long                                      bValue : 1;                                       		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function PlanBFramework.PBBasePawn.GetDebugStringArray
// [0x00420100] 
struct APBBasePawn_execGetDebugStringArray_Parms
{
	TArray< struct FString >                           DebugInfo;                                        		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function PlanBFramework.PBBasePawn.GetBasePlayerController
// [0x00020102] 
struct APBBasePawn_execGetBasePlayerController_Parms
{
	class APBBasePlayerController*                     ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePawn.FreezeRagDoll
// [0x00020100] 
struct APBBasePawn_execFreezeRagDoll_Parms
{
	unsigned long                                      bFreeze : 1;                                      		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PlanBFramework.PBBasePawn.EncroachedBy
// [0x00020802] ( FUNC_Event )
struct APBBasePawn_eventEncroachedBy_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class APBBasePawn*                              P;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.DrawStaticDebug
// [0x00822002] 
struct APBBasePawn_execDrawStaticDebug_Parms
{
	class APBBasePlayerController*                     localPlayerCtrl;                                  		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UCanvas*                                     Canvas;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class APBBasePawn*                              P;                                                		// 0x0008 (0x0004) [0x0000000000000000]              
	// class UFont*                                    PrevFont;                                         		// 0x000C (0x0004) [0x0000000000000000]              
	// struct FVector                                  ViewPoint;                                        		// 0x0010 (0x000C) [0x0000000000000000]              
	// struct FVector                                  ViewDir;                                          		// 0x001C (0x000C) [0x0000000000000000]              
	// struct FRotator                                 ViewRotation;                                     		// 0x0028 (0x000C) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.AddVelocity
// [0x00024000] 
struct APBBasePawn_execAddVelocity_Parms
{
	struct FVector                                     NewVelocity;                                      		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FTraceHitInfo                               HitInfo;                                          		// 0x001C (0x001C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function PlanBFramework.PBBasePawn.PlayBleedEffects
// [0x00020102] 
struct APBBasePawn_execPlayBleedEffects_Parms
{
	// class APlayerController*                        LocalPlayerController;                            		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.PlayRagDoll
// [0x00820102] 
struct APBBasePawn_execPlayRagDoll_Parms
{
	// struct FVector                                  vDirection;                                       		// 0x0000 (0x000C) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.Suicide
// [0x00020002] 
struct APBBasePawn_execSuicide_Parms
{
};

// Function PlanBFramework.PBBasePawn.SetHandIKEnabled
// [0x00020100] 
struct APBBasePawn_execSetHandIKEnabled_Parms
{
	unsigned long                                      bEnabled : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PlanBFramework.PBBasePawn.ResetCharPhysState
// [0x00020102] 
struct APBBasePawn_execResetCharPhysState_Parms
{
};

// Function PlanBFramework.PBBasePawn.SetPawnRBChannels
// [0x00020102] 
struct APBBasePawn_execSetPawnRBChannels_Parms
{
	unsigned long                                      bRagdollMode : 1;                                 		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PlanBFramework.PBBasePawn.StopAllAnimations
// [0x00020102] 
struct APBBasePawn_execStopAllAnimations_Parms
{
	// class UAnimNodeSequence*                        SeqNode;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.GoIntoRagdoll
// [0x00820102] 
struct APBBasePawn_execGoIntoRagdoll_Parms
{
	class UClass*                                      DamageType;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FTraceHitInfo                               HitInfo;                                          		// 0x0004 (0x001C) [0x0000000000000080]              ( CPF_Parm )
	// class URB_BodyInstance*                         HipBodyInst;                                      		// 0x0020 (0x0004) [0x0000000000000000]              
	// struct FMatrix                                  DummyMatrix;                                      		// 0x0030 (0x0040) [0x0000000000000000]              
	// struct FVector                                  ApplyImpulse;                                     		// 0x0070 (0x000C) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.PlayDying
// [0x00820102] 
struct APBBasePawn_execPlayDying_Parms
{
	class UClass*                                      DamageType;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLoc;                                           		// 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// struct FVector                                  ApplyImpulse;                                     		// 0x0010 (0x000C) [0x0000000000000000]              
	// struct FVector                                  ShotDir;                                          		// 0x001C (0x000C) [0x0000000000000000]              
	// struct FTraceHitInfo                            HitInfo;                                          		// 0x0028 (0x001C) [0x0000000000000000]              
	// class APlayerController*                        PC;                                               		// 0x0044 (0x0004) [0x0000000000000000]              
	// unsigned long                                   bPlayersRagdoll : 1;                              		// 0x0048 (0x0004) [0x0000000000000000] [0x00000001] 
	// class UClass*                                   PBDamageType;                                     		// 0x004C (0x0004) [0x0000000000000000]              
	// struct FName                                    DeathAnimName;                                    		// 0x0050 (0x0008) [0x0000000000000000]              
	// struct FVector                                  vHitDirection;                                    		// 0x0058 (0x000C) [0x0000000000000000]              
	// struct FVector                                  vRot;                                             		// 0x0064 (0x000C) [0x0000000000000000]              
	// float                                           dirDotHit;                                        		// 0x0070 (0x0004) [0x0000000000000000]              
	// unsigned long                                   bBehindShot : 1;                                  		// 0x0074 (0x0004) [0x0000000000000000] [0x00000001] 
	// float                                           TimeToBlendRangdoll;                              		// 0x0078 (0x0004) [0x0000000000000000]              
	// float                                           fDeathAnimLength;                                 		// 0x007C (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.CanGrabLadder
// [0x00020002] 
struct APBBasePawn_execCanGrabLadder_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           fKmH_Z;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePawn.Bleed
// [0x00420100] 
struct APBBasePawn_execBleed_Parms
{
	struct FTakeHitInfo                                HitInfo;                                          		// 0x0000 (0x0040) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function PlanBFramework.PBBasePawn.ReplicatedEvent
// [0x00020902] ( FUNC_Event )
struct APBBasePawn_eventReplicatedEvent_Parms
{
	struct FName                                       VarName;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBFramework.PBBasePawn.GetWeaponInHandBoneName
// [0x00020102] 
struct APBBasePawn_execGetWeaponInHandBoneName_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePawn.HasRagdoll
// [0x00020501] ( FUNC_Final | FUNC_Native )
struct APBBasePawn_execHasRagdoll_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePawn.IsLayingOnBack
// [0x00020501] ( FUNC_Final | FUNC_Native )
struct APBBasePawn_execIsLayingOnBack_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePawn.GetPhysicsWeight
// [0x00020501] ( FUNC_Final | FUNC_Native )
struct APBBasePawn_execGetPhysicsWeight_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePawn.RestorePreRagdollCollisionComponent
// [0x00020400] ( FUNC_Native )
struct APBBasePawn_execRestorePreRagdollCollisionComponent_Parms
{
};

// Function PlanBFramework.PBBasePlayerController.UpdateWeaponRotation
// [0x00020100] 
struct APBBasePlayerController_execUpdateWeaponRotation_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBFramework.PBBasePlayerController.UpdateCameraModeBlendFactor
// [0x00020102] 
struct APBBasePlayerController_execUpdateCameraModeBlendFactor_Parms
{
	float                                              fDeltaTime;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// float                                           fCameraBlendModeVelocity;                         		// 0x0004 (0x0004) [0x0000000000000000]              
	// float                                           fMultiplicator;                                   		// 0x0008 (0x0004) [0x0000000000000000]              
	// float                                           fLastCameraModeBlendFactor;                       		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePlayerController.GetPlayerViewPoint
// [0x00420102] 
struct APBBasePlayerController_execGetPlayerViewPoint_Parms
{
	struct FVector                                     POVLocation;                                      		// 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FRotator                                    POVRotation;                                      		// 0x000C (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function PlanBFramework.PBBasePlayerController.TestNavigation
// [0x00020102] 
struct APBBasePlayerController_execTestNavigation_Parms
{
	// class ANavigationPoint*                         navPoint;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	// class ANavigationPoint*                         nextNavPoint;                                     		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePlayerController.SetCameraMode
// [0x00020002] 
struct APBBasePlayerController_execSetCameraMode_Parms
{
	struct FName                                       NewCamMode;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// unsigned long                                   bCameraModeChanged : 1;                           		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function PlanBFramework.PBBasePlayerController.SetBehindView
// [0x00020102] 
struct APBBasePlayerController_execSetBehindView_Parms
{
	unsigned long                                      bNewBehindView : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function PlanBFramework.PBBasePlayerController.ServerSuicide
// [0x002200C2] 
struct APBBasePlayerController_execServerSuicide_Parms
{
};

// Function PlanBFramework.PBBasePlayerController.ServerSetCameraMode
// [0x002200C2] 
struct APBBasePlayerController_execServerSetCameraMode_Parms
{
	struct FName                                       NewCamMode;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBFramework.PBBasePlayerController.OnCameraTransitionFinished
// [0x00020100] 
struct APBBasePlayerController_execOnCameraTransitionFinished_Parms
{
};

// Function PlanBFramework.PBBasePlayerController.OnCameraModeChanged
// [0x00020102] 
struct APBBasePlayerController_execOnCameraModeChanged_Parms
{
	struct FName                                       NewCamMode;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// unsigned long                                   bIsServer : 1;                                    		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function PlanBFramework.PBBasePlayerController.NotifyKilled
// [0x00020002] 
struct APBBasePlayerController_execNotifyKilled_Parms
{
	class AController*                                 Killer;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AController*                                 Killed;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class APawn*                                       KilledPawn;                                       		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      damageTyp;                                        		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBFramework.PBBasePlayerController.IsFreeCamera
// [0x00020102] 
struct APBBasePlayerController_execIsFreeCamera_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePlayerController.IsSecurityCamera
// [0x00020102] 
struct APBBasePlayerController_execIsSecurityCamera_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePlayerController.IsThirdPerson
// [0x00020102] 
struct APBBasePlayerController_execIsThirdPerson_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePlayerController.IsFirstPerson
// [0x00020103] ( FUNC_Final )
struct APBBasePlayerController_execIsFirstPerson_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePlayerController.ResetCameraMode
// [0x00020802] ( FUNC_Event )
struct APBBasePlayerController_eventResetCameraMode_Parms
{
};

// Function PlanBFramework.PBBasePlayerController.ShouldInterpolateWeaponRotation
// [0x00020102] 
struct APBBasePlayerController_execShouldInterpolateWeaponRotation_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePlayerController.SetCameraAction
// [0x00020102] 
struct APBBasePlayerController_execSetCameraAction_Parms
{
	class APBCameraAction*                             pAction;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class APBCameraAction*                             ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePlayerController.GetCameraManager
// [0x00020102] 
struct APBBasePlayerController_execGetCameraManager_Parms
{
	class APBCameraActionManager*                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePlayerController.ClientSetCameraMode
// [0x010201C2] 
struct APBBasePlayerController_execClientSetCameraMode_Parms
{
	struct FName                                       NewCamMode;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function PlanBFramework.PBBasePlayerController.ClientStopActorSoundComponent
// [0x00020102] 
struct APBBasePlayerController_execClientStopActorSoundComponent_Parms
{
	class USoundCue*                                   ASound;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      SourceActor;                                      		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              FadeOutTime;                                      		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class UAudioComponent*                          AC;                                               		// 0x000C (0x0004) [0x0000000004000000]              ( CPF_EditInline )
	// class UAudioComponent*                          CheckAC;                                          		// 0x0010 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
};

// Function PlanBFramework.PBBasePlayerController.ClientHearSound
// [0x01024942] ( FUNC_Event )
struct APBBasePlayerController_eventClientHearSound_Parms
{
	class USoundCue*                                   ASound;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      SourceActor;                                      		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     SourceLocation;                                   		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bStopWhenOwnerDestroyed : 1;                      		// 0x0014 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bIsOccluded : 1;                                  		// 0x0018 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	// class UAudioComponent*                          AC;                                               		// 0x001C (0x0004) [0x0000000004000000]              ( CPF_EditInline )
	// float                                           FadeOutTime;                                      		// 0x0020 (0x0004) [0x0000000000000000]              
	// class USoundNodeWave*                           SNW;                                              		// 0x0024 (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePlayerController.CalculateDeltaTime
// [0x00420102] 
struct APBBasePlayerController_execCalculateDeltaTime_Parms
{
	float                                              fDeltaTime;                                       		// 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           fLastTime;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBBasePlayerController.IsDeveloperInstallation
// [0x00022501] ( FUNC_Final | FUNC_Native )
struct APBBasePlayerController_execIsDeveloperInstallation_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePlayerController.GetViewRayDot
// [0x00020501] ( FUNC_Final | FUNC_Native )
struct APBBasePlayerController_execGetViewRayDot_Parms
{
	struct FVector                                     vLocation;                                        		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBBasePlayerController.MapCheck
// [0x00020202] ( FUNC_Exec )
struct APBBasePlayerController_execMapCheck_Parms
{
	struct FString                                     strCommandline;                                   		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PlanBFramework.PBBasePlayerController.PostBeginPlay
// [0x00020902] ( FUNC_Event )
struct APBBasePlayerController_eventPostBeginPlay_Parms
{
};

// Function PlanBFramework.PBBasePlayerController.ShowMapCheckDlg
// [0x00020501] ( FUNC_Final | FUNC_Native )
struct APBBasePlayerController_execShowMapCheckDlg_Parms
{
};

// Function PlanBFramework.PBBasePlayerController.NotifyCameraActionUninstalled
// [0x00020100] 
struct APBBasePlayerController_execNotifyCameraActionUninstalled_Parms
{
};

// Function PlanBFramework.PBBasePlayerController.GetAppSeconds
// [0x00020501] ( FUNC_Final | FUNC_Native )
struct APBBasePlayerController_execGetAppSeconds_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBDebugWindow.Render
// [0x00020102] 
struct UPBDebugWindow_execRender_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             Num;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBDebugWindow.Scroll
// [0x00020102] 
struct UPBDebugWindow_execScroll_Parms
{
};

// Function PlanBFramework.PBDebugWindow.SetText
// [0x00020102] 
struct UPBDebugWindow_execSetText_Parms
{
	struct FString                                     Text;                                             		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PlanBFramework.PBDebugWindow.Close
// [0x00020400] ( FUNC_Native )
struct UPBDebugWindow_execClose_Parms
{
};

// Function PlanBFramework.PBDebugWindow.Text
// [0x00020400] ( FUNC_Native )
struct UPBDebugWindow_execText_Parms
{
	int                                                X;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                Y;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     txt;                                              		// 0x0008 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PlanBFramework.PBDebugWindow.Clear
// [0x00020400] ( FUNC_Native )
struct UPBDebugWindow_execClear_Parms
{
};

// Function PlanBFramework.PBDebugWindow.Open
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UPBDebugWindow_execOpen_Parms
{
	int                                                PosX;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                PosY;                                             		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                Width;                                            		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                Height;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     Title;                                            		// 0x0010 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function PlanBFramework.PBExplosionLight.ValidateLightSetting
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UPBExplosionLight_execValidateLightSetting_Parms
{
};

// Function PlanBFramework.PBExplosionLight.ResetLight
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UPBExplosionLight_execResetLight_Parms
{
};

// Function PlanBFramework.PBLevelCheckCommandlet.Main
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UPBLevelCheckCommandlet_eventMain_Parms
{
	struct FString                                     Params;                                           		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBPhysicsEffectGenerator.SpawnExplosionEffects
// [0x00420102] 
struct UPBPhysicsEffectGenerator_execSpawnExplosionEffects_Parms
{
	struct FExplosionInfo                              expInfo;                                          		// 0x0000 (0x0020) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FVector                                     Location;                                         		// 0x0020 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class AEmitter*                                    ReturnValue;                                      		// 0x002C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class AEmitter*                                 projExplosion;                                    		// 0x0030 (0x0004) [0x0000000000000000]              
	// class UAudioComponent*                          AC;                                               		// 0x0034 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
	// class APlayerController*                        P;                                                		// 0x0038 (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBPhysicsEffectGenerator.SetSoundMode
// [0x00020102] 
struct UPBPhysicsEffectGenerator_execSetSoundMode_Parms
{
	struct FName                                       SoundModeName;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Location;                                         		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              fMaxDistance;                                     		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class UAudioDevice*                             Device;                                           		// 0x0018 (0x0004) [0x0000000000000000]              
	// class APlayerController*                        P;                                                		// 0x001C (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBPhysicsEffectGenerator.CreateExplosionLight
// [0x00420102] 
struct UPBPhysicsEffectGenerator_execCreateExplosionLight_Parms
{
	struct FExplosionInfo                              expInfo;                                          		// 0x0000 (0x0020) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	class AActor*                                      attachTo;                                         		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Location;                                         		// 0x0024 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class UPBExplosionLight*                           ReturnValue;                                      		// 0x0030 (0x0004) [0x0000000004000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline )
	// class UPBExplosionLight*                        L;                                                		// 0x0034 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
	// class UPBExplosionLight*                        presetLight;                                      		// 0x0038 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
	// class UClass*                                   ExplosionLightClass;                              		// 0x003C (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBPhysicsEffectGenerator.ShouldSpawnExplosionLight
// [0x00020102] 
struct UPBPhysicsEffectGenerator_execShouldSpawnExplosionLight_Parms
{
	struct FVector                                     Location;                                         		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class APlayerController*                        P;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function PlanBFramework.PBPhysicsEffectGenerator.SpawnSoundIndicator
// [0x00020100] 
struct UPBPhysicsEffectGenerator_execSpawnSoundIndicator_Parms
{
	class UAudioComponent*                             AC;                                               		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function PlanBFramework.PBPhysicsEffectGenerator.RecurseSoundNodes
// [0x00022102] 
struct UPBPhysicsEffectGenerator_execRecurseSoundNodes_Parms
{
	class USoundNode*                                  sndNode;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             nChildren;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x000C (0x0004) [0x0000000000000000]              
	// class USoundNodeWave*                           sndNodeWave;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
	// unsigned long                                   bValidSoundCue : 1;                               		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function PlanBFramework.PBPhysicsEffectGenerator.IsSoundCueValid
// [0x00022102] 
struct UPBPhysicsEffectGenerator_execIsSoundCueValid_Parms
{
	class USoundCue*                                   sndCue;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function PlanBFramework.PBPhysicsEffectGenerator.CreateActorAudioComponentAt
// [0x00820102] 
struct UPBPhysicsEffectGenerator_execCreateActorAudioComponentAt_Parms
{
